{
    "abstractText": "Emotion detection in conversations is a necessary step for a number of applications, including opinion mining over chat history, social media threads, debates, argumentation mining, understanding consumer feedback in live conversations, and so on. Currently systems do not treat the parties in the conversation individually by adapting to the speaker of each utterance. In this paper, we describe a new method based on recurrent neural networks that keeps track of the individual party states throughout the conversation and uses this information for emotion classification. Our model outperforms the stateof-the-art by a significant margin on two different datasets.",
    "authors": [
        {
            "affiliations": [],
            "name": "Navonil Majumder"
        },
        {
            "affiliations": [],
            "name": "Soujanya Poria"
        },
        {
            "affiliations": [],
            "name": "Devamanyu HazarikaΦ"
        },
        {
            "affiliations": [],
            "name": "Rada Mihalcea"
        },
        {
            "affiliations": [],
            "name": "Alexander Gelbukh"
        },
        {
            "affiliations": [],
            "name": "Erik Cambria"
        }
    ],
    "id": "SP:32aeb2157a010e00491c4913a26ea7789420251a",
    "references": [
        {
            "authors": [
                "C.O. Alm",
                "D. Roth",
                "R. Sproat"
            ],
            "title": "Emotions from text: machine learning for text-based emotion prediction",
            "venue": "Proceedings of the conference on human language technology and empirical methods in natural language processing, 579–586. Association for Computational Linguistics.",
            "year": 2005
        },
        {
            "authors": [
                "O. Arriaga",
                "M. Valdenegro-Toro",
                "P. Plöger"
            ],
            "title": "Realtime convolutional neural networks for emotion and gender classification",
            "venue": "CoRR abs/1710.07557.",
            "year": 2017
        },
        {
            "authors": [
                "D. Bahdanau",
                "K. Cho",
                "Y. Bengio"
            ],
            "title": "Neural machine translation by jointly learning to align and translate",
            "venue": "arXiv preprint arXiv:1409.0473.",
            "year": 2014
        },
        {
            "authors": [
                "C. Busso",
                "M. Bulut",
                "C.-C. Lee",
                "A. Kazemzadeh",
                "E. Mower",
                "S. Kim",
                "J.N. Chang",
                "S. Lee",
                "S.S. Narayanan"
            ],
            "title": "IEMOCAP: Interactive emotional dyadic motion capture database",
            "venue": "Language resources and evaluation 42(4):335–359.",
            "year": 2008
        },
        {
            "authors": [
                "M. Chen",
                "S. Wang",
                "P.P. Liang",
                "T. Baltrušaitis",
                "A. Zadeh",
                "L.-P. Morency"
            ],
            "title": "Multimodal sentiment analysis with word-level fusion and reinforcement learning",
            "venue": "Proceedings of the 19th ACM International Conference on Multimodal Interaction, 163–171. ACM.",
            "year": 2017
        },
        {
            "authors": [
                "J. Chung",
                "Ç. Gülçehre",
                "K. Cho",
                "Y. Bengio"
            ],
            "title": "Empirical Evaluation of Gated Recurrent Neural Networks on Sequence Modeling",
            "venue": "CoRR abs/1412.3555.",
            "year": 2014
        },
        {
            "authors": [
                "D. Datcu",
                "L. Rothkrantz"
            ],
            "title": "Semantic audio-visual data fusion for automatic emotion recognition",
            "venue": "Euromedia’2008.",
            "year": 2008
        },
        {
            "authors": [
                "P. Ekman"
            ],
            "title": "Facial expression and emotion",
            "venue": "American psychologist 48(4):384.",
            "year": 1993
        },
        {
            "authors": [
                "F. Eyben",
                "M. Wöllmer",
                "B. Schuller"
            ],
            "title": "Opensmile: the munich versatile and fast open-source audio feature extractor",
            "venue": "Proceedings of the 18th ACM international conference on Multimedia, 1459–1462. ACM.",
            "year": 2010
        },
        {
            "authors": [
                "A. Graves",
                "G. Wayne",
                "I. Danihelka"
            ],
            "title": "Neural turing machines",
            "venue": "arXiv preprint arXiv:1410.5401.",
            "year": 2014
        },
        {
            "authors": [
                "D. Hazarika",
                "S. Poria",
                "A. Zadeh",
                "E. Cambria",
                "L.-P. Morency",
                "R. Zimmermann"
            ],
            "title": "Conversational Memory Network for Emotion Recognition in Dyadic Dialogue Videos",
            "venue": "Proceedings of the 2018 Conference of the North American Chapter of the Association for Computa-",
            "year": 2018
        },
        {
            "authors": [
                "S. Hochreiter",
                "J. Schmidhuber"
            ],
            "title": "Long short-term memory",
            "venue": "Neural computation 9(8):1735–1780.",
            "year": 1997
        },
        {
            "authors": [
                "Y. Kim"
            ],
            "title": "Convolutional neural networks for sentence classification",
            "venue": "arXiv preprint arXiv:1408.5882.",
            "year": 2014
        },
        {
            "authors": [
                "D.P. Kingma",
                "J. Ba"
            ],
            "title": "Adam: A Method for Stochastic Optimization",
            "venue": "CoRR abs/1412.6980.",
            "year": 2014
        },
        {
            "authors": [
                "A. Kumar",
                "O. Irsoy",
                "P. Ondruska",
                "M. Iyyer",
                "J. Bradbury",
                "I. Gulrajani",
                "V. Zhong",
                "R. Paulus",
                "R. Socher"
            ],
            "title": "Ask me anything: Dynamic memory networks for natural language processing",
            "venue": "International Conference on Machine Learning, 1378–1387.",
            "year": 2016
        },
        {
            "authors": [
                "G. McKeown",
                "M. Valstar",
                "R. Cowie",
                "M. Pantic",
                "M. Schroder"
            ],
            "title": "The SEMAINE Database: Annotated Multimodal Records of Emotionally Colored Conversations between a Person and a Limited Agent",
            "venue": "IEEE Transactions on Affective Computing 3(1):5–17.",
            "year": 2012
        },
        {
            "authors": [
                "R.W. Picard"
            ],
            "title": "Affective computing: From laughter to ieee",
            "venue": "IEEE Transactions on Affective Computing 1(1):11–",
            "year": 2010
        },
        {
            "authors": [
                "S. Poria",
                "E. Cambria",
                "D. Hazarika",
                "N. Majumder",
                "A. Zadeh",
                "L.-P. Morency"
            ],
            "title": "Context-Dependent Sentiment Analysis in User-Generated Videos",
            "venue": "In Proceedings of the 55th Annual Meeting of the Association for Computational Linguistics (Volume",
            "year": 2017
        },
        {
            "authors": [
                "J.M. Richards",
                "E.A. Butler",
                "J.J. Gross"
            ],
            "title": "Emotion regulation in romantic relationships: The cognitive consequences of concealing feelings",
            "venue": "Journal of Social and Personal Relationships 20(5):599–620.",
            "year": 2003
        },
        {
            "authors": [
                "J. Ruusuvuori"
            ],
            "title": "Emotion, affect and conversation",
            "venue": "The handbook of conversation analysis 330–349.",
            "year": 2013
        },
        {
            "authors": [
                "B. Schuller",
                "M. Valster",
                "F. Eyben",
                "R. Cowie",
                "M. Pantic"
            ],
            "title": "AVEC 2012: The Continuous Audio/Visual Emotion Challenge",
            "venue": "Proceedings of the 14th ACM International Conference on Multimodal Interaction, ICMI ’12, 449–456. New York, NY, USA: ACM.",
            "year": 2012
        },
        {
            "authors": [
                "C. Strapparava",
                "R. Mihalcea"
            ],
            "title": "Annotating and identifying emotions in text",
            "venue": "Intelligent Information Access. Springer. 21–38.",
            "year": 2010
        },
        {
            "authors": [
                "S. Sukhbaatar",
                "A. Szlam",
                "J. Weston",
                "R. Fergus"
            ],
            "title": "End-to-end Memory Networks",
            "venue": "Proceedings of the 28th International Conference on Neural Information Processing Systems - Volume 2, NIPS’15, 2440–2448. Cambridge, MA, USA: MIT Press.",
            "year": 2015
        },
        {
            "authors": [
                "M. Wöllmer",
                "A. Metallinou",
                "F. Eyben",
                "B. Schuller",
                "S.S. Narayanan"
            ],
            "title": "Context-sensitive multimodal emotion recognition from speech and facial expression using bidirectional lstm modeling",
            "venue": "INTERSPEECH 2010.",
            "year": 2010
        },
        {
            "authors": [
                "A. Zadeh",
                "M. Chen",
                "S. Poria",
                "E. Cambria",
                "L.-P. Morency"
            ],
            "title": "Tensor Fusion Network for Multimodal Sentiment Analysis",
            "venue": "Proceedings of the 2017 Conference on Empirical Methods in Natural Language Processing, 1103– 1114. Copenhagen, Denmark: Association for Computa-",
            "year": 2017
        },
        {
            "authors": [
                "A. Zadeh",
                "P.P. Liang",
                "N. Mazumder",
                "S. Poria",
                "E. Cambria",
                "L.-P. Morency"
            ],
            "title": "Memory Fusion Network for Multi-view Sequential Learning",
            "venue": "AAAI Conference on Artificial Intelligence, 5634–5641.",
            "year": 2018
        },
        {
            "authors": [
                "A. Zadeh",
                "P.P. Liang",
                "S. Poria",
                "P. Vij",
                "E. Cambria",
                "L.-P. Morency"
            ],
            "title": "Multi-attention recurrent network for human communication comprehension",
            "venue": "AAAI Conference on Artificial Intelligence, 5642–5649.",
            "year": 2018
        }
    ],
    "sections": [
        {
            "heading": "1 Introduction",
            "text": "Emotion detection in conversations has been gaining increasing attention from the research community due to its applications in many important tasks such as opinion mining over chat history and social media threads in YouTube, Facebook, Twitter, and so on. In this paper, we present a method based on recurrent neural networks (RNN) that can cater to these needs by processing the huge amount of available conversational data.\nCurrent systems, including the state of the art (Hazarika et al. 2018), do not distinguish different parties in a conversation in a meaningful way. They are not aware of the speaker of a given utterance. In contrast, we model individual parties with party states, as the conversation flows, by relying on the utterance, the context, and current party state. Our model is based on the assumption that there are three major aspects relevant to the emotion in a conversation: the speaker, the context from the preceding utterances, and the emotion of the preceding utterances. These three aspects are not necessarily independent, but their separate modeling significantly outperforms the state-of-the-art (Table 2). In dyadic conversations, the parties have distinct roles. Hence, to extract the context, it is crucial to consider the preceding turns of both the speaker and the listener at a given moment (Fig. 1).\nOur proposed DialogueRNN system employs three gated recurrent units (GRU) (Chung et al. 2014) to model these aspects. The incoming utterance is fed into two GRUs called global GRU and party GRU to update the context and party\nCopyright © 2019, Association for the Advancement of Artificial Intelligence (www.aaai.org). All rights reserved.\nstate, respectively. The global GRU encodes corresponding party information while encoding an utterance.\nAttending over this GRU gives contextual representation that has information of all preceding utterances by different parties in the conversation. The speaker state depends on this context through attention and the speaker’s previous state. This ensures that at time t, the speaker state directly gets information from the speaker’s previous state and global GRU which has information on the preceding parties. Finally, the updated speaker state is fed into the emotion GRU to decode the emotion representation of the given utterance, which is used for emotion classification. At time t, the emotion GRU cell gets the emotion representation of t − 1 and the speaker state of t.\nThe emotion GRU, along with the global GRU, plays a pivotal role in inter-party relation modeling. On the other hand, party GRU models relation between two sequential states of the same party. In DialogueRNN, all these three different types of GRUs are connected in a recurrent manner. We believe that DialogueRNN outperforms state-of-the-art contextual emotion classifiers such as (Hazarika et al. 2018; Poria et al. 2017) because of better context representation.\nThe rest of the paper is organized as follows: Section 2 discusses related work; Section 3 provides detailed description of our model; Sections 4 and 5 present the experimental results; finally, Section 6 concludes the paper."
        },
        {
            "heading": "2 Related Work",
            "text": "Emotion recognition has attracted attention in various fields such as natural language processing, psychology, cognitive science, and so on (Picard 2010). Ekman (1993) found correlation between emotion and facial cues. Datcu and Rothkrantz (2008) fused acoustic information with visual cues for emotion recognition. Alm, Roth, and Sproat (2005) introduced text-based emotion recognition, developed in the work of Strapparava and Mihalcea (2010). Wöllmer et al. (2010) used contextual information for emotion recognition in multimodal setting. Recently, Poria et al. (2017) successfully used RNN-based deep networks for multimodal emotion recognition, which was followed by other works (Chen et al. 2017; Zadeh et al. 2018a; 2018b).\nReproducing human interaction requires deep understanding of conversation. Ruusuvuori (2013) states that emotion plays a pivotal role in conversations. It has been ar-\nar X\niv :1\n81 1.\n00 40\n5v 4\n[ cs\n.C L\n] 2\n5 M\nay 2\n01 9\ngued that emotional dynamics in a conversation is an interpersonal phenomenon (Richards, Butler, and Gross 2003). Hence, our model incorporates inter-personal interactions in an effective way. Further, since conversations have a natural temporal nature, we adopt the temporal nature through recurrent network (Poria et al. 2017).\nMemory networks (Sukhbaatar et al. 2015) has been successful in several NLP areas, including question answering (Sukhbaatar et al. 2015; Kumar et al. 2016), machine translation (Bahdanau, Cho, and Bengio 2014), speech recognition (Graves, Wayne, and Danihelka 2014), and so on. Thus, Hazarika et al. (2018) used memory networks for emotion recognition in dyadic conversations, where two distinct memory networks enabled inter-speaker interaction, yielding state-of-the-art performance."
        },
        {
            "heading": "3 Methodology",
            "text": ""
        },
        {
            "heading": "3.1 Problem Definition",
            "text": "Let there be M parties/participants p1, p2, . . . , pM (M = 2 for the datasets we used) in a conversation. The task is to predict the emotion labels (happy, sad, neutral, angry, excited, and frustrated) of the constituent utterances u1, u2, . . . , uN , where utterance ut is uttered by party ps(ut), while s being the mapping between utterance and index of its corresponding party. Also, ut ∈ RDm is the utterance representation, obtained using feature extractors described below."
        },
        {
            "heading": "3.2 Unimodal Feature Extraction",
            "text": "For a fair comparison with the state-of-the-art method, conversational memory networks (CMN) (Hazarika et al. 2018), we follow identical feature extraction procedures.\nTextual Feature Extraction We employ convolutional neural networks (CNN) for textual feature extraction. Following Kim (2014), we obtain n-gram features from each utterance using three distinct convolution filters of sizes 3, 4, and 5 respectively, each having 50 feature-maps. Outputs are then subjected to max-pooling followed by rectified linear unit (ReLU) activation. These activations are concatenated and fed to a 100 dimensional dense layer, which is regarded as the textual utterance representation. This network is trained at utterance level with the emotion labels.\nAudio and Visual Feature Extraction Identical to Hazarika et al. (2018), we use 3D-CNN and openSMILE (Eyben, Wöllmer, and Schuller 2010) for visual and acoustic feature extraction, respectively."
        },
        {
            "heading": "3.3 Our Model",
            "text": "We assume that the emotion of an utterance in a conversation depends on three major factors:\n1. the speaker.\n2. the context given by the preceding utterances.\n3. the emotion behind the preceding utterances.\nOur model DialogueRNN,1 shown in Fig. 2a, models these three factors as follows: each party is modeled using a party state which changes as and when that party utters an utterance. This enables the model to track the parties’ emotion dynamics through the conversations, which is related to the emotion behind the utterances. Furthermore, the context of an utterance is modeled using a global state (called global, because of being shared among the parties), where the preceding utterances and the party states are jointly encoded for context representation, necessary for accurate party state representation. Finally, the model infers emotion representation from the party state of the speaker along with the preceding speakers’ states as context. This emotion representation is used for the final emotion classification.\nWe use GRU cells (Chung et al. 2014) to update the states and representations. Each GRU cell computes a hidden state defined as ht = GRU∗(ht−1, xt), where xt is the current input and ht−1 is the previous GRU state. ht also serves as the current GRU output. We provide the GRU computation details in the supplementary. GRUs are efficient networks with trainable parameters: W {r,z,c}∗,{h,x} and b {r,z,c} ∗ .\nWe model the emotion representation of the current utterance as a function of the emotion representation of the previous utterance and the state of the current speaker. Finally, this emotion representation is sent to a softmax layer for emotion classification.\nGlobal State (Global GRU) Global state aims to capture the context of a given utterance by jointly encoding utterance and speaker state. Each state also serves as speaker-specific utterance representation. Attending on these states facilitates the inter-speaker and inter-utterance dependencies to produce improved context representation. The current utterance ut changes the speaker’s state from qs(ut),t−1 to qs(ut),t. We capture this change with GRU cell GRUG with output size DG , using ut and qs(ut),t−1:\ngt = GRUG(gt−1, (ut ⊕ qs(ut),t−1)), (1)\nwhere DG is the size of global state vector, DP is the size of party state vector, W {r,z,c}G,h ∈ RDG×DG , W {r,z,c} G,x ∈ RDG×(Dm+DP), b{r,z,c}G ∈ RDG , qs(ut),t−1 ∈ RDP , gt, gt−1 ∈ RDG ,DP is party state size, and ⊕ represents concatenation.\n1Implementation available at https://github.com/ senticnet/conv-emotion\nParty State (Party GRU) DialogueRNN keeps track of the state of individual speakers using fixed size vectors q1, q2, . . . , qM through out the conversation. These states are representative of the speakers’ state in the conversation, relevant to emotion classification. We update these states based on the current (at time t) role of a participant in the conversation, which is either speaker or listener, and the incoming utterance ut. These state vectors are initialized with null vectors for all the participants. The main purpose of this module is to ensure that the model is aware of the speaker of each utterance and handle it accordingly.\nSpeaker Update (Speaker GRU): Speaker usually frames the response based on the context, which is the preceding utterances in the conversation. Hence, we capture context ct relevant to the utterance ut as follows:\nα = softmax(uTt Wα[g1, g2, . . . , gt−1]), (2) softmax(x) = [ex1/Σiexi , ex2/Σiexi , . . . ], (3)\nct = α[g1, g2, . . . , gt−1]T , (4)\nwhere g1, g2, . . . , gt−1 are preceding t − 1 global states (gi ∈ RDG ), Wα ∈ RDm×DG , αT ∈ R(t−1), and ct ∈ RDG . In Eq. (2), we calculate attention scores α over the previous global states representative of the previous utterances. This assigns higher attention scores to the utterances emotionally relevant to ut. Finally, in Eq. (4) the context vector ct is calculated by pooling the previous global states with α.\nNow, we employ a GRU cell GRUP to update the current speaker state qs(ut),t−1 to the new state qs(ut),t based on incoming utterance ut and context ct using GRU cell GRUP of output size DP\nqs(ut),t = GRUP(qs(ut),t−1, (ut ⊕ ct)), (5)\nwhere W {r,z,c}P,h ∈ RDP×DP , W {r,z,c} P,x ∈ RDP×(Dm+DG), b {r,z,c} P ∈ RDP , and qs(ut),t, qs(ut),t−1 ∈ RDP . This encodes the information on the current utterance along with its context from the global GRU into the speaker’s state qs(ut), which helps in emotion classification down the line.\nListener Update: Listener state models the listeners’ change of state due to the speaker’s utterance. We tried two listener state update mechanisms: • Simply keep the state of the listener unchanged, that is\n∀i ≠ s(ut), qi,t = qi,t−1. (6)\n• Employ another GRU cell GRUL to update the listener state based on listener visual cues (facial expression) vi,t and its context ct, as\n∀i ≠ s(ut), qi,t = GRUL(qi,t−1, (vi,t ⊕ ct)), (7)\nwhere vi,t ∈ RDV , W {r,z,c}L,h ∈ RDP×DP , W {r,z,c} L,x ∈ RDP×(DV+DG), and b{r,z,c}L ∈ RDP . Listener visual features of party i at time t vi,t are extracted using the model introduced by Arriaga, Valdenegro-Toro, and Plöger (2017), pretrained on FER2013 dataset, where feature size DV = 7.\nThe simpler first approach turns out to be sufficient, since the second approach yields very similar result while increasing number of parameters. This is due to the fact that a listener becomes relevant to the conversation only when he/she speaks. In other words, a silent party has no influence in a conversation. Now, when a party speaks, we update his/her state qi with context ct which contains relevant information on all the preceding utterances, rendering explicit listener state update unnecessary. This is shown in Table 2.\nEmotion Representation (Emotion GRU) We infer the emotionally relevant representation et of utterance ut from the speaker’s state qs(ut),t and the emotion representation of the previous utterance et−1. Since context is important to the emotion of the incoming utterance ut, et−1 feeds fine-tuned emotionally relevant contextual information from other the party states qs(u<t),<t into the emotion representation et. This establishes a connection between the speaker state and the other party states. Hence, we model et with a GRU cell (GRUE ) with output size DE as\net = GRUE(et−1, qs(ut),t), (8) where DE is the size of emotion representation vector, e{t,t−1} ∈ RDE , W {r,z,c}E,h ∈ RDE×DE , W {r,z,c} E,x ∈ RDE×DP , and b{r,z,c}E ∈ RDE . Since speaker state gets information from global states, which serve as speaker-specific utterance representation, one may claim that this way the model already has access to the information on other parties. However, as shown in the ablation study (Section 5.6) emotion GRU helps to improve the performance by directly linking states of preceding parties. Further, we believe that speaker and global GRUs (GRUP , GRUG) jointly act similar to an encoder, whereas emotion GRU serves as a decoder.\nEmotion Classification We use a two-layer perceptron with a final softmax layer to calculate c = 6 emotion-class probabilities from emotion representation et of utterance ut and then we pick the most likely emotion class:\nlt = ReLU(Wlet + bl), (9) Pt = softmax(Wsmaxlt + bsmax), (10) ŷt = argmax\ni (Pt[i]), (11)\nwhere Wl ∈ RDl×DE , bl ∈ RDl , Wsmax ∈ Rc×Dl , bsmax ∈ Rc, Pt ∈ Rc, and ŷt is the predicted label for utterance ut. Training We use categorical cross-entropy along with L2regularization as the measure of loss (L) during training:\nL = − 1 ∑Ns=1 c(s)\nN ∑ i=1\nc(i) ∑ j=1 logPi,j[yi,j] + λ ∥θ∥2 , (12)\nwhere N is the number of samples/dialogues, c(i) is the number of utterances in sample i, Pi,j is the probability distribution of emotion labels for utterance j of dialogue i, yi,j is the expected class label of utterance j of dialogue i, λ is the L2-regularizer weight, and θ is the set of trainable parameters where θ = {Wα,W {r,z,c}P,{h,x}, b {r,z,c} P ,W {r,z,c} G,{h,x}, b {r,z,c} G ,W {r,z,c} E,{h,x},\nb {r,z,c} E ,Wl, bl,Wsmax, bsmax}.\nWe used stochastic gradient descent based Adam (Kingma and Ba 2014) optimizer to train our network. Hyperparameters are optimized using grid search (values are added to the supplementary material)."
        },
        {
            "heading": "3.4 DialogueRNN Variants",
            "text": "We use DialogueRNN (Section 3.3) as the basis for the following models:\nDialogueRNN + Listener State Update (DialogueRNNl): This variant updates the listener state based on the the resulting speaker state qs(ut),t, as described in Eq. (7).\nBidirectional DialogueRNN (BiDialogueRNN): Bidirectional DialogueRNN is analogous to bidirectional RNNs, where two different RNNs are used for forward and backward passes of the input sequence. Outputs from the RNNs are concatenated in sequence level. Similarly, in BiDialogueRNN, the final emotion representation contains information from both past and future utterances in the dialogue through forward and backward DialogueRNNs respectively, which provides better context for emotion classification.\nDialogueRNN + attention (DialogueRNN+Att): For each emotion representation et, attention is applied over all surrounding emotion representations in the dialogue by matching them with et (Eqs. (13) and (14)). This provides context from the relevant (based on attention score) future and preceding utterances.\nBidirectional DialogueRNN + Emotional attention (BiDialogueRNN+Att): For each emotion representation et of BiDialogueRNN, attention is applied over all the emotion representations in the dialogue to capture context from the other utterances in dialogue:\nβt = softmax(eTt Wβ[e1, e2, . . . , eN ]), (13) ẽt = βt[e1, e2, . . . , eN ]T , (14)\nwhere et ∈ R2DE , Wβ ∈ R2DE×2DE , ẽt ∈ R2DE , and βTt ∈ RN . Further, ẽt are fed to a two-layer perceptron for emotion classification, as in Eqs. (9) to (11)."
        },
        {
            "heading": "4 Experimental Setting",
            "text": ""
        },
        {
            "heading": "4.1 Datasets Used",
            "text": "We use two emotion detection datasets IEMOCAP (Busso et al. 2008) and AVEC (Schuller et al. 2012) to evaluate DialogueRNN. We partition both datasets into train and test sets with roughly 80/20 ratio such that the partitions do not share any speaker. Table 1 shows the distribution of train and test samples for both dataset.\nIEMOCAP: IEMOCAP (Busso et al. 2008) dataset contains videos of two-way conversations of ten unique speakers, where only the first eight speakers from session one to four belong to the train-set. Each video contains a single dyadic dialogue, segmented into utterances. The utterances are annotated with one of six emotion labels, which are happy, sad, neutral, angry, excited, and frustrated.\nAVEC: AVEC (Schuller et al. 2012) dataset is a modification of SEMAINE database (McKeown et al. 2012) containing interactions between humans and artificially intelligent agents. Each utterance of a dialogue is annotated with four real valued affective attributes: valence ([−1,1]), arousal ([−1,1]), expectancy ([−1,1]), and power ([0,∞)). The annotations are available every 0.2 seconds in the original database. However, in order to adapt the annotations to our need of utterance-level annotation, we averaged the attributes over the span of an utterance."
        },
        {
            "heading": "4.2 Baselines and State of the Art",
            "text": "For a comprehensive evaluation of DialogueRNN, we compare our model with the following baseline methods:\nc-LSTM (Poria et al. 2017): Biredectional LSTM (Hochreiter and Schmidhuber 1997) is used to capture the context from the surrounding utterances to generate contextaware utterance representation. However, this model does not differentiate among the speakers.\nc-LSTM+Att (Poria et al. 2017): In this variant attention is applied applied to the c-LSTM output at each timestamp by following Eqs. (13) and (14). This provides better context to the final utterance representation.\nTFN (Zadeh et al. 2017): This is specific to multimodal scenario. Tensor outer product is used to capture intermodality and intra-modality interactions. This model does not capture context from surrounding utterances.\nMFN (Zadeh et al. 2018a): Specific to multimodal scenario, this model utilizes multi-view learning by modeling view-specific and cross-view interactions. Similar to TFN, this model does not use contextual information.\nCNN (Kim 2014): This is identical to our textual feature extractor network (Section 3.2) and it does not use contextual information from the surrounding utterances.\nMemnet (Sukhbaatar et al. 2015): As described in Hazarika et al. (2018), the current utterance is fed to a memory network, where the memories correspond to preceding utterances. The output from the memory network is used as the final utterance representation for emotion classification.\nCMN (Hazarika et al. 2018): This state-of-the-art method models utterance context from dialogue history using two distinct GRUs for two speakers. Finally, utterance representation is obtained by feeding the current utterance as query to two distinct memory networks for both speakers."
        },
        {
            "heading": "4.3 Modalities",
            "text": "We evaluated our model primarily on textual modality. However, to substantiate efficacy of our model in multimodal scenario, we also experimented with multimodal features."
        },
        {
            "heading": "5 Results and Discussion",
            "text": "We compare DialogueRNN and its variants with the baselines for textual data in Table 2. As expected, on average DialogueRNN outperforms all the baseline methods, including the state-of-the-art CMN, on both of the datasets."
        },
        {
            "heading": "5.1 Comparison with the State of the Art",
            "text": "We compare the performance of DialogueRNN against the performance of the state-of-the-art CMN on IEMOCAP and AVEC datasets for textual modality.\nIEMOCAP As evidenced by Table 2, for IEMOCAP dataset, our model surpasses the state-of-the-art method CMN by 2.77% accuracy and 3.76% f1-score on average. We think that this enhancement is caused by the fundamental differences between CMN and DialogueRNN, which are\n1. party state modeling with GRUP in Eq. (5), 2. speaker specific utterance treatment in Eqs. (1) and (5), 3. and global state capturing with GRUG in Eq. (1).\nSince we deal with six unbalanced emotion labels, we also explored the model performance for individual labels. DialogueRNN outperforms the state-of-the-art method CMN in five out of six emotion classes by significant margin. For frustrated class, DialogueRNN lags behind CMN by 1.23% f1-score. We think that DialogueRNN may surpass CMN using a standalone classifier for frustrated class. However, it can be observed in Table 2 that some of the other variants of DialogueRNN, like BiDialogueRNN has already outperformed CMN for frustrated class.\nAVEC DialogueRNN outperforms CMN for valence, arousal, expectancy, and power attributes; see Table 2. It yields significantly lower mean absolute error (MAE) and higher Pearson correlation coefficient (r) for all four attributes. We believe this to be due to the incorporation of party state and emotion GRU, which are missing from CMN."
        },
        {
            "heading": "5.2 DialogueRNN vs. DialogueRNN Variants",
            "text": "We discuss the performance of different DialogueRNN variants on IEMOCAP and AVEC datasets for textual modality.\nDialogueRNNl: Following Table 2, using explicit listener state update yields slightly worse performance than regular DialogueRNN. This is true for both IEMOCAP and AVEC datasets in general. However, the only exception to this trend is for happy emotion label for IEMOCAP, where DialogueRNNl outperforms DialogueRNN by 1.71% f1score. We surmise that, this is due to the fact that a listener becomes relevant to the conversation only when he/she speaks. Now, in DialogueRNN, when a party speaks, we update his/her state qi with context ct which contains relevant information on all the preceding utterances, rendering explicit listener state update of DialogueRNNl unnecessary.\nBiDialogueRNN: Since BiDialogueRNN captures context from the future utterances, we expect improved performance from it over DialogueRNN. This is confirmed in Table 2, where BiDialogueRNN outperforms DialogueRNN on average on both datasets.\nDialogueRNN+Attn: DialogueRNN+Attn also uses information from the future utterances. However, here we take information from both past and future utterances by matching them with the current utterance and calculating attention score over them. This provides relevance to emotionally important context utterances, yielding better performance than\nBiDialogueRNN. The improvement over BiDialogueRNN is 1.23% f1-score for IEMOCAP and consistently lower MAE and higher r in AVEC.\nBiDialogueRNN+Attn: Since this setting generates the final emotion representation by attending over the emotion representation from BiDialogueRNN, we expect better performance than both BiDialogueRNN and DialogueRNN+Attn. This is confirmed in Table 2, where this setting performs the best in general than any other methods discussed, on both datasets. This setting yields 6.62% higher f1-score on average than the state-of-the-art CMN and 2.86% higher f1-score than vanilla DialogueRNN for IEMOCAP dataset. For AVEC dataset also, this setting gives the best performance across all the four attributes."
        },
        {
            "heading": "5.3 Multimodal Setting",
            "text": "As both IEMOCAP and AVEC dataset contain multimodal information, we have evaluated DialogueRNN on multimodal features as used and provided by Hazarika et al. (2018). We use concatenation of the unimodal features as a fusion method by following Hazarika et al. (2018), since fusion mechanism is not a focus of this paper. Now, as we can see in Table 3, DialogueRNN significantly outperforms the strong baselines and state-of-the-art method CMN."
        },
        {
            "heading": "5.4 Case Studies",
            "text": "Dependency on preceding utterances (DialogueRNN) One of the crucial components of DialogueRNN is its attention module over the outputs of global GRU (GRUG). Figure 3b shows the α attention vector (Eq. (2)) over the history of a given test utterance compared with the attention vector from the CMN model. The attention of our model is more focused compared with CMN: the latter gives diluted attention\nscores leading to misclassifications. We observe this trend of focused-attention across cases and posit that it can be interpreted as a confidence indicator. Further in this example, the test utterance by PA (turn 44) comprises of a change in emotion from neutral to frustrated. DialogueRNN anticipates this correctly by attending to turn 41 and 42 that are spoken by PA and PB , respectively. These two utterances provide self and inter-party influences that trigger the emotional shift. CMN, however, fails to capture such dependencies and wrongly predicts neutral emotion.\nDependency on future utterances (BiDialogueRNN+Att) Fig. 3a visualizes the β (Eq. (13)) attention over the emotion representations et for a segment of a conversation between a couple. In the discussion, the woman (PA) is initially at a neutral state, whereas the man (PB) is angry throughout. The figure reveals that the emotional attention of the woman is localized to the duration of her neutral state (turns 1-16 approximately). For example, in the dialogue, turns 5,7, and 8 strongly attend to turn 8. Interestingly, turn 5 attends to both past (turn 3) and future (turn 8) utterances. Similar trend across other utterances establish inter-dependence between emotional states of future and past utterances. The beneficial consideration of future utterances through GRUE is also apparent through turns 6,9. These utterances focus on the distant future (turn 49,50) where the man is at an enraged state, thus capturing emotional correlations across time. Although, turn 6 is misclassified by our model, it still manages to infer a related emotional state (anger) against the correct state (frustrated). We analyze more of this trend in section 5.5.\nDependency on distant context For all correct predictions in the IEMOCAP test set in Fig. 3d we summarize the distribution over the relative distance between test utterance and (2nd) highest attended utterance – either in the history or future – in the conversation. This reveals a decreasing trend with the highest dependence being within the local context. However, a significant portion of the test utterances (∼ 18%), attend to utterances that are 20 to 40 turns away from themselves, which highlights the important role of long-term emotional dependencies. Such cases primarily occur in conversations that maintain a specific affective tone and do not incur frequent emotional shifts. Fig. 3c demonstrates a case of long-term context dependency. The presented conversation maintains a happy mood throughout the dialogue. Although the 34th turn comprising the sentence Horrible thing. I hated it. seems to be a negative expres-\nsion, when seen with the global context, it reveals the excitement present in the speaker. To disambiguate such cases, our model attends to distant utterances in the past (turn 11, 14) which serve as prototypes of the emotional tonality of the overall conversation."
        },
        {
            "heading": "5.5 Error Analysis",
            "text": "A noticeable trend in the predictions is the high level of cross-predictions amongst related emotions. Most of the misclassifications by the model for happy emotion are for excited class. Also, anger and frustrated share misclassifications amongst each other. We suspect this is due to subtle difference between those emotion pairs, resulting in harder disambiguation. Another class with high rate of false-positives is the neutral class. Primary reason for this could be its majority in the class distribution over the considered emotions.\nAt the dialogue level, we observe that a significant amount of errors occur at turns having a change of emotion from the previous turn of the same party. Across all the occurrences of these emotional-shifts in the testing set, our model correctly predicts 47.5% instances. This stands less as compared to the 69.2% success that it achieves at regions of no emotional-shift. Changes in emotions in a dialogue is a complex phenomenon governed by latent dynamics. Further improvement of these cases remain as an open area of research."
        },
        {
            "heading": "5.6 Ablation Study",
            "text": "The main novelty of our method is the introduction of party state and emotion GRU (GRUE ). To comprehensively study the impact of these two components, we remove them one at a time and evaluate their impact on IEMOCAP.\nAs expected, following Table 4, party state stands very important, as without its presence the performance falls by 4.33%. We suspect that party state helps in extracting useful contextual information relevant to parties’ emotion.\nEmotion GRU is also impactful, but less than party state, as its absence causes performance to fall by only 2.51%. We believe the reason to be the lack of context flow from the other parties’ states through the emotion representation of the preceding utterances."
        },
        {
            "heading": "6 Conclusion",
            "text": "We have presented an RNN-based neural architecture for emotion detection in a conversation. In contrast to the stateof-the-art method, CMN, our method treats each incoming utterance taking into account the characteristics of the speaker, which gives finer context to the utterance. Our model outperforms the current state-of-the-art on two distinct datasets in both textual and multimodal settings. Our method is designed to be scalable to multi-party setting with more than two speakers, which we plan to explore in future work."
        }
    ],
    "title": "DialogueRNN: An Attentive RNN for Emotion Detection in Conversations",
    "year": 2019
}