{
    "abstractText": "We introduce the “exponential linear unit” (ELU) which speeds up learning in deep neural networks and leads to higher classification accuracies. Like rectified linear units (ReLUs), leaky ReLUs (LReLUs) and parametrized ReLUs (PReLUs), ELUs alleviate the vanishing gradient problem via the identity for positive values. However ELUs have improved learning characteristics compared to the units with other activation functions. In contrast to ReLUs, ELUs have negative values which allows them to push mean unit activations closer to zero like batch normalization but with lower computational complexity. Mean shifts toward zero speed up learning by bringing the normal gradient closer to the unit natural gradient because of a reduced bias shift effect. While LReLUs and PReLUs have negative values, too, they do not ensure a noise-robust deactivation state. ELUs saturate to a negative value with smaller inputs and thereby decrease the forward propagated variation and information. Therefore ELUs code the degree of presence of particular phenomena in the input, while they do not quantitatively model the degree of their absence. In experiments, ELUs lead not only to faster learning, but also to significantly better generalization performance than ReLUs and LReLUs on networks with more than 5 layers. On CIFAR-100 ELUs networks significantly outperform ReLU networks with batch normalization while batch normalization does not improve ELU networks. ELU networks are among the top 10 reported CIFAR-10 results and yield the best published result on CIFAR-100, without resorting to multi-view evaluation or model averaging. On ImageNet, ELU networks considerably speed up learning compared to a ReLU network with the same architecture, obtaining less than 10% classification error for a single crop, single model network.",
    "authors": [
        {
            "affiliations": [],
            "name": "Djork-Arné Clevert"
        },
        {
            "affiliations": [],
            "name": "Thomas Unterthiner"
        }
    ],
    "id": "SP:0b8759d61e93b809df16d9fe9010d2a2d7241c74",
    "references": [
        {
            "authors": [
                "Amari",
                "S.-I"
            ],
            "title": "Natural gradient works efficiently in learning",
            "venue": "Neural Computation,",
            "year": 1998
        },
        {
            "authors": [
                "X. Glorot",
                "A. Bordes",
                "Y. Bengio"
            ],
            "title": "Deep sparse rectifier neural networks",
            "venue": "JMLR W&CP: Proceedings of the Fourteenth International Conference on Artificial Intelligence and Statistics (AISTATS 2011),",
            "year": 2011
        },
        {
            "authors": [
                "Graham",
                "Benjamin"
            ],
            "title": "Fractional max-pooling",
            "venue": "CoRR, abs/1412.6071,",
            "year": 2014
        },
        {
            "authors": [
                "R. Grosse",
                "R. Salakhudinov"
            ],
            "title": "Scaling up natural gradient by sparsely factorizing the inverse Fisher matrix",
            "venue": "Journal of Machine Learning Research,",
            "year": 2015
        },
        {
            "authors": [
                "K. He",
                "X. Zhang",
                "S. Ren",
                "J. Sun"
            ],
            "title": "Delving deep into rectifiers: Surpassing human-level performance on imagenet classification",
            "venue": "In IEEE International Conference on Computer Vision (ICCV),",
            "year": 2015
        },
        {
            "authors": [
                "S. Hochreiter"
            ],
            "title": "The vanishing gradient problem during learning recurrent neural nets and problem solutions",
            "venue": "International Journal of Uncertainty, Fuzziness and Knowledge-Based Systems,",
            "year": 1998
        },
        {
            "authors": [
                "S. Hochreiter",
                "J. Schmidhuber"
            ],
            "title": "Feature extraction through LOCOCODE",
            "venue": "Neural Computation,",
            "year": 1999
        },
        {
            "authors": [
                "S. Hochreiter",
                "Y. Bengio",
                "P. Frasconi",
                "J. Schmidhuber"
            ],
            "title": "Gradient flow in recurrent nets: the difficulty of learning long-term dependencies. In Kremer and Kolen (eds.), A Field Guide to Dynamical Recurrent Neural Networks",
            "year": 2001
        },
        {
            "authors": [
                "S. Ioffe",
                "C. Szegedy"
            ],
            "title": "Batch normalization: Accelerating deep network training by reducing internal covariate shift",
            "venue": "Journal of Machine Learning Research,",
            "year": 2015
        },
        {
            "authors": [
                "Jia",
                "Yangqing"
            ],
            "title": "Learning Semantic Image Representations at a Large Scale",
            "venue": "PhD thesis, EECS Department,",
            "year": 2014
        },
        {
            "authors": [
                "A. Krizhevsky",
                "I. Sutskever",
                "G.E. Hinton"
            ],
            "title": "ImageNet classification with deep convolutional neural networks",
            "venue": "Advances in Neural Information Processing Systems",
            "year": 2012
        },
        {
            "authors": [
                "T. Kurita"
            ],
            "title": "Iterative weighted least squares algorithms for neural networks classifiers",
            "venue": "In Proceedings of the Third Workshop on Algorithmic Learning Theory (ALT92),",
            "year": 1993
        },
        {
            "authors": [
                "Y. LeCun",
                "I. Kanter",
                "S.A. Solla"
            ],
            "title": "Eigenvalues of covariance matrices: Application to neural-network learning",
            "venue": "Physical Review Letters,",
            "year": 1991
        },
        {
            "authors": [
                "Y. LeCun",
                "L. Bottou",
                "G.B. Orr",
                "Müller",
                "K.-R"
            ],
            "title": "Efficient backprop",
            "venue": "Neural Networks: Tricks of the Trade,",
            "year": 1998
        },
        {
            "authors": [
                "A.L. Maas",
                "A.Y. Hannun",
                "A.Y. Ng"
            ],
            "title": "Rectifier nonlinearities improve neural network acoustic models",
            "venue": "In Proceedings of the 30th International Conference on Machine Learning",
            "year": 2013
        },
        {
            "authors": [
                "J. Martens"
            ],
            "title": "Deep learning via Hessian-free optimization",
            "venue": "Proceedings of the 27th International Conference on Machine Learning",
            "year": 2010
        },
        {
            "authors": [
                "A. Mayr",
                "G. Klambauer",
                "T. Unterthiner",
                "S. Hochreiter"
            ],
            "title": "DeepTox: Toxicity prediction using deep learning",
            "venue": "Front. Environ. Sci.,",
            "year": 2015
        },
        {
            "authors": [
                "V. Nair",
                "G.E. Hinton"
            ],
            "title": "Rectified linear units improve restricted Boltzmann machines",
            "venue": "Proceedings of the 27th International Conference on Machine Learning",
            "year": 2010
        },
        {
            "authors": [
                "Y. Olivier"
            ],
            "title": "Riemannian metrics for neural networks",
            "venue": "i: feedforward networks. CoRR,",
            "year": 2013
        },
        {
            "authors": [
                "R. Pascanu",
                "Y. Bengio"
            ],
            "title": "Revisiting natural gradient for deep networks",
            "venue": "In International Conference on Learning Representations",
            "year": 2014
        },
        {
            "authors": [
                "T. Raiko",
                "H. Valpola",
                "Y. LeCun"
            ],
            "title": "Deep learning made easier by linear transformations in perceptrons",
            "venue": "Proceedings of the 15th International Conference on Artificial Intelligence and Statistics (AISTATS12),",
            "year": 2012
        },
        {
            "authors": [
                "N.N. Schraudolph"
            ],
            "title": "Centering neural network gradient factor",
            "venue": "Neural Networks: Tricks of the Trade,",
            "year": 1998
        },
        {
            "authors": [
                "Schraudolph",
                "Nicol N"
            ],
            "title": "A Fast, Compact Approximation of the Exponential Function",
            "venue": "Neural Computation,",
            "year": 1999
        },
        {
            "authors": [
                "Springenberg",
                "Jost Tobias",
                "Dosovitskiy",
                "Alexey",
                "Brox",
                "Thomas",
                "Riedmiller",
                "Martin A"
            ],
            "title": "Striving for simplicity: The all convolutional net",
            "venue": "CoRR, abs/1412.6806,",
            "year": 2014
        },
        {
            "authors": [
                "T. Unterthiner",
                "A. Mayr",
                "G. Klambauer",
                "S. Hochreiter"
            ],
            "title": "Toxicity prediction using deep learning",
            "venue": "CoRR, abs/1503.01445,",
            "year": 2015
        },
        {
            "authors": [
                "O. Vinyals",
                "D. Povey"
            ],
            "title": "Krylov subspace descent for deep learning",
            "venue": "In AISTATS,",
            "year": 2012
        },
        {
            "authors": [
                "B. Xu",
                "N. Wang",
                "T. Chen",
                "M. Li"
            ],
            "title": "Empirical evaluation of rectified activations in convolutional network",
            "venue": "CoRR, abs/1505.00853,",
            "year": 2015
        },
        {
            "authors": [
                "H.H. Yang",
                "Amari",
                "S.-I"
            ],
            "title": "Complexity issues in natural gradient descent method for training multilayer perceptrons",
            "venue": "Neural Computation,",
            "year": 1998
        }
    ],
    "sections": [
        {
            "heading": "1 INTRODUCTION",
            "text": "Currently the most popular activation function for neural networks is the rectified linear unit (ReLU), which was first proposed for restricted Boltzmann machines (Nair & Hinton, 2010) and then successfully used for neural networks (Glorot et al., 2011). The ReLU activation function is the identity for positive arguments and zero otherwise. Besides producing sparse codes, the main advantage of ReLUs is that they alleviate the vanishing gradient problem (Hochreiter, 1998; Hochreiter et al., 2001) since the derivative of 1 for positive values is not contractive (Glorot et al., 2011). However ReLUs are non-negative and, therefore, have a mean activation larger than zero.\nUnits that have a non-zero mean activation act as bias for the next layer. If such units do not cancel each other out, learning causes a bias shift for units in next layer. The more the units are correlated, the higher their bias shift. We will see that Fisher optimal learning, i.e., the natural gradient (Amari, 1998), would correct for the bias shift by adjusting the weight updates. Thus, less bias shift brings the standard gradient closer to the natural gradient and speeds up learning. We aim at activation functions that push activation means closer to zero to decrease the bias shift effect.\nCentering the activations at zero has been proposed in order to keep the off-diagonal entries of the Fisher information matrix small (Raiko et al., 2012). For neural network it is known that centering\nar X\niv :1\n51 1.\n07 28\n9v 5\n[ cs\n.L G\n] 2\n2 Fe\nb 20\n16\nthe activations speeds up learning (LeCun et al., 1991; 1998; Schraudolph, 1998). “Batch normalization” also centers activations with the goal to counter the internal covariate shift (Ioffe & Szegedy, 2015). Also the Projected Natural Gradient Descent algorithm (PRONG) centers the activations by implicitly whitening them (Desjardins et al., 2015).\nAn alternative to centering is to push the mean activation toward zero by an appropriate activation function. Therefore tanh has been preferred over logistic functions (LeCun et al., 1991; 1998). Recently “Leaky ReLUs” (LReLUs) that replace the negative part of the ReLU with a linear function have been shown to be superior to ReLUs (Maas et al., 2013). Parametric Rectified Linear Units (PReLUs) generalize LReLUs by learning the slope of the negative part which yielded improved learning behavior on large image benchmark data sets (He et al., 2015). Another variant are Randomized Leaky Rectified Linear Units (RReLUs) which randomly sample the slope of the negative part which raised the performance on image benchmark datasets and convolutional networks (Xu et al., 2015).\nIn contrast to ReLUs, activation functions like LReLUs, PReLUs, and RReLUs do not ensure a noise-robust deactivation state. We propose an activation function that has negative values to allow for mean activations close to zero, but which saturates to a negative value with smaller arguments. The saturation decreases the variation of the units if deactivated, so the precise deactivation argument is less relevant. Such an activation function can code the degree of presence of particular phenomena in the input, but does not quantitatively model the degree of their absence. Therefore, such an activation function is more robust to noise. Consequently, dependencies between coding units are much easier to model and much easier to interpret since only activated code units carry much information. Furthermore, distinct concepts are much less likely to interfere with such activation functions since the deactivation state is non-informative, i.e. variance decreasing."
        },
        {
            "heading": "2 BIAS SHIFT CORRECTION SPEEDS UP LEARNING",
            "text": "To derive and analyze the bias shift effect mentioned in the introduction, we utilize the natural gradient. The natural gradient corrects the gradient direction with the inverse Fisher information matrix and, thereby, enables Fisher optimal learning, which ensures the steepest descent in the Riemannian parameter manifold and Fisher efficiency for online learning (Amari, 1998). The recently introduced Hessian-Free Optimization technique (Martens, 2010) and the Krylov Subspace Descent methods (Vinyals & Povey, 2012) use an extended Gauss-Newton approximation of the Hessian, therefore they can be interpreted as versions of natural gradient descent (Pascanu & Bengio, 2014).\nSince for neural networks the Fisher information matrix is typically too expensive to compute, different approximations of the natural gradient have been proposed. Topmoumoute Online natural Gradient Algorithm (TONGA) (LeRoux et al., 2008) uses a low-rank approximation of natural gradient descent. FActorized Natural Gradient (FANG) (Grosse & Salakhudinov, 2015) estimates the natural gradient via an approximation of the Fisher information matrix by a Gaussian graphical model. The Fisher information matrix can be approximated by a block-diagonal matrix, where unit or quasi-diagonal natural gradients are used (Olivier, 2013). Unit natural gradients or “Unitwise Fisher’s scoring” (Kurita, 1993) are based on natural gradients for perceptrons (Amari, 1998; Yang & Amari, 1998). We will base our analysis on the unit natural gradient.\nWe assume a parameterized probabilistic model p(x;w) with parameter vector w and data x. The training data are X = (x1, . . . ,xN ) ∈ R(d+1)×N with xn = (zTn , yn)T ∈ Rd+1, where zn is the input for example n and yn is its label. L(p(.;w),x) is the loss of example x = (zT , y)T using model p(.;w). The average loss on the training data X is the empirical risk Remp(p(.;w),X). Gradient descent updates the weight vector w by wnew = wold−η∇wRemp where η is the learning rate. The natural gradient is the inverse Fisher information matrix F̃−1 multiplied by the gradient of the empirical risk: ∇natw Remp = F̃−1∇wRemp. For a multi-layer perceptron a is the unit activation vector and a0 = 1 is the bias unit activation. We consider the ingoing weights to unit i, therefore we drop the index i: wj = wij for the weight from unit j to unit i, a = ai for the activation, and w0 for the bias weight of unit i. The activation function f maps the net input net = ∑ j wjaj of unit i to its activation a = f(net). For computing the Fisher information matrix, the derivative of the log-output probability ∂∂wj ln p(z;w) is required. Therefore we define the δ at unit i as δ = ∂ ∂net ln p(z;w),\nwhich can be computed via backpropagation, but using the log-output probability instead of the conventional loss function. The derivative is ∂∂wj ln p(z;w) = δaj .\nWe restrict the Fisher information matrix to weights leading to unit i which is the unit Fisher information matrix F . F captures only the interactions of weights to unit i. Consequently, the unit natural gradient only corrects the interactions of weights to unit i, i.e. considers the Riemannian parameter manifold only in a subspace. The unit Fisher information matrix is\n[F (w)]kj = Ep(z;w)\n( ∂ ln p(z;w)\n∂wk\n∂ ln p(z;w)\n∂wj\n) = Ep(z;w)(δ 2 ak aj) . (1)\nWeighting the activations by δ2 is equivalent to adjusting the probability of drawing inputs z. Inputs z with large δ2 are drawn with higher probability. Since 0 ≤ δ2 = δ2(z), we can define a distribution q(z):\nq(z) = δ2(z) p(z) (∫ δ2(z) p(z) dz )−1 = δ2(z) p(z) E−1p(z)(δ 2) . (2)\nUsing q(z), the entries of F can be expressed as second moments:\n[F (w)]kj = Ep(z)(δ 2 ak aj) = ∫ δ2 ak aj p(z) dz = Ep(z)(δ 2) Eq(z)(ak aj) . (3)\nIf the bias unit is a0 = 1 with weight w0 then the weight vector can be divided into a bias part w0 and the rest w: (wT , w0)T . For the row b = [F (w)]0 that corresponds to the bias weight, we have:\nb = Ep(z)(δ 2a) = Ep(z)(δ 2) Eq(z)(a) = Covp(z)(δ 2,a) + Ep(z)(a) Ep(z)(δ 2) . (4)\nThe next Theorem 1 gives the correction of the standard gradient by the unit natural gradient where the bias weight is treated separately (see also Yang & Amari (1998)). Theorem 1. The unit natural gradient corrects the weight update (∆wT ,∆w0)T to a unit i by following affine transformation of the gradient∇(wT ,w0)TRemp = (gT , g0)T :(\n∆w ∆w0\n) = ( A−1 (g − ∆w0 b) s ( g0 − bT A−1g )) , (5) where A = [F (w)]¬0,¬0 = Ep(z)(δ 2)Eq(z)(aa T ) is the unit Fisher information matrix without row 0 and column 0 corresponding to the bias weight. The vector b = [F (w)]0 is the zeroth column of F corresponding to the bias weight, and the positive scalar s is\ns = E−1p(z)(δ 2) ( 1 + ETq(z)(a) Var −1 q(z)(a) Eq(z)(a) ) , (6)\nwhere a is the vector of activations of units with weights to unit i and q(z) = δ2(z)p(z)E−1p(z)(δ 2).\nProof. Multiplying the inverse Fisher matrix F−1 with the separated gradient ∇(wT ,w0)TRemp((wT , w0)T ,X) = (gT , g0)T gives the weight update (∆wT ,∆w0)T :(\n∆w ∆w0\n) = ( A b bT c )−1 ( g g0 ) = ( A−1 g + u s−1uTg + go u uTg + s g0 ) . (7)\nwhere\nb = [F (w)]0 , c = [F (w)]00 , u = − sA −1 b , s =\n( c − bTA−1b )−1 . (8)\nThe previous formula is derived in Lemma 1 in the appendix. Using ∆w0 in the update gives( ∆w ∆w0 ) = ( A−1 g + s−1u ∆w0 uTg + s g0 ) , ( ∆w ∆w0 ) = ( A−1 (g − ∆w0 b) s ( g0 − bT A−1g )) . (9) The right hand side is obtained by inserting u = −sA−1b in the left hand side update. Since c = F00 = Ep(z)(δ 2), b = Ep(z)(δ2)Eq(z)(a), and A = Ep(z)(δ2)Eq(z)(aaT ), we obtain\ns = ( c − bTA−1b )−1 = E−1p(z)(δ 2) ( 1 − ETq(z)(a) E −1 q(z)(aa T ) Eq(z)(a) )−1 . (10)\nApplying Lemma 2 in the appendix gives the formula for s.\nThe bias shift (mean shift) of unit i is the change of unit i’s mean value due to the weight update. Bias shifts of unit i lead to oscillations and impede learning. See Section 4.4 in LeCun et al. (1998) for demonstrating this effect at the inputs and in LeCun et al. (1991) for explaining this effect using the input covariance matrix. Such bias shifts are mitigated or even prevented by the unit natural gradient. The bias shift correction of the unit natural gradient is the effect on the bias shift due to b which captures the interaction between the bias unit and the incoming units. Without bias shift correction, i.e., b = 0 and s = c−1, the weight updates are ∆w = A−1g and ∆w0 = c−1g0. As only the activations depend on the input, the bias shift can be computed by multiplying the weight update by the mean of the activation vector a. Thus we obtain the bias shift (Ep(z)(a)T , 1)(∆wT ,∆w0)T = ETp(z)(a)A\n−1g + c−1g0. The bias shift strongly depends on the correlation of the incoming units which is captured by A−1.\nNext, Theorem 2 states that the bias shift correction by the unit natural gradient can be considered to correct the incoming mean Ep(z)(a) proportional to Eq(z)(a) toward zero. Theorem 2. The bias shift correction by the unit natural gradient is equivalent to an additive correction of the incoming mean by −k Eq(z)(a) and a multiplicative correction of the bias unit by k, where\nk = 1 + ( Eq(z)(a) − Ep(z)(a) )T Var−1q(z)(a) Eq(z)(a) . (11)\nProof. Using ∆w0 = −sbTA−1g + sg0, the bias shift is:( Ep(z)(a)\n1\n)T ( ∆w ∆w0 ) = ( Ep(z)(a) 1 )T ( A−1 g − A−1b ∆w0 ∆w0 ) (12)\n= ETp(z)(a) A −1 g + ( 1 − ETp(z)(a) A −1b ) ∆w0\n= ( ETp(z)(a) − ( 1 − ETp(z)(a) A −1b ) s bT︸ ︷︷ ︸ ) A−1 g + s ( 1 − ETp(z)(a) A −1b ) g0 .\nThe mean correction term, indicated by an underbrace in previous formula, is s (\n1 − ETp(z)(a) A −1b ) b = E−1p(z)(δ 2) ( 1 − ETq(z)(a) E −1 q(z)(aa T ) Eq(z)(a) )−1\n(13)( 1 − ETp(z)(a) E −1 q(z)(aa T ) Eq(z)(a) ) Ep(z)(δ 2) Eq(z)(a)\n= (\n1− ETq(z)(a) E −1 q(z)(aa T ) Eq(z)(a) )−1 ( 1− ETp(z)(a) E −1 q(z)(aa T ) Eq(z)(a) )\n︸ ︷︷ ︸ k Eq(z)(a).\nThe expression Eq. (11) for k follows from Lemma 2 in the appendix. The bias unit correction term is s (\n1− ETp(z)(a)A −1b ) g0 = kc −1g0.\nIn Theorem 2 we can reformulate k = 1 + E−1p(z)(δ 2)CovTp(z)(δ 2,a)Var−1q(z)(a)Eq(z)(a). Therefore k increases with the length of Eq(z)(a) for given variances and covariances. Consequently the bias shift correction through the unit natural gradient is governed by the length of Eq(z)(a). The bias shift correction is zero for Eq(z)(a) = 0 since k = 1 does not correct the bias unit multiplicatively. Using Eq. (4), Eq(z)(a) is split into an offset and an information containing term:\nEq(z)(a) = Ep(z)(a) + E −1 p(z)(δ 2) Covp(z)(δ 2,a) . (14)\nIn general, smaller positive Ep(z)(a) lead to smaller positive Eq(z)(a), therefore to smaller corrections. The reason is that in general the largest absolute components of Covp(z)(δ2,a) are positive, since activated inputs will activate the unit i which in turn will have large impact on the output.\nTo summarize, the unit natural gradient corrects the bias shift of unit i via the interactions of incoming units with the bias unit to ensure efficient learning. This correction is equivalent to shifting the mean activations of the incoming units toward zero and scaling up the bias unit. To reduce the\nundesired bias shift effect without the natural gradient, either the (i) activation of incoming units can be centered at zero or (ii) activation functions with negative values can be used. We introduce a new activation function with negative values while keeping the identity for positive arguments where it is not contradicting."
        },
        {
            "heading": "3 EXPONENTIAL LINEAR UNITS (ELUS)",
            "text": "The exponential linear unit (ELU) with 0 < α is\nf(x) = { x if x > 0 α (exp(x)− 1) if x ≤ 0 , f ′(x) = { 1 if x > 0 f(x) + α if x ≤ 0 . (15)\nThe ELU hyperparameter α controls the value to which an ELU saturates for negative net inputs (see Fig. 1). ELUs diminish the vanishing gradient effect as rectified linear units (ReLUs) and leaky ReLUs (LReLUs) do. The vanishing gradient problem is alleviated because the positive part of these functions is the identity, therefore their derivative is one and not contractive. In contrast, tanh and sigmoid activation functions are contractive almost everywhere.\nIn contrast to ReLUs, ELUs have negative values which pushes the mean of the activations closer to zero. Mean activations that are closer to zero enable faster learning as they bring the gradient closer to the natural gradient (see Theorem 2 and text thereafter). ELUs saturate to a negative value when the argument gets smaller. Saturation means a small derivative which decreases the variation and the information that is propagated to the next layer. Therefore the representation is both noise-robust and low-complex (Hochreiter & Schmidhuber, 1999). ELUs code the degree of presence of input concepts, while they neither quantify the degree of their absence nor distinguish the causes of their absence. This property of non-informative deactivation states is also present at\nReLUs and allowed to detect biclusters corresponding to biological modules in gene expression datasets (Clevert et al., 2015) and to identify toxicophores in toxicity prediction (Unterthiner et al., 2015; Mayr et al., 2015). The enabling features for these interpretations is that activation can be clearly distinguished from deactivation and that only active units carry relevant information and can crosstalk."
        },
        {
            "heading": "4 EXPERIMENTS USING ELUS",
            "text": "In this section, we assess the performance of exponential linear units (ELUs) if used for unsupervised and supervised learning of deep autoencoders and deep convolutional networks. ELUs with α = 1.0 are compared to (i) Rectified Linear Units (ReLUs) with activation f(x) = max(0, x), (ii) Leaky ReLUs (LReLUs) with activation f(x) = max(αx, x) (0 < α < 1), and (iii) Shifted ReLUs (SReLUs) with activation f(x) = max(−1, x). Comparisons are done with and without batch normalization. The following benchmark datasets are used: (i) MNIST (gray images in 10 classes, 60k train and 10k test), (ii) CIFAR-10 (color images in 10 classes, 50k train and 10k test), (iii) CIFAR-100 (color images in 100 classes, 50k train and 10k test), and (iv) ImageNet (color images in 1,000 classes, 1.3M train and 100k tests)."
        },
        {
            "heading": "4.1 MNIST",
            "text": ""
        },
        {
            "heading": "4.1.1 LEARNING BEHAVIOR",
            "text": "We first want to verify that ELUs keep the mean activations closer to zero than other units. Fully connected deep neural networks with ELUs (α = 1.0), ReLUs, and LReLUs (α = 0.1) were trained on the MNIST digit classification dataset while each hidden unit’s activation was tracked. Each\nnetwork had eight hidden layers of 128 units each, and was trained for 300 epochs by stochastic gradient descent with learning rate 0.01 and mini-batches of size 64. The weights have been initialized according to (He et al., 2015). After each epoch we calculated the units’ average activations on a fixed subset of the training data. Fig. 2 shows the median over all units along learning. ELUs stay have smaller median throughout the training process. The training error of ELU networks decreases much more rapidly than for the other networks.\nSection C in the appendix compares the variance of median activation in ReLU and ELU networks. The median varies much more in ReLU networks. This indicates that ReLU networks continuously try to correct the bias shift introduced by previous weight updates while this effect is much less prominent in ELU networks."
        },
        {
            "heading": "4.1.2 AUTOENCODER LEARNING",
            "text": "To evaluate ELU networks at unsupervised settings, we followed Martens (2010) and Desjardins et al. (2015) and trained a deep autoencoder on the MNIST dataset. The encoder part consisted of four fully connected hidden layers with sizes 1000, 500, 250 and 30, respectively. The decoder part was symmetrical to the encoder. For learning we applied stochastic gradient descent with minibatches of 64 samples for 500 epochs using the fixed learning rates (10−2, 10−3, 10−4, 10−5). Fig. 3 shows, that ELUs outperform the competing activation functions in terms of training / test set reconstruction error for all learning rates. As already noted by Desjardins et al. (2015), higher learning rates seem to perform better."
        },
        {
            "heading": "4.2 COMPARISON OF ACTIVATION FUNCTIONS",
            "text": "In this subsection we show that ELUs indeed possess a superior learning behavior compared to other activation functions as postulated in Section 3. Furthermore we show that ELU networks perform better than ReLU networks with batch normalization. We use as benchmark dataset CIFAR-100 and use a relatively simple convolutional neural network (CNN) architecture to keep the computational complexity reasonable for comparisons.\nThe CNN for these CIFAR-100 experiments consists of 11 convolutional layers arranged in stacks of ([1× 192× 5], [1× 192× 1, 1× 240× 3], [1× 240× 1, 1× 260× 2], [1× 260× 1, 1× 280× 2], [1 × 280 × 1, 1 × 300 × 2], [1 × 300 × 1], [1 × 100 × 1]) layers × units × receptive fields. 2×2 max-pooling with a stride of 2 was applied after each stack. For network regularization we used the following drop-out rate for the last layer of each stack (0.0, 0.1, 0.2, 0.3, 0.4, 0.5, 0.0). The L2-weight decay regularization term was set to 0.0005. The following learning rate schedule was applied (0 − 35k[0.01], 35k − 85k[0.005], 85k − 135k[0.0005], 135k − 165k[0.00005]) (iterations [learning rate]). For fair comparisons, we used this learning rate schedule for all networks. During previous experiments, this schedule was optimized for ReLU networks, however as ELUs converge faster they would benefit from an adjusted schedule. The momentum term learning rate was fixed to 0.9. The dataset was preprocessed as described in Goodfellow et al. (2013) with global contrast\nnormalization and ZCA whitening. Additionally, the images were padded with four zero pixels at all borders. The model was trained on 32 × 32 random crops with random horizontal flipping. Besides that, we no further augmented the dataset during training. Each network was run 10 times with different weight initialization. Across networks with different activation functions the same run number had the same initial weights.\nMean test error results of networks with different activation functions are compared in Fig. 4, which also shows the standard deviation. ELUs yield on average a test error of 28.75(±0.24)%, while SReLUs, ReLUs and LReLUs yield 29.35(±0.29)%, 31.56(±0.37)% and 30.59(±0.29)%, respectively. ELUs achieve both lower training loss and lower test error than ReLUs, LReLUs, and SReLUs. Both the ELU training and test performance is significantly better than for other activation functions (Wilcoxon signed-rank test with p-value<0.001). Batch normalization improved ReLU and LReLU networks, but did not improve ELU and SReLU networks (see Fig. 5). ELU networks significantly outperform ReLU networks with batch normalization (Wilcoxon signed-rank test with p-value<0.001)."
        },
        {
            "heading": "4.3 CLASSIFICATION PERFORMANCE ON CIFAR-100 AND CIFAR-10",
            "text": "The following experiments should highlight the generalization capabilities of ELU networks. The CNN architecture is more sophisticated than in the previous subsection and consists of 18 convolutional layers arranged in stacks of ([1× 384× 3], [1× 384× 1, 1× 384× 2, 2× 640× 2], [1× 640× 1, 3× 768× 2], [1× 768× 1, 2× 896× 2], [1× 896× 3, 2× 1024× 2], [1× 1024× 1, 1× 1152× 2], [1 × 1152 × 1], [1 × 100 × 1]). Initial drop-out rate, Max-pooling after each stack, L2-weight decay, momentum term, data preprocessing, padding, and cropping were as in previous section. The initial learning rate was set to 0.01 and decreased by a factor of 10 after 35k iterations. The minibatch size was 100. For the final 50k iterations fine-tuning we increased the drop-out rate for all\nlayers in a stack to (0.0, 0.1, 0.2, 0.3, 0.4, 0.5, 0.0), thereafter increased the drop-out rate by a factor of 1.5 for 40k additional iterations.\nELU networks are compared to following recent successful CNN architectures: AlexNet (Krizhevsky et al., 2012), DSN (Lee et al., 2015), NiN (Lin et al., 2013), Maxout (Goodfellow et al., 2013), All-CNN (Springenberg et al., 2014), Highway Network (Srivastava et al., 2015) and Fractional Max-Pooling (Graham, 2014). The test error in percent misclassification are given in Tab. 1. ELU-networks are the second best on CIFAR-10 with a test error of 6.55% but still they are among the top 10 best results reported for CIFAR-10. ELU networks performed best on CIFAR-100 with a test error of 24.28%. This is the best published result on CIFAR-100, without even resorting to multi-view evaluation or model averaging."
        },
        {
            "heading": "4.4 IMAGENET CHALLENGE DATASET",
            "text": "Finally, we evaluated ELU-networks on the 1000-class ImageNet dataset. It contains about 1.3M training color images as well as additional 50k images and 100k images for validation and testing, respectively. For this task, we designed a 15 layer CNN, which was arranged in stacks of (1× 96× 6, 3 × 512 × 3, 5 × 768 × 3, 3 × 1024 × 3, 2 × 4096 × FC, 1 × 1000 × FC) layers × units × receptive fields or fully-connected (FC). 2×2 max-pooling with a stride of 2 was applied after each stack and spatial pyramid pooling (SPP) with 3 levels before the first FC layer (He et al., 2015). For network regularization we set the L2-weight decay term to 0.0005 and used 50% drop-out in the two penultimate FC layers. Images were re-sized to 256×256 pixels and per-pixel mean subtracted. Trained was on 224 × 224 random crops with random horizontal flipping. Besides that, we did not augment the dataset during training.\nFig. 6 shows the learning behavior of ELU vs. ReLU networks. Panel (b) shows that ELUs start reducing the error earlier. The ELU-network already reaches the 20% top-5 error after 160k iterations, while the ReLU network needs 200k iterations to reach the same error rate. The single-model performance was evaluated on the single center crop with no further augmentation and yielded a top-5 validation error below 10%.\nCurrently ELU nets are 5% slower on ImageNet than ReLU nets. The difference is small because activation functions generally have only minor influence on the overall training time (Jia, 2014). In terms of wall clock time, ELUs require 12.15h vs. ReLUs with 11.48h for 10k iterations. We expect that ELU implementations can be improved, e.g. by faster exponential functions (Schraudolph, 1999)."
        },
        {
            "heading": "5 CONCLUSION",
            "text": "We have introduced the exponential linear units (ELUs) for faster and more precise learning in deep neural networks. ELUs have negative values, which allows the network to push the mean activations\ncloser to zero. Therefore ELUs decrease the gap between the normal gradient and the unit natural gradient and, thereby speed up learning. We believe that this property is also the reason for the success of activation functions like LReLUs and PReLUs and of batch normalization. In contrast to LReLUs and PReLUs, ELUs have a clear saturation plateau in its negative regime, allowing them to learn a more robust and stable representation. Experimental results show that ELUs significantly outperform other activation functions on different vision datasets. Further ELU networks perform significantly better than ReLU networks trained with batch normalization. ELU networks achieved one of the top 10 best reported results on CIFAR-10 and set a new state of the art in CIFAR-100 without the need for multi-view test evaluation or model averaging. Furthermore, ELU networks produced competitive results on the ImageNet in much fewer epochs than a corresponding ReLU network. Given their outstanding performance, we expect ELU networks to become a real time saver in convolutional networks, which are notably time-intensive to train from scratch otherwise.\nAcknowledgment. We thank the NVIDIA Corporation for supporting this research with several Titan X GPUs and Roland Vollgraf and Martin Heusel for helpful discussions and comments on this work."
        },
        {
            "heading": "B QUADRATIC FORM OF MEAN AND INVERSE SECOND MOMENT",
            "text": "Lemma 2. For a random variable a holds\nET (a) E−1(a aT ) E(a) ≤ 1 (36)\nand ( 1 − ET (a) E−1(a aT ) E(a) )−1 = 1 + ET (a) Var−1(a) E(a) . (37)\nFurthermore holds( 1 − ET (a) E−1(a aT ) E(a) )−1 ( 1 − ETp (a) E−1(a aT ) E(a) ) (38)\n= 1 + (E(a) − Ep(a))T Var−1(a) E(a) .\nProof. The Sherman-Morrison Theorem states( A + b cT )−1 = A−1 − A −1 b cT A−1\n1 + cTA−1b . (39)\nTherefore we have\ncT ( A + b bT )−1 b = cTA−1b − c TA−1 b bT A−1b\n1 + bTA−1b (40)\n= cTA−1b\n( 1 + bTA−1b ) − ( cTA−1 b ) ( bTA−1 b ) 1 + bTA−1b\n= cTA−1b\n1 + bTA−1b .\nUsing the identity\nE(a aT ) = Var(a) + E(a) ET (a) (41)\nfor the second moment and Eq. (40), we get\nET (a) E−1(a aT ) E(a) = ET (a) ( Var(a) + E(a) ET (a) )−1 E(a) (42)\n= ET (a) Var−1(a) E(a)\n1 + ET (a) Var−1(a) E(a) ≤ 1 .\nThe last inequality follows from the fact that Var(a) is positive definite. From last equation, we obtain further( 1 − ET (a)E−1(a aT ) E(a) )−1 = 1 + ET (a)Var−1(a) E(a) . (43)\nFor the mixed quadratic form we get from Eq. (40)\nETp (a) E −1(a aT ) E(a) = ETp (a) ( Var(a) + E(a) ET (a) )−1 E(a) (44)\n= ETp (a) Var −1(a) E(a)\n1 + ET (a) Var−1(a) E(a) .\nFrom this equation follows\n1 − ETp (a) E−1(a aT ) E(a) = 1 − ETp (a) Var −1(a) E(a)\n1 + ET (a) Var−1(a) E(a) (45)\n= 1 + ET (a) Var−1(a) E(a) − ETp (a) Var−1(a) E(a)\n1 + ET (a) Var−1(a) E(a) = 1 + (E(a) − Ep(a))T Var−1(a) E(a) 1 + ET (a) Var−1(a) E(a) .\nTherefore we get ( 1 − ET (a) E−1(a aT ) E(a) )−1 ( 1 − ETp (a) E−1(a aT ) E(a) ) (46)\n= 1 + (E(a) − Ep(a))T Var−1(a) E(a) .\nC VARIANCE OF MEAN ACTIVATIONS IN ELU AND RELU NETWORKS\nTo compare the variance of median activation in ReLU and ELU networks, we trained a neural network with 5 hidden layers of 256 hidden units for 200 epochs using a learning rate of 0.01, once using ReLU and once using ELU activation functions on the MNIST dataset. After each epoch, we calculated the median activation of each hidden unit on the whole training set. We then calculated the variance of these changes, which is depicted in Figure 7 . The median varies much more in ReLU networks. This indicates that ReLU networks continuously try to correct the bias shift introduced by previous weight updates while this effect is much less prominent in ELU networks."
        }
    ],
    "title": "EXPONENTIAL LINEAR UNITS (ELUS)",
    "year": 2016
}