{
    "abstractText": "A long-term goal of machine learning research is to build an intelligent dialog agent. Most research in natural language understanding has focused on learning from fixed training sets of labeled data, with supervision either at the word level (tagging, parsing tasks) or sentence level (question answering, machine translation). This kind of supervision is not realistic of how humans learn, where language is both learned by, and used for, communication. In this work, we study dialog-based language learning, where supervision is given naturally and implicitly in the response of the dialog partner during the conversation. We study this setup in two domains: the bAbI dataset of [30] and large-scale question answering from [4]. We evaluate a set of baseline learning strategies on these tasks, and show that a novel model incorporating predictive lookahead is a promising approach for learning from a teacher’s response. In particular, a surprising result is that it can learn to answer questions correctly without any reward-based supervision at all.",
    "authors": [
        {
            "affiliations": [],
            "name": "Jason Weston"
        }
    ],
    "id": "SP:3bbf2ee642ed311e500017def1f54df453a935c1",
    "references": [
        {
            "authors": [
                "M.A. Bassiri"
            ],
            "title": "Interactional feedback and the impact of attitude and motivation on noticing l2 form",
            "venue": "English Language and Literature Studies, 1(2):61",
            "year": 2011
        },
        {
            "authors": [
                "A. Bordes",
                "N. Usunier",
                "S. Chopra",
                "J. Weston"
            ],
            "title": "Large-scale simple question answering with memory networks",
            "venue": "arXiv preprint arXiv:1506.02075",
            "year": 2015
        },
        {
            "authors": [
                "J. Clarke",
                "D. Goldwasser",
                "M.-W. Chang",
                "D. Roth"
            ],
            "title": "Driving semantic parsing from the world’s response",
            "venue": "Proceedings of the fourteenth conference on computational natural language learning, pages 18–27. Association for Computational Linguistics",
            "year": 2010
        },
        {
            "authors": [
                "J. Dodge",
                "A. Gane",
                "X. Zhang",
                "A. Bordes",
                "S. Chopra",
                "A. Miller",
                "A. Szlam",
                "J. Weston"
            ],
            "title": "Evaluating prerequisite qualities for learning end-to-end dialog systems",
            "venue": "arXiv preprint arXiv:1511.06931",
            "year": 2015
        },
        {
            "authors": [
                "D. Goldwasser",
                "D. Roth"
            ],
            "title": "Learning from natural instructions",
            "venue": "Machine learning, 94(2):205–232",
            "year": 2014
        },
        {
            "authors": [
                "R. Higgins",
                "P. Hartley",
                "A. Skelton"
            ],
            "title": "The conscientious consumer: Reconsidering the role of assessment feedback in student learning",
            "venue": "Studies in higher education, 27(1):53–64",
            "year": 2002
        },
        {
            "authors": [
                "F. Hill",
                "A. Bordes",
                "S. Chopra",
                "J. Weston"
            ],
            "title": "The goldilocks principle: Reading children’s books with explicit memory representations",
            "venue": "arXiv preprint arXiv:1511.02301",
            "year": 2015
        },
        {
            "authors": [
                "B. Hixon",
                "P. Clark",
                "H. Hajishirzi"
            ],
            "title": "Learning knowledge graphs for question answering through conversational dialog",
            "venue": "Proceedings of the the 2015 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies, Denver, Colorado, USA",
            "year": 2015
        },
        {
            "authors": [
                "P.K. Kuhl"
            ],
            "title": "Early language acquisition: cracking the speech code",
            "venue": "Nature reviews neuroscience, 5(11): 831–843",
            "year": 2004
        },
        {
            "authors": [
                "G. Kuhlmann",
                "P. Stone",
                "R. Mooney",
                "J. Shavlik"
            ],
            "title": "Guiding a reinforcement learner with natural language advice: Initial results in robocup soccer",
            "venue": "The AAAI-2004 workshop on supervisory control of learning and adaptive systems",
            "year": 2004
        },
        {
            "authors": [
                "A.S. Latham"
            ],
            "title": "Learning through feedback",
            "venue": "Educational Leadership, 54(8):86–87",
            "year": 1997
        },
        {
            "authors": [
                "I. Lenz",
                "R. Knepper",
                "A. Saxena"
            ],
            "title": "Deepmpc: Learning deep latent features for model predictive control",
            "venue": "Robotics Science and Systems (RSS)",
            "year": 2015
        },
        {
            "authors": [
                "G.F. Marcus"
            ],
            "title": "Negative evidence in language acquisition",
            "venue": "Cognition, 46(1):53–85",
            "year": 1993
        },
        {
            "authors": [
                "T. Mikolov",
                "A. Joulin",
                "M. Baroni"
            ],
            "title": "A roadmap towards machine intelligence",
            "venue": "arXiv preprint arXiv:1511.08130",
            "year": 2015
        },
        {
            "authors": [
                "K. Narasimhan",
                "T. Kulkarni",
                "R. Barzilay"
            ],
            "title": "Language understanding for text-based games using deep reinforcement learning",
            "venue": "arXiv preprint arXiv:1506.08941",
            "year": 2015
        },
        {
            "authors": [
                "J. Oh",
                "X. Guo",
                "H. Lee",
                "R.L. Lewis",
                "S. Singh"
            ],
            "title": "Action-conditional video prediction using deep networks in atari games",
            "venue": "Advances in Neural Information Processing Systems, pages 2845–2853",
            "year": 2015
        },
        {
            "authors": [
                "A. Pappu",
                "A. Rudnicky"
            ],
            "title": "Predicting tasks in goal-oriented spoken dialog systems using semantic knowledge bases",
            "venue": "Proceedings of the SIGDIAL, pages 242–250",
            "year": 2013
        },
        {
            "authors": [
                "M. Ranzato",
                "S. Chopra",
                "M. Auli",
                "W. Zaremba"
            ],
            "title": "Sequence level training with recurrent neural networks",
            "venue": "arXiv preprint arXiv:1511.06732",
            "year": 2015
        },
        {
            "authors": [
                "V. Rieser",
                "O. Lemon"
            ],
            "title": "Reinforcement learning for adaptive dialogue systems: a data-driven methodology for dialogue management and natural language generation",
            "venue": "Springer Science & Business Media",
            "year": 2011
        },
        {
            "authors": [
                "J. Schatzmann",
                "K. Weilhammer",
                "M. Stuttle",
                "S. Young"
            ],
            "title": "A survey of statistical user simulation techniques for reinforcement-learning of dialogue management strategies",
            "venue": "The knowledge engineering review, 21(02):97–126",
            "year": 2006
        },
        {
            "authors": [
                "J. Schmidhuber",
                "R. Huber"
            ],
            "title": "Learning to generate artificial fovea trajectories for target detection",
            "venue": "International Journal of Neural Systems, 2(01n02):125–134",
            "year": 1991
        },
        {
            "authors": [
                "A. Sordoni",
                "M. Galley",
                "M. Auli",
                "C. Brockett",
                "Y. Ji",
                "M. Mitchell",
                "J.-Y. Nie",
                "J. Gao",
                "B. Dolan"
            ],
            "title": "A neural network approach to context-sensitive generation of conversational responses",
            "venue": "Proceedings of NAACL",
            "year": 2015
        },
        {
            "authors": [
                "B.C. Stadie",
                "S. Levine",
                "P. Abbeel"
            ],
            "title": "Incentivizing exploration in reinforcement learning with deep predictive models",
            "venue": "arXiv preprint arXiv:1507.00814",
            "year": 2015
        },
        {
            "authors": [
                "P.-H. Su",
                "D. Vandyke",
                "M. Gasic",
                "N. Mrksic",
                "T.-H. Wen",
                "S. Young"
            ],
            "title": "Reward shaping with recurrent neural networks for speeding up on-line policy learning in spoken dialogue systems",
            "venue": "arXiv preprint arXiv:1508.03391",
            "year": 2015
        },
        {
            "authors": [
                "S. Sukhbaatar",
                "A. Szlam",
                "G. Synnaeve",
                "S. Chintala",
                "R. Fergus"
            ],
            "title": "Mazebase: A sandbox for learning from games",
            "venue": "CoRR, abs/1511.07401",
            "year": 2015
        },
        {
            "authors": [
                "S. Sukhbaatar",
                "J. Weston",
                "R. Fergus"
            ],
            "title": "et al",
            "venue": "End-to-end memory networks. In Advances in Neural Information Processing Systems, pages 2431–2439",
            "year": 2015
        },
        {
            "authors": [
                "G. Wayne",
                "L. Abbott"
            ],
            "title": "Hierarchical control using networks trained with higher-level forward models",
            "venue": "Neural computation",
            "year": 2014
        },
        {
            "authors": [
                "M.G. Werts",
                "M. Wolery",
                "A. Holcombe",
                "D.L. Gast"
            ],
            "title": "Instructive feedback: Review of parameters and effects",
            "venue": "Journal of Behavioral Education, 5(1):55–75",
            "year": 1995
        },
        {
            "authors": [
                "J. Weston",
                "S. Chopra",
                "A. Bordes"
            ],
            "title": "Memory networks",
            "venue": "CoRR, abs/1410.3916",
            "year": 2014
        },
        {
            "authors": [
                "J. Weston",
                "A. Bordes",
                "S. Chopra",
                "T. Mikolov"
            ],
            "title": "Towards ai-complete question answering: a set of prerequisite toy tasks",
            "venue": "arXiv preprint arXiv:1502.05698",
            "year": 2015
        },
        {
            "authors": [
                "R.J. Williams"
            ],
            "title": "Simple statistical gradient-following algorithms for connectionist reinforcement learning",
            "venue": "Machine learning, 8(3-4):229–256",
            "year": 1992
        },
        {
            "authors": [
                "K. Xu",
                "J. Ba",
                "R. Kiros",
                "A. Courville",
                "R. Salakhutdinov",
                "R. Zemel",
                "Y. Bengio"
            ],
            "title": "Show",
            "venue": "attend and tell: Neural image caption generation with visual attention. arXiv preprint arXiv:1502.03044",
            "year": 2015
        }
    ],
    "sections": [
        {
            "heading": "1 Introduction",
            "text": "Many of machine learning’s successes have come from supervised learning, which typically involves employing annotators to label large quantities of data per task. However, humans can learn by acting and learning from the consequences of (i.e, the feedback from) their actions. When humans act in dialogs (i.e., make speech utterances) the feedback is from other human’s responses, which hence contain very rich information. This is perhaps most pronounced in a student/teacher scenario where the teacher provides positive feedback for successful communication and corrections for unsuccessful ones [11, 28]. However, in general any reply from a dialog partner, teacher or not, is likely to contain an informative training signal for learning how to use language in subsequent conversations.\nIn this paper we explore whether we can train machine learning models to learn from dialogs. The ultimate goal is to be able to develop an intelligent dialog agent that can learn while conducting conversations. To do that it needs to learn from feedback that is supplied as natural language. However, most machine learning tasks in the natural language processing literature are not of this form: they are either hand labeled at the word level (part of speech tagging, named entity recognition), segment (chunking) or sentence level (question answering) by labelers. Subsequently, learning algorithms have been developed to learn from that kind of supervision. We therefore need to develop evaluation datasets for the dialog-based language learning setting, as well as developing models and algorithms able to learn in such a regime.\nThe contribution of the present work is thus:\n• We introduce a set of tasks that model natural feedback from a teacher and hence assess the feasibility of dialog-based language learning.\n• We evaluate some baseline models on this data, comparing to standard supervised learning. • We introduce a novel forward prediction model, whereby the learner tries to predict the\nteacher’s replies to its actions, yielding promising results, even with no reward signal at all.\nar X\niv :1\n60 4.\n06 04\n5v 7\n[ cs\n.C L\n] 2\n4 O\nct 2\n01 6"
        },
        {
            "heading": "2 Related Work",
            "text": "In human language learning the usefulness of social interaction and natural infant directed conversations is emphasized, see e.g. the review paper [9], although the usefulness of feedback for learning grammar is disputed [13]. Support for the usefulness of feedback is found however in second language learning [1] and learning by students [6, 11, 28].\nIn machine learning, one line of research has focused on supervised learning from dialogs using neural models [22, 4]. Question answering given either a database of knowledge [2] or short stories [30] can be considered as a simple case of dialog which is easy to evaluate. Those tasks typically do not consider feedback. There is work on the the use of feedback and dialog for learning, notably for collecting knowledge to answer questions [8, 17], the use of natural language instruction for learning symbolic rules [10, 5] and the use of binary feedback (rewards) for learning parsers [3].\nAnother setting which uses feedback is the setting of reinforcement learning, see e.g. [19, 20] for a summary of its use in dialog. However, those approaches often consider reward as the feedback model rather than exploiting the dialog feedback per se. Nevertheless, reinforcement learning ideas have been used to good effect for other tasks as well, such as understanding text adventure games [15], image captioning [32], machine translation and summarization [18]. Recently, [14] also proposed a reward-based learning framework for learning how to learn.\nFinally, forward prediction models, which we make use of in this work, have been used for learning eye tracking [21], controlling robot arms [12] and vehicles [27], and action-conditional video prediction in atari games [16, 23]. We are not aware of their use thus far for dialog."
        },
        {
            "heading": "3 Dialog-Based Supervision Tasks",
            "text": "Dialog-based supervision comes in many forms. As far as we are aware it is a currently unsolved problem which type of learning strategy will work in which setting. In this section we therefore identify different modes of dialog-based supervision, and build a learning problem for each. The goal is to then evaluate learners on each type of supervision.\nWe thus begin by selecting two existing datasets: (i) the single supporting fact problem from the bAbI datasets [30] which consists of short stories from a simulated world followed by questions; and (ii) the MovieQA dataset [4] which is a large-scale dataset (∼ 100k questions over ∼ 75k entities) based on questions with answers in the open movie database (OMDb). For each dataset we then consider ten modes of dialog-based supervision. The supervision modes are summarized in Fig. 1 using a snippet of the bAbI dataset as an example. The same setups are also used for MovieQA, some examples of which are given in Fig 2.\nWe now describe each supervision setup in turn.\nImitating an Expert Student In Task 1 the dialogs take place between a teacher and an expert student who gives semantically coherent answers. Hence, the task is for the learner to imitate that expert student, and become an expert themselves. For example, imagine the real-world scenario where a child observes their two parents talking to each other, it can learn but it is not actually taking part in the conversation. Note that our main goal in this paper is to examine how a non-expert can learn to improve its dialog skills while conversing. The rest of our tasks will hence concentrate on that goal. This task can be seen as a natural baseline for the rest of our tasks given the same input dialogs and questions.\nPositive and Negative Feedback In Task 2, when the learner answers a question the teacher then replies with either positive or negative feedback. In our experiments the subsequent responses are variants of “No, that’s incorrect” or “Yes, that’s right”. In the datasets we build there are 6 templates for positive feedback and 6 templates for negative feedback, e.g. ”Sorry, that’s not it.”, ”Wrong”, etc. To separate the notion of positive from negative (otherwise the signal is just words with no notion that yes is better than no) we assume an additional external reward signal that is not part of the text. As shown in Fig. 1 Task 2, (+) denotes positive reward external to the dialog (e.g. feedback provided by another medium, such as a nod of the head from the teacher). This is provided with every positive response. Note the difference in supervision compared to Task 1: there every answer is right and provides positive supervision. Here, only the answers the learner got correct\nhave positive supervision. This could clearly be a problem when the learner is unskilled: it will supply incorrect answers and never (or hardly ever) receive positive responses.\nAnswers Supplied by Teacher In Task 3 the teacher gives positive and negative feedback as in Task 2, however when the learner’s answer is incorrect, the teacher also responds with the correction. For example if “where is Mary?” is answered with the incorrect answer “bedroom” the teacher responds “No, the answer is kitchen”’, see Fig. 1 Task 3. If the learner knows how to use this extra information, it effectively has as much supervision signal as with Task 1, and much more than for Task 2.\nHints Supplied by Teacher In Task 4, the corrections provided by the teacher do not provide the exact answer as in Task 3, but only a useful hint. This setting is meant to mimic the real life\noccurrence of being provided only partial information about what you did wrong. In our datasets we do this by providing the class of the correct answer, e.g. “No, they are downstairs” if the answer should be kitchen, or “No, it is a director” for the question “Who directed Monsters, Inc.?” (using OMDB metadata). The supervision signal here is hence somewhere in between Task 2 and 3.\nSupporting Facts Supplied by Teacher In Task 5, another way of providing partial supervision for an incorrect answer is explored. Here, the teacher gives a reason (explanation) why the answer is wrong by referring to a known fact that supports the true answer that the incorrect answer may contradict. For example “No, because John moved to the bathroom” for an incorrect answer to “Where is John?”, see Fig. 1 Task 5. This is related to what is termed strong supervision in [30] where supporting facts and answers are given for question answering tasks.\nPartial Feedback Task 6 considers the case where external rewards are only given some of (50% of) the time for correct answers, the setting is otherwise identical to Task 3. This attempts to mimic the realistic situation of some learning being more closely supervised (a teacher rewarding you for getting some answers right) whereas other dialogs have less supervision (no external rewards). The task attempts to assess the impact of such partial supervision.\nNo Feedback In Task 7 external rewards are not given at all, only text, but is otherwise identical to Tasks 3 and 6. This task explores whether it is actually possible to learn how to answer at all in such a setting. We find in our experiments the answer is surprisingly yes, at least in some conditions.\nImitation and Feedback Mixture Task 8 combines Tasks 1 and 2. The goal is to see if a learner can learn successfully from both forms of supervision at once. This mimics a child both observing pairs of experts talking (Task 1) while also trying to talk (Task 2).\nAsking For Corrections Another natural way of collecting supervision is for the learner to ask questions of the teacher about what it has done wrong. Task 9 tests one of the most simple instances, where asking “Can you help me?” when wrong obtains from the teacher the correct answer. This is thus related to the supervision in Task 3 except the learner must first ask for help in the dialog. This is potentially harder for a model as the relevant information is spread over a larger context.\nAsking for Supporting Facts Finally, in Task 10, a second less direct form of supervision for the learner after asking for help is to receive a hint rather than the correct answer, such as “A relevant fact is John moved to the bathroom” when asking “Can you help me?”, see Fig. 1 Task 10. This is thus related to the supervision in Task 5 except the learner must request help.\nIn our experiments we constructed the ten supervision tasks for the two datasets which are all available for download at http://fb.ai/babi. They were built in the following way: for each task we consider a fixed policy1 for performing actions (answering questions) which gets questions correct with probability πacc (i.e. the chance of getting the red text correct in Figs. 1 and 2). We thus can compare different learning algorithms for each task over different values of πacc (0.5, 0.1 and 0.01). In all cases a training, validation and test set is provided. For the bAbI dataset this consists of\n1 Since the policy is fixed and actually does not depend on the model being learnt, one could also think of it as coming from another agent (or the same agent in the past) which in either case is an imperfect expert.\n1000, 100 and 1000 questions respectively per task, and for movieQA there are ∼ 96k, ∼ 10k and ∼ 10k respectively. MovieQA also includes a knowledge base (KB) of ∼ 85k facts from OMDB, the memory network model we employ uses inverted index retrieval based on the question to form relevant memories from this set, see [4] for more details. Note that because the policies are fixed the experiments in this paper are not in a reinforcement learning setting."
        },
        {
            "heading": "4 Learning Models",
            "text": "Our main goal is to explore training strategies that can execute dialog-based language learning. To this end we evaluate four possible strategies: imitation learning, reward-based imitation, forward prediction, and a combination of reward-based imitation and forward prediction. We will subsequently describe each in turn.\nWe test all of these approaches with the same model architecture: an end-to-end memory network (MemN2N) [26]. Memory networks [29, 26] are a recently introduced model that have been shown to do well on a number of text understanding tasks, including question answering and dialog [4, 2], language modeling [26] and sentence completion [7]. In particular, they outperform LSTMs and other baselines on the bAbI datasets [30] which we employ with dialog-based learning modifications in Sec. 3. They are hence a natural baseline model for us to use in order to explore differing modes of learning in our setup. In the following we will first review memory networks, detailing the explicit choices of architecture we made, and then show how they can be modified and applied to our setting of dialog-based language learning.\nMemory Networks A high-level description of the memory network architecture we use is given in Fig. 3 (a). The input is the last utterance of the dialog, x, as well as a set of memories (context) (c1, . . . , cN ) which can encode both short-term memory, e.g. recent previous utterances and replies, and long-term memories, e.g. facts that could be useful for answering questions. The context inputs ci are converted into vectors mi via embeddings and are stored in the memory. The goal is to produce an output â by processing the input x and using that to address and read from the memory, m, possibly multiple times, in order to form a coherent reply. In the figure the memory is read twice, which is termed multiple “hops” of attention.\nIn the first step, the input x is embedded using a matrix A of size d × V where d is the embedding dimension and V is the size of the vocabulary, giving q = Ax, where the input x is as a bag-ofwords vector. Each memory ci is embedded using the same matrix, giving mi = Aci. The output of addressing and then reading from memory in the first hop is:\no1 = ∑ i p1imi, p 1 i = Softmax(q >mi).\nHere, the match between the input and the memories is computed by taking the inner product followed by a softmax, yielding p1, giving a probability vector over the memories. The goal is to select\nmemories relevant to the last utterance x, i.e. the most relevant have large values of p1i . The output memory representation o1 is then constructed using the weighted sum of memories, i.e. weighted by p1. The memory output is then added to the original input, u1 = R1(o1 + q), to form the new state of the controller, where R1 is a d× d rotation matrix2. The attention over the memory can then be repeated using u1 instead of q as the addressing vector, yielding:\no2 = ∑ i p2imi, p 2 i = Softmax(u > 1 mi),\nThe controller state is updated again with u2 = R2(o2 + u1), where R2 is another d × d matrix to be learnt. In a two-hop model the final output is then defined as:\nâ = Softmax(u>2 Ay1, . . . , u > 2 AyC) (1)\nwhere there are C candidate answers in y. In our experiments C is the set of actions that occur in the training set for the bAbI tasks, and for MovieQA it is the set of words retrieved from the KB.\nHaving described the basic architecture, we now detail the possible training strategies we can employ for our tasks.\nImitation Learning This approach involves simply imitating one of the speakers in observed dialogs, which is essentially a supervised learning objective3. This is the setting that most existing dialog learning, as well as question answer systems, employ for learning. Examples arrive as (x, c, a) triples, where a is (assumed to be) a good response to the last utterance x given context c. In our case, the whole memory network model defined above is trained using stochastic gradient descent by minimizing a standard cross-entropy loss between â and the label a.\nReward-based Imitation If some actions are poor choices, then one does not want to repeat them, that is we shouldn’t treat them as a supervised objective. In our setting positive reward is only obtained immediately after (some of) the correct actions, or else is zero. A simple strategy is thus to only apply imitation learning on the rewarded actions. The rest of the actions are simply discarded from the training set. This strategy is derived naturally as the degenerate case one obtains by applying policy gradient [31] in our setting where the policy is fixed (see end of Sec. 3). In more complex settings (i.e. where actions that are made lead to long-term changes in the environment and delayed rewards) applying reinforcement learning algorithms would be necessary, e.g. one could still use policy gradient to train the MemN2N but applied to the model’s own policy, as used in [25].\nForward Prediction An alternative method of training is to perform forward prediction: the aim is, given an utterance x from speaker 1 and an answer a by speaker 2 (i.e., the learner), to predict x̄, the response to the answer from speaker 1. That is, in general to predict the changed state of the world after action a, which in this case involves the new utterance x̄.\nTo learn from such data we propose the following modification to memory networks, also shown in Fig. 3 (b): essentially we chop off the final output from the original network of Fig. 3 (a) and replace it with some additional layers that compute the forward prediction. The first part of the network remains exactly the same and only has access to input x and context c, just as before. The computation up to u2 = R2(o2 + u1) is thus exactly the same as before.\nAt this point we observe that the computation of the output in the original network, by scoring candidate answers in eq. (1) looks similar to the addressing of memory. Our key idea is thus to perform another “hop” of attention but over the candidate answers rather than the memories. Crucially, we also incorporate the information of which action (candidate) was actually selected in the dialog (i.e. which one is a). After this “hop”, the resulting state of the controller is then used to do the forward prediction.\nConcretely, we compute: o3 = ∑ i p3i (Ayi + β ∗[a = yi]), p 3 i = Softmax(u > 2 Ayi), (2)\n2Optionally, different dictionaries can be used for inputs, memories and outputs instead of being shared. 3Imitation learning algorithms are not always strictly supervised algorithms, they can also depend on the agent’s actions. That is not the setting we use here, where the task is to imitate one of the speakers in a dialog.\nwhere β∗ is a d-dimensional vector, that is also learnt, that represents in the output o3 the action that was actually selected. After obtaining o3, the forward prediction is then computed as:\nx̂ = Softmax(u>3 Ax̄1, . . . , u > 3 Ax̄C̄)\nwhere u3 = R3(o3 + u2). That is, it computes the scores of the possible responses to the answer a over C̄ possible candidates. The mechanism in eq. (2) gives the model a way to compare the most likely answers to x with the given answer a, which in terms of supervision we believe is critical. For example in question answering if the given answer a is incorrect and the model can assign high pi to the correct answer then the output o3 will contain a small amount of β∗; conversely, o3 has a large amount of β∗ if a is correct. Thus, o3 informs the model of the likely response x̄ from the teacher.\nTraining can then be performed using the cross-entropy loss between x̂ and the label x̄, similar to before. In the event of a large number of candidates C̄ we subsample the negatives, always keeping x̄ in the set. The set of answers y can also be similarly sampled, making the method highly scalable.\nA major benefit of this particular architectural design for forward prediction is that after training with the forward prediction criterion, at test time one can “chop off” the top again of the model to retrieve the original memory network model of Fig. 3 (a). One can thus use it to predict answers â given only x and c. We can thus evaluate its performance directly for that goal as well.\nFinally, and importantly, if the answer to the response x̄ carries pertinent supervision information for choosing â, as for example in many of the settings of Sec. 3 (and Fig. 1), then this will be backpropagated through the model. This is simply not the case in the imitation, reward-shaping [24] or reward-based imitation learning strategies which concentrate on the x, a pairs.\nReward-based Imitation + Forward Prediction As our reward-based imitation learning uses the architecture of Fig. 3 (a), and forward prediction uses the same architecture but with the additional layers of Fig 3 (b), we can learn jointly with both strategies. One simply shares the weights across the two networks, and performs gradient steps for both criteria, one of each type per action. The former makes use of the reward signal – which when available is a very useful signal – but fails to use potential supervision feedback in the subsequent utterances, as described above. It also effectively ignores dialogs carrying no reward. Forward prediction in contrast makes use of dialog-based feedback and can train without any reward. On the other hand not using rewards when available is a serious handicap. Hence, the mixture of both strategies is a potentially powerful combination."
        },
        {
            "heading": "5 Experiments",
            "text": "We conducted experiments on the datasets described in Section 3. As described before, for each task we consider a fixed policy for performing actions (answering questions) which gets questions correct with probability πacc. We can thus compare the different training strategies described in Sec. 4 over each task for different values of πacc. Hyperparameters for all methods are optimized on the validation sets. A summary of the results is reported in Table 1 for the bAbI dataset and Table 2 for MovieQA. We observed the following results:\nOne of the most interesting aspects of our results is that FP works at all without any rewards. In Task 2 it does not even “know” the difference between words like “yes” or “’correct” vs. words like “wrong” or “incorrect”, so why should it tend to predict actions that lead to a response like “yes, that’s right”? This is because there is a natural coherence to predicting true answers that leads to greater accuracy in forward prediction. That is, you cannot predict a “right” or “wrong” response from the teacher if you don’t know what the right answer is. In our experiments our policies πacc sample negative answers equally, which may make learning simpler. We thus conducted an experiment on Task 2 (positive and negative feedback) of the bAbI dataset with a much more biased policy: it is the same as πacc = 0.5 except when the policy predicts incorrectly there is probability 0.5 of choosing a random guess as before, and 0.5 of choosing the fixed answer bathroom. In this case the FP method obtains 68% accuracy showing the method still works in this regime, although not as well as before."
        },
        {
            "heading": "6 Conclusion",
            "text": "We have presented a set of evaluation datasets and models for dialog-based language learning. The ultimate goal of this line of research is to move towards a learner capable of talking to humans, such that humans are able to effectively teach it during dialog. We believe the dialog-based language learning approach we described is a small step towards that goal.\nThis paper only studies some restricted types of feedback, namely positive feedback and corrections of various types. However, potentially any reply in a dialog can be seen as feedback, and should be useful for learning. It should be studied if forward prediction, and the other approaches we tried, work there too. Future work should also develop further evaluation methodologies to test how the models we presented here, and new ones, work in those settings, e.g. in more complex settings where actions that are made lead to long-term changes in the environment and delayed rewards, i.e. extending to the reinforcement learning setting. Finally, dialog-based feedback could also be used as a medium to learn non-dialog based skills, e.g. natural language dialog for completing visual or physical tasks."
        },
        {
            "heading": "Acknowledgments",
            "text": "We thank Arthur Szlam, Y-Lan Boureau, Marc’Aurelio Ranzato, Ronan Collobert, Michael Auli, David Grangier, Alexander Miller, Sumit Chopra, Antoine Bordes and Leon Bottou for helpful discussions and feedback, and the Facebook AI Research team in general for supporting this work."
        }
    ],
    "title": "Dialog-based Language Learning",
    "year": 2016
}