{
    "abstractText": "Hyperbolic embeddings offer excellent quality with few dimensions when embedding hierarchical data structures like synonym or type hierarchies. Given a tree, we give a combinatorial construction that embeds the tree in hyperbolic space with arbitrarily low distortion without using optimization. On WordNet, our combinatorial embedding obtains a mean-average-precision of 0.989 with only two dimensions, while Nickel et al.’s recent construction obtains 0.87 using 200 dimensions. We provide upper and lower bounds that allow us to characterize the precision-dimensionality tradeoff inherent in any hyperbolic embedding. To embed general metric spaces, we propose a hyperbolic generalization of multidimensional scaling (h-MDS). We show how to perform exact recovery of hyperbolic points from distances, provide a perturbation analysis, and give a recovery result that allows us to reduce dimensionality. The h-MDS approach offers consistently low distortion even with few dimensions across several datasets. Finally, we extract lessons from the algorithms and theory above to design a PyTorch-based implementation that can handle incomplete information and is scalable.",
    "authors": [
        {
            "affiliations": [],
            "name": "Christopher De Sa"
        },
        {
            "affiliations": [],
            "name": "Albert Gu"
        },
        {
            "affiliations": [],
            "name": "Christopher Ré"
        },
        {
            "affiliations": [],
            "name": "Frederic Sala"
        }
    ],
    "id": "SP:a1da3c7c5e721e6fd09ff4ef30ca183b3cf7f48f",
    "references": [
        {
            "authors": [
                "M. Abu-Ata",
                "F.F. Dragan"
            ],
            "title": "Metric tree-like structures in real-world networks: an empirical study",
            "venue": "Networks, 67 (1):49–68,",
            "year": 2015
        },
        {
            "authors": [
                "R. Benedetti",
                "C. Petronio"
            ],
            "title": "Lectures on Hyperbolic Geometry",
            "venue": "Springer, Berlin, Germany,",
            "year": 1992
        },
        {
            "authors": [
                "D. Brannan",
                "M. Esplen",
                "J. Gray"
            ],
            "title": "Geometry",
            "venue": "Cambridge University Press, Cambridge, UK,",
            "year": 2012
        },
        {
            "authors": [
                "E. Candes",
                "T. Tao"
            ],
            "title": "The power of convex relaxation: Near-optimal matrix completion",
            "venue": "IEEE Transactions on Information Theory, 56(5):2053–2080,",
            "year": 2010
        },
        {
            "authors": [
                "B.P. Chamberlain",
                "J.R. Clough",
                "M.P. Deisenroth"
            ],
            "title": "Neural embeddings of graphs in hyperbolic space",
            "venue": "arXiv preprint, arXiv:1705.10359,",
            "year": 2017
        },
        {
            "authors": [
                "W. Chen",
                "W. Fang",
                "G. Hu",
                "M.W. Mahoney"
            ],
            "title": "On the hyperbolicity of small-world and tree-like random graphs",
            "venue": "International Symposium on Algorithms and Computation (ISAAC) 2012, pages 278–288, Taipei, Taiwan,",
            "year": 2012
        },
        {
            "authors": [
                "J. Conway",
                "N.J.A. Sloane"
            ],
            "title": "Sphere Packings, Lattices and Groups",
            "venue": "Springer, New York, NY,",
            "year": 1999
        },
        {
            "authors": [
                "A. Cvetkovski",
                "M. Crovella"
            ],
            "title": "Hyperbolic embedding and routing for dynamic graphs",
            "venue": "IEEE INFOCOM 2009,",
            "year": 2009
        },
        {
            "authors": [
                "Andrej Cvetkovski",
                "Mark Crovella"
            ],
            "title": "Multidimensional scaling in the poincaré disk",
            "venue": "Applied mathematics & information sciences,",
            "year": 2016
        },
        {
            "authors": [
                "W. De Nooy",
                "A. Mrvar",
                "V. Batagelj"
            ],
            "title": "Exploratory social network analysis with Pajek, volume 27",
            "venue": "Cambridge University Press,",
            "year": 2011
        },
        {
            "authors": [
                "D. Eppstein",
                "M. Goodrich"
            ],
            "title": "Succinct greedy graph drawing in the hyperbolic plane",
            "venue": "Proc. of the International Symposium on Graph Drawing (GD 2011), pages 355–366, Eindhoven, Netherlands,",
            "year": 2011
        },
        {
            "authors": [
                "P. Fletcher",
                "C. Lu",
                "S. Pizer",
                "S. Joshi"
            ],
            "title": "Principal geodesic analysis for the study of nonlinear statistics of shape",
            "venue": "IEEE Transactions on Medical Imaging, 23(8):995–1005,",
            "year": 2004
        },
        {
            "authors": [
                "O. Ganea",
                "G. Bécigneul",
                "T. Hofmann"
            ],
            "title": "Hyperbolic entailment cones for learning hierarchical embeddings",
            "venue": "arXiv preprint, arXiv:1804.01882,",
            "year": 2018
        },
        {
            "authors": [
                "K. Goh",
                "M. Cusick",
                "D. Valle",
                "B. Childs",
                "M. Vidal",
                "A. Barabási"
            ],
            "title": "The human disease network",
            "venue": "Proceedings of the National Academy of Sciences, 104(21),",
            "year": 2007
        },
        {
            "authors": [
                "M. Gromov"
            ],
            "title": "Hyperbolic groups",
            "venue": "Essays in group theory. Springer,",
            "year": 1987
        },
        {
            "authors": [
                "W. Hofbauer",
                "L. Forrest",
                "P. Hollingsworth",
                "M. Hart"
            ],
            "title": "First insights in the diversity of certain mosses colonising modern building surfaces by use of genetic barcoding",
            "year": 2016
        },
        {
            "authors": [
                "S. Huckemann",
                "T. Hotz",
                "A. Munk"
            ],
            "title": "Intrinsic shape analysis: Geodesic pca for riemannian manifolds modulo isometric lie group actions",
            "venue": "Statistica Sinica, pages 1–58,",
            "year": 2010
        },
        {
            "authors": [
                "I. Abraham"
            ],
            "title": "Reconstructing approximate tree metrics",
            "venue": "In Proceedings of the twenty-sixth annual ACM symposium on Principles of Distributed Computing (PODC),",
            "year": 2007
        },
        {
            "authors": [
                "M. Jenssen",
                "F. Joos",
                "W. Perkin"
            ],
            "title": "On kissing numbers and spherical codes in high dimensions",
            "venue": "arXiv preprint, arXiv:1803.02702,",
            "year": 2018
        },
        {
            "authors": [
                "H. Jeong",
                "S.P. Mason",
                "A.L. Barabasi",
                "Z.N. Oltvai"
            ],
            "title": "Lethality and centrality in protein networks",
            "venue": "arXiv preprint cond-mat/0105306,",
            "year": 2001
        },
        {
            "authors": [
                "J. Kleinberg"
            ],
            "title": "Authoritative sources in a hyperlinked environment",
            "venue": "URL http://www.cs.cornell",
            "year": 1999
        },
        {
            "authors": [
                "R. Kleinberg"
            ],
            "title": "Geographic routing using hyperbolic space",
            "venue": "26th IEEE International Conference on Computer Communications (ICC), pages 1902–1909,",
            "year": 2007
        },
        {
            "authors": [
                "D. Krioukov",
                "F. Papadopoulos",
                "A. Vahdat M"
            ],
            "title": "Boguná. Curvature and temperature of complex networks",
            "venue": "Physical Review E,",
            "year": 2009
        },
        {
            "authors": [
                "D. Krioukov",
                "F. Papadopoulos",
                "M. Kitsak",
                "A. Vahdat",
                "M. Boguná"
            ],
            "title": "Hyperbolic geometry of complex networks",
            "venue": "Physical Review E, 82(3):036106,",
            "year": 2010
        },
        {
            "authors": [
                "J. Lamping",
                "R. Rao"
            ],
            "title": "Laying out and visualizing large trees using a hyperbolic space",
            "venue": "Proceedings of the 7th annual ACM symposium on User interface software and technology, pages 13–14. ACM,",
            "year": 1994
        },
        {
            "authors": [
                "J. Leskovec",
                "J. Kleinberg",
                "C. Faloutsos"
            ],
            "title": "Graph evolution: Densification and shrinking diameters",
            "year": 2007
        },
        {
            "authors": [
                "N. Linial",
                "E. London",
                "Y. Rabinovich"
            ],
            "title": "The geometry of graphs and some of its algorithmic applications",
            "venue": "Combinatorica, 15(2):215–245,",
            "year": 1995
        },
        {
            "authors": [
                "M. Nickel",
                "D. Kiela"
            ],
            "title": "Poincaré embeddings for learning hierarchical representations",
            "venue": "Advances in Neural Information Processing Systems 30 (NIPS 2017), Long Beach, CA,",
            "year": 2017
        },
        {
            "authors": [
                "X. Pennec"
            ],
            "title": "Barycentric subspace analysis on manifolds",
            "venue": "Annals of Statistics, to appear",
            "year": 2017
        },
        {
            "authors": [
                "R.A. Rossi",
                "N.K. Ahmed"
            ],
            "title": "The network data repository with interactive graph analytics and visualization",
            "venue": "Proceedings of the Twenty-Ninth AAAI Conference on Artificial Intelligence,",
            "year": 2015
        },
        {
            "authors": [
                "M.J. Sanderson",
                "M.J. Donoghue",
                "W.H. Piel",
                "T. Eriksson"
            ],
            "title": "TreeBASE: a prototype database of phylogenetic analyses and an interactive tool for browsing the phylogeny of life",
            "venue": "American Journal of Botany, 81(6),",
            "year": 1994
        },
        {
            "authors": [
                "R. Sarkar"
            ],
            "title": "Low distortion Delaunay embedding of trees in hyperbolic plane",
            "venue": "Proc. of the International Symposium on Graph Drawing (GD 2011), pages 355–366, Eindhoven, Netherlands,",
            "year": 2011
        },
        {
            "authors": [
                "R. Sibson"
            ],
            "title": "Studies in the robustness of multidimensional scaling: Procrustes statistics",
            "venue": "Journal of the Royal Statistical Society, Series B, 40(2):234–238,",
            "year": 1978
        },
        {
            "authors": [
                "R. Sibson"
            ],
            "title": "Studies in the robustness of multidimensional scaling: Perturbational analysis of classical scaling",
            "venue": "Journal of the Royal Statistical Society, Series B, 41(2):217–229,",
            "year": 1979
        },
        {
            "authors": [
                "Y. Tay",
                "L.A. Tuan",
                "S.C. Hui"
            ],
            "title": "Hyperbolic representation learning for fast and efficient neural question answering",
            "venue": "Proceedings of the Eleventh ACM International Conference on Web Search and Data Mining, pages 583–591. ACM,",
            "year": 2018
        },
        {
            "authors": [
                "K. Verbeek",
                "S. Suri"
            ],
            "title": "Metric embedding, hyperbolic space, and social networks",
            "venue": "Computational Geometry, 59: 1–12,",
            "year": 2016
        },
        {
            "authors": [
                "J.A. Walter"
            ],
            "title": "H-MDS: a new approach for interactive visualization with multidimensional scaling in the hyperbolic space",
            "venue": "Information Systems, 29(4):273–292,",
            "year": 2004
        },
        {
            "authors": [
                "R.C. Wilson",
                "E.R. Hancock",
                "E. Pekalska",
                "R. Duin"
            ],
            "title": "Spherical and hyperbolic embeddings of data",
            "venue": "IEEE Transactions on Pattern Analysis and Machine Intelligence, 36(11):2255–2269,",
            "year": 2014
        },
        {
            "authors": [
                "M. Zhang",
                "P. Fletcher"
            ],
            "title": "Probabilistic principal geodesic analysis",
            "venue": "Advances in Neural Information Processing Systems 26 (NIPS 2013), Lake Tahoe, NV,",
            "year": 2013
        }
    ],
    "sections": [
        {
            "heading": "1 Introduction",
            "text": "Recently, hyperbolic embeddings have been proposed as a way to capture hierarchy information for use in link prediction and natural language processing tasks [5, 28]. These approaches are an exciting new way to fuse rich structural information (for example, from knowledge graphs or synonym hierarchies) with the continuous representations favored by modern machine learning.\nTo understand the intuition behind hyperbolic embeddings’ superior capacity, note that trees can be embedded with arbitrarily low distortion into the Poincaré disk, a model of hyperbolic space with only two dimensions [32]. In contrast, Bourgain’s theorem [27] shows that Euclidean space is unable to obtain comparably low distortion for trees—even using an unbounded number of dimensions. Moreover, hyperbolic space can preserve certain properties; for example, angles between embedded vectors are the same in both Euclidean space and the Poincaré model (the mapping is conformal), which suggests embedded data may be easily able to integrate with downstream tasks.\nMany graphs, such as complex networks [24], including the Internet [23] and social networks [36]) are known to have hyperbolic structure and thus befit hyperbolic embeddings. Recent works show that hyperbolic representations are indeed suitable for many hierarchies (e.g, the question answering system HyperQA proposed in [35], vertex classifiers in [5], and link prediction [28]). However, the optimization problem underlying these embeddings is challenging, and we seek to understand the subtle tradeoffs involved.\nWe begin by considering the situation in which we are given an input graph that is a tree or nearly tree-like, and our goal is to produce a low-dimensional hyperbolic embedding that preserves all distances. This leads to a simple strategy that is combinatorial in that it does not minimize a surrogate loss function using gradient descent. It is both fast (nearly linear time) and has formal quality guarantees. The approach proceeds in two phases: (1) we produce an embedding of a graph into a weighted tree, and (2) we embed that tree into the hyperbolic disk. In particular, we consider an extension of an elegant embedding of trees into the Poincaré disk by Sarkar [32] and recent work on low-distortion graph embeddings into tree metrics [18]. For trees, this approach has nearly perfect quality. On the WordNet hypernym\nar X\niv :1\n80 4.\n03 32\n9v 2\n[ cs\n.L G\n] 2\n4 A\npr 2\ngraph reconstruction, this obtains nearly perfect mean average precision (MAP) 0.989 using just two dimensions, which outperforms the best published numbers in Nickel and Kiela [28] by almost 0.12 points with 200 dimensions.\nWe analyze this construction to extract fundamental tradeoffs. One tradeoff involves the dimension, the properties of the graph, and the number of bits of precision - an important hidden cost. For example, on the WordNet graph, we require almost 500 bits of precision to store values from the combinatorial embedding. We can reduce this number to 32 bits, but at the cost of using 10 dimensions instead of two. We show that for a fixed precision, the dimension required scales linearly with the length of the longest path. On the other hand, the dimension scales logarithmically with the maximum degree of the tree. This suggests that hyperbolic embeddings should have high quality on hierarchies like WordNet but require large dimensions or high precision on graphs with long chains—which is supported by our experiments. A second observation is that in contrast to Euclidean embeddings, hyperbolic embeddings are not scale invariant. This motivates us to add a learnable scale term into a stochastic gradient descent-based Pytorch algorithm described below, and we show that it allows us to empirically improve the quality of embeddings.\nTo understand how hyperbolic embeddings perform for metrics that are far from tree-like, we consider a more general problem: given a matrix of distances that arise from points that are embeddable in hyperbolic space of dimension d (not necessarily from a graph), find a set of points that produces these distances. In Euclidean space, the problem is known as multidimensional scaling (MDS) which is solvable using PCA.1 A key step is a transformation that effectively centers the points–without knowledge of their exact coordinates. It is not obvious how to center points in hyperbolic space, which is curved. We show that in hyperbolic space, a centering operation is still possible with respect to a non-standard mean. In turn, this allows us to reduce the hyperbolic MDS problem (h-MDS) to a standard eigenvalue problem, and so it can be solved with scalable power methods. Further, we extend classical perturbation analysis [33, 34]. When applied to distances from real data, h-MDS obtains low distortion on graphs that are far from tree like. However, we observe that these solutions may require high precision, which is not surprising in light of our previous analysis.\nFinally, we consider handling increasing amounts of noise in the model, which leads naturally into new SGD-based formulations. In traditional PCA, one may discard eigenvectors that have correspondingly small eigenvalues to cope with noise. In hyperbolic space, this approach may produce suboptimal results. Like PCA, the underlying problem is nonconvex. In contrast to PCA, the optimization problem is more challenging: the underlying problem has local minima that are not global minima. Our main technical result is that an SGD-based algorithm initialized with a h-MDS solution can recover the submanifold the data is on–even in some cases in which the data is perturbed by noise that can be full dimensional. Our algorithm essentially provides new recovery results for convergence for Principal Geodesic Analysis (PGA) in hyperbolic space [12, 17]. We discuss the nuances between our optimization algorithms and previous attempts at these problems in Appendix B.\nAll of our results can handle incomplete distance information through standard techniques. Using the observations above, we implemented an SGD algorithm that minimizes the loss derived from the PGA loss using PyTorch.2"
        },
        {
            "heading": "2 Background",
            "text": "We provide intuition connecting hyperbolic space and tree distances, discuss the metrics used to measure embedding fidelity, and provide the relationship between reconstruction and learning for graph embeddings.\nHyperbolic spaces The Poincaré disk H2 is a two-dimensional model of hyperbolic geometry with points located in the interior of the unit disk, as shown in Figure 1. A natural generalization of H2 is the Poincaré ball Hr, with elements inside the unit ball. The Poincaré models offer several useful properties, chief among which is mapping conformally to Euclidean space. That is, angles are preserved between hyperbolic and Euclidean space. Distances, on the other hand,\n1There is no perfect analogue of PCA in hyperbolic space [29]. 2A minor instability with Chamberlain et al. [5], Nickel and Kiela [28]’s formulation is that one must guard against NANs. This instability may be unavoidable in formulations that minimize hyperbolic distance with gradient descent, as the derivative of the hyperbolic distance has a singularity, that is, limy→x ∂x|dH(x, y)| → ∞ for any x ∈ H in which dH is the hyperbolic distance function. This issue can be mitigated by minimizing d2H , which does have a continuous derivative throughout H. We propose to do so in Section 4.2 and discuss this further in the Appendix.\nare not preserved, but are given by dH(x, y) = acosh ( 1 + 2 ‖x− y‖2\n(1− ‖x‖2)(1− ‖y‖2)\n) .\nThere are some potentially unexpected consequences of this formula, and a simple example gives intuition about a key technical property that allows hyperbolic space to embed trees. Consider three points: the origin 0, and points x and y with ‖x‖ = ‖y‖ = t for some t > 0. As shown on the right of Figure 1, as t → 1 (i.e., the points move towards the outside of the disk), in flat Euclidean space, the ratio dE(x,y)dE(x,0)+dE(0,y) is constant with respect to t (blue curve). In contrast, the ratio dH(x,y)dH(x,0)+dH(0,y) approaches 1, or, equivalently, the distance dH(x, y) approaches dH(x, 0)+dH(0, y) (red and pink curves). That is, the shortest path between x and y is almost the same as the path through the origin. This is analogous to the property of trees in which the shortest path between two sibling nodes is the path through their parent. This tree-like nature of hyperbolic space is the key property exploited by embeddings. Moreover, this property holds for arbitrarily small angles between x and y.\nLines and geodesics There are two types of geodesics (shortest paths) in the Poincaré disk model of hyperbolic space: segments of circles that are orthogonal to the disk surface, and disk diameters [3]. Our algorithms and proofs make use of a simple geometric fact: isometric reflection across geodesics (preserving hyperbolic distances) is represented in this Euclidean model as a circle inversion. A particularly important reflection associated with each point x is the one that takes x to the origin [3, p. 268].\nEmbeddings and fidelity measures An embedding is a mapping f : U → V for spaces U, V with distances dU , dV . We measure the quality of embeddings with several fidelity measures, presented here from most local to most global.\nRecent work [28] proposes using the mean average precision (MAP). For a graph G = (V,E), let a ∈ V have neighborhood Na = {b1, b2, . . . , bdeg(a)}, where deg(a) denotes the degree of a. In the embedding f , consider the points closest to f(a), and define Ra,bi to be the smallest set of such points that contains bi (that is, Ra,bi is the smallest set of nearest points required to retrieve the ith neighbor of a in f ). Then, the MAP is defined to be\nMAP(f) = 1 |V | ∑ a∈V 1 |Na| |Na|∑ i=1 Precision(Ra,bi) = 1 |V | ∑ a∈V\n1\ndeg(a) |Na|∑ i=1 |Na ∩Ra,bi | |Ra,bi | .\nWe have MAP(f) ≤ 1, with equality as the best case. Note that MAP is not concerned with the underlying distances at all, but only the ranks between the distances of immediate neighbors. It is a local metric.\nThe standard metric for graph embeddings is distortion D. For an n point embedding,\nD(f) = 1( n 2 )  ∑ u,v∈U :u6=v |dV (f(u), f(v))− dU (u, v)| dU (u, v)  .\nThe best distortion is D(f) = 0, preserving the edge lengths exactly. This is a global metric, as it depends directly on the underlying distances rather than the local relationships between distances. A variant of this, the worst-case distortion Dwc, is the metric defined by\nDwc(f) = maxu,v∈U :u 6=v dV (f(u), f(v))/dU (u, v)\nminu,v∈U :u6=v dV (f(u), f(v))/dU (u, v) .\nThat is, the wost-case distortion is the ratio of the maximal expansion and the minimal contraction of distances. Note that scaling the unit distance does not affect Dwc. The best worst-case distortion is Dwc(f) = 1.\nThe intended application of the embedding informs the choice of metric. For applications where the underlying distances are important, distortion is useful. On the other hand, if only rankings matter, MAP may suffice. This choice is important: as we shall see, different embedding algorithms implicitly target different metrics.\nReconstruction and learning In the case where we lack a full set of distances, we can deal with the missing data in one of two ways. First, we can use the triangle inequality to recover the missing distances. Second, we can access the scaled Euclidean distances (the inside of the acosh in dH(x, y)), and then the resulting matrix can be recovered with standard matrix completion techniques [4]. Afterwards, we can proceed to compute an embedding using any of the approaches discussed in this paper. We quantify the error introduced by this process experimentally in Section 5."
        },
        {
            "heading": "3 Combinatorial Constructions",
            "text": "We first focus on hyperbolic tree embeddings—a natural approach considering the tree-like behavior of hyperbolic space. We review the embedding of Sarkar [32] to higher dimensions. We then provide novel analysis about the precision of the embeddings that reveals fundamental limits of hyperbolic embeddings. In particular, we characterize the bits of precision needed for hyperbolic representations. We then extend the construction to r dimensions, and we propose to use Steiner nodes to better embed general graphs as trees building on a condition from I. Abraham et al. [18].\nEmbedding trees The nature of hyperbolic space lends itself towards excellent tree embeddings. In fact, it is possible to embed trees into the Poincaré disk H2 with arbitrarily low distortion [32]. Remarkably, trees cannot be embedded into Euclidean space with arbitrarily low distortion for any number of dimensions. These notions motivate the following two-step process for embedding hierarchies into hyperbolic space.\n1. Embed the graph G = (V,E) into a tree T ,\n2. Embed T into the Poincaré ball Hd.\nWe refer to this process as the combinatorial construction. Note that we are not required to minimize a loss function. We begin by describing the second stage, where we extend an elegant construction from Sarkar [32]."
        },
        {
            "heading": "3.1 Sarkar’s Construction",
            "text": "Algorithm 1 implements a simple embedding of trees into H2. The algorithm takes as input a scaling factor τ a node a (of degree deg(a)) from the tree with parent node b. Suppose a and b have already been embedded into H2 and have corresponding embedded vectors f(a) and f(b). The algorithm places the children c1, c2, . . . , cdeg(a)−1 into H2 through a two-step process.\nFirst, f(a) and f(b) are reflected across a geodesic (using circle inversion) so that f(a) is mapped onto the origin 0 and f(b) is mapped onto some point z. Next, we place the children nodes to vectors y1, . . . , yd−1 equally spaced around a circle with radius e\nτ−1 eτ+1 (which is a circle of radius τ in the hyperbolic metric), and maximally separated from the\nreflected parent node embedding z. Lastly, we reflect all of the points back across the geodesic. Note that the isometric properties of reflections imply that all children are now at hyperbolic distance exactly τ from f(a).\nAlgorithm 1 Sarkar’s Construction 1: Input: Node a with parent b, children to place c1, c2, . . . , cdeg(a)−1, partial embedding f containing an embedding\nfor a and b, scaling factor τ 2: (0, z)← reflectf(a)→0(f(a), f(b)) 3: θ ← arg(z) {angle of z from x-axis in the plane} 4: for i ∈ {1, . . . ,deg(a)− 1} do 5: yi ← ( eτ−1 eτ+1 · cos ( θ + 2πideg(a) ) , e τ−1 eτ+1 · sin ( θ + 2πideg(a)\n)) 6: end for 7: (f(a), f(b), f(c1), . . . , f(cdeg(a)−1))← reflect0→f(a)(0, z, y1, . . . , ydeg(x)−1) 8: Output: Embedded H2 vectors f(c1), f(c2), . . . , f(cdeg(a)−1)\nTo embed the entire tree, we place the root at the origin O and its children in a circle around it (as in Step 5 of Algorithm 1), then recursively place their children until all nodes have been placed. Notice this construction runs in linear time."
        },
        {
            "heading": "3.2 Analyzing Sarkar’s Construction",
            "text": "The Voronoi cell around a node a ∈ T consists of points x ∈ H2 such that dH(f(a), x) ≤ dH(f(b), x) for all b ∈ T distinct from a. That is, the cell around a includes all points closer to f(a) than to any other embedded node of the tree. Sarkar’s construction produces Delauney embeddings: embeddings where the Voronoi cells for points a and b touch only if a and b are neighbors in T . Thus this embedding will preserve neighborhoods.\nA key technical idea exploited by Sarkar [32] is to scale all the edges by a factor τ before embedding. We can then recover the original distances by dividing by τ . This transformation exploits the fact that hyperbolic space is not scale invariant. Sarkar’s construction always captures neighbors perfectly, but Figure 1 implies that increasing the scale preserves the distances between farther nodes better. Indeed, if one sets τ = 1+εε ( 2 log degmaxπ/2 ) , then the worst-case distortion D of the resulting embedding is no more than 1 + ε. For trees, Sarkar’s construction has arbitrarily high fidelity. However, this comes at a cost: the scaling τ affects the bits of precision required. In fact, we will show that the precision scales logarithmically with the degree of the tree—but linearly with the maximum path length. We use this to better understand the situations in which hyperbolic embeddings obtain high quality.\nHow many bits of precision do we need to represent points in H2? If x ∈ H2, then ‖x‖ < 1, so we need sufficiently many bits so that 1− ‖x‖ will not be rounded to zero. This requires roughly − log(1− ‖x‖) = log 11−‖x‖ bits. Say we are embedding two points x, y at distance d. As described in the background, there is an isometric reflection that takes a pair of points (x, y) in H2 to (0, z) while preserving their distance, so without loss of generality we have that\nd = dH(x, y) = dH(0, z) = acosh\n( 1 + 2 ‖z‖2\n1− ‖z‖2\n) .\nRearranging the terms, we have cosh(d) + 1\n2 =\n1 1− ‖z‖2 ≥ 1/2 1− ‖z‖ .\nThus, the number of bits we want so that 1− ‖z‖ will not be rounded to zero is log(cosh(d) + 1). Since cosh(d) = (exp(d) + exp(−d))/2, this is roughly d bits. That is, in hyperbolic space, we need about d bits to express distances of d (rather than log d as we would in Euclidean space).3 This result will be of use below.\nNow we consider the largest distance in the embeddings produced by Algorithm 1. If the longest path in the tree is `, and each edge has length τ = 1ε ( 2 log degmax π/2 ) , the largest distance is O( `ε log degmax), and we require this number of bits for the representation.\n3Although it is particularly easy to bound precision in the Poincaré model, this fact holds generally for hyperbolic space independent of model. See Appendix D for a general lower bound argument.\nWe interpret this expression. Note that degmax is inside the log term, so that a bushy tree is not penalized much in precision. On the other hand, the longest path length ` is not, so that hyperbolic embeddings struggle with long paths. Moreover, by selecting an explicit graph, we derive a matching lower bound, concluding that to achieve a distortion ε, any construction requires Ω ( ` ε log(degmax) ) bits, which matches the upper bound of the combinatorial construction. The argument follows from selecting a graph consisting of m(degmax + 1) nodes in a tree with a single root and degmax chains each of length m. The proof of this result is described in Appendix D."
        },
        {
            "heading": "3.3 Improving the Construction",
            "text": "Our next contribution is a generalization of the construction from the disk H2 to the ball Hr. Our construction follows the same line as Algorithm 1, but since we have r dimensions, the step where we place children spaced out on a circle around their parent now uses a hypersphere.\nSpacing out points on the hypersphere is a classic problem known as spherical coding [7]. As we shall see, the number of children that we can place for a particular angle grows with the dimension. Since the required scaling factor τ gets larger as the angle decreases, we can reduce τ for a particular embedding by increasing the dimension. Note that increasing the dimension helps with bushy trees (large degmax), but has limited effect on tall trees with small degmax. We show Proposition 3.1. The generalized Hr combinatorial construction has distortion at most 1 + ε and requires at most O( 1ε ` r log degmax) bits to represent a node component for r ≤ (log degmax)+1, andO( 1 ε `) bits for r > (log degmax)+ 1.\nThe algorithm for the generalized Hr combinatorial construction replaces Step 5 in Algorithm 1 with a node placement step based on ideas from coding theory. The children are placed at the vertices of a hypercube inscribed into the unit hypersphere (and afterwards scaled by τ ). Each component of a hypercube vertex has the form ±1√\nr . We index these\npoints using binary sequences a ∈ {0, 1}r in the following way:\nxa =\n( (−1)a1√\nr , (−1)a2√ r , . . . , (−1)ar√ r\n) .\nWe can space out the children by controlling the distances between the children. This is done in turn by selecting a set of binary sequences with a prescribed minimum Hamming distance—a binary error-correcting code—and placing the children at the resulting hypercube vertices. We provide more details on this technique and our choice of code in the appendix."
        },
        {
            "heading": "3.4 Embedding into Trees",
            "text": "We revisit the first step of the construction: embedding graphs into trees. There are fundamental limits to how well graphs can be embedded into trees; in general, breaking long cycles inevitably adds distortion, as shown in Figure 2. We are inspired by a measure of this limit, the δ-4 points condition introduced in I. Abraham et al. [18]. A graph on n nodes that satisfies the δ-4 points condition has distortion at most (1 + δ)c1 logn for some constant c1. This result enables our end-to-end embedding to achieve a distortion of at most\nD(f) ≤ (1 + δ)c1 logn(1 + ε).\nThe result in I. Abraham et al. [18] builds a tree with Steiner nodes. These additional nodes can help control the distances in the resulting tree. Example 3.1. Embed a complete graph on {1, 2, . . . , n} into a tree. The tree will have a central node, say 1, w.l.o.g., connected to every other node; the shortest paths between pairs of nodes in {2, . . . , n} go from distance 1 in the graph to distance 2 in the tree. However, we can introduce a Steiner node n+ 1 and connect it to all of the nodes, with edge weights of 12 . This is shown in Figure 2. The distance between any pair of nodes in {1, . . . , n} remains 1.\nNote that introducing Steiner nodes can produce a weighted tree, but Algorithm 1 readily extends to the case of weighted trees by modifying Step 5. We propose using the Steiner tree algorithm in I. Abraham et al. [18] (used to achieve the distortion bound) for real embeddings, and we rely on it for our experiments in Section 5. In summary, the key takeaways of our analysis in this section are:\n• There is a fundamental tension between precision and quality in hyperbolic embeddings.\n• Hyperbolic embeddings have an exponential advantage in space compared to Euclidean embeddings for short, bushy hierarchies, but will have less of an advantage for graphs that contain long paths.\n• Choosing an appropriate scaling factor τ is critical for quality. Later, we will propose to learn this scale factor automatically for computing embeddings in PyTorch.\n• Steiner nodes can help improve embeddings of graphs."
        },
        {
            "heading": "4 Hyperbolic Multidimensional Scaling",
            "text": "In this section, we explore a fundamental and more general question than we did in the previous section: if we are given the pairwise distances arising from a set of points in hyperbolic space, can we recover the points? The equivalent problem for Euclidean distances is solved with multidimensional scaling (MDS). The goal of this section is to analyze the hyperbolic MDS (h-MDS) problem. We describe and overcome the additional technical challenges imposed by hyperbolic distances, and show that exact recovery is possible and interpretable. Afterwards we propose a technique for dimensionality reduction using principal geodesics analysis (PGA) that provides optimization guarantees. In particular, this addresses the shortcomings of h-MDS when recovering points that do not exactly lie on a hyperbolic manifold."
        },
        {
            "heading": "4.1 Exact Hyperbolic MDS",
            "text": "Suppose that there is a set of hyperbolic points x1, . . . , xn ∈ Hr, embedded in the Poincaré ball and written X ∈ Rn×r in matrix form. We observe all the pairwise distances di,j = dH(xi, xj), but do not observe X: our goal is use the observed di,j’s to recover X (or some other set of points with the same pairwise distances di,j).\nThe MDS algorithm in the Euclidean setting makes an important centering4 assumption. That is it assumes the points have mean 0, and it turns out that if an exact embedding for the distances exists, it can be recovered from a matrix factorization. In other words, Euclidean MDS always recovers a centered embedding.\n4We say that points are centered at a particular mean if this mean is at 0. The act of centering refers to applying an isometry that makes the mean of the points 0.\nIn hyperbolic space, the same algorithm does not work, but we show that it is possible to find an embedding centered at a different mean. More precisely, we introduce a new mean which we call the pseudo-Euclidean mean, that behaves like the Euclidean mean in that it enables recovery through matrix factorization. Once the points are recovered in hyperbolic space, they can be recentered around a more canonical mean by translating it to the origin.\nAlgorithm 2 is our complete algorithm, and for the remainder of this section we will describe how and why it works. We first describe the hyperboloid model, an alternate but equivalent model of hyperbolic geometry in which h-MDS is simpler. Of course, we can easily convert between the hyperboloid model and the Poincaré ball model we have used thus far. Next, we show how to reduce the problem to a standard PCA problem, which recovers an embedding centered at the points’ pseudo-Euclidean mean. Finally, we discuss the meaning and implications of centering and prove that the algorithm preserves submanifolds as well—that is, if there is an exact embedding in k < r dimensions centered at their canonical mean, then our algorithm will recover them.\nThe hyperboloid model Define Q to be the diagonal matrix in Rr+1 where Q00 = 1 and Qii = −1 for i > 0. For a vector x ∈ Rr+1, xTQx is called the Minkowski quadratic form. The hyperboloid model is defined as\nMr = { x ∈ Rr+1 ∣∣xTQx = 1 ∧ x0 > 0} . This manifold is endowed with a distance measure\ndH(x, y) = acosh(x TQy).\nAs a notational convenience, for a point x ∈Mr we will let x0 denote 0th coordinate eT0 x, and let ~x ∈ Rr denote the rest of the coordinates. Notice that x0 is just a function of ~x (in fact, x0 = √ 1 + ‖~x‖2), and so we can equivalently consider just ~x as being a member of a model of hyperbolic space: this model is sometimes known as the Gans model. With this notation, the Minkowski quadratic form can be simplified to xTQy = x0y0 − ~xT~y.\nA new mean We introduce the new mean that we will use. Given points x1, x2, . . . , xn ∈Mr in hyperbolic space, define a variance term\nΨ(z;x1, x2, . . . , xn) = n∑ i=1 sinh2(dH(xi, z)).\nUsing this, we define a pseudo-Euclidean mean to be any local minimum of this expression. Notice that this average is independent of the model of hyperbolic space that we are using, since it only is defined in terms of the hyperbolic distance function dH . Lemma 4.1. Define the matrix X ∈ Rn×r such that XT ei = ~xi and the vector u ∈ Rn such that ui = x0,i. Then\n∇~zΨ(z;x1, x2, . . . , xn)|~z=0 = −2 n∑ i=1 x0,i~xi = −2XTu.\nThis means that 0 is a pseudo-Euclidean mean if and only if 0 = XTu. Call some hyperbolic points x1, . . . , xn pseudo-Euclidean centered if their average is 0 in this sense: i.e. if XTu = 0. We can always center a set of points without affecting their pairwise distances by simply finding their average, and then sending it to 0 through an isometry.\nRecovery via matrix factorization Suppose that there exist points x1, x2, . . . , xn ∈Mr for which we observe their pairwise distances dH(xi, xj). From these, we can compute the matrix Y such that\nYi,j = cosh (dH(xi, xj)) = x T i Qxj = x0,ix0,j − ~xi T ~xj . (1)\nFurthermore, defining X and u as in Lemma 4.1, then we can write Y in matrix form as\nY = uuT −XXT . (2)\nWithout loss of generality, we can suppose that the points we are trying to recover, x1, . . . , xn, are centered at their pseudo-Euclidean mean, so that XTu = 0 by Lemma 4.1.\nAlgorithm 2 1: Input: Distance matrix di,j and rank r 2: Compute scaled distance matrix Yi,j = cosh(di,j) 3: X → PCA(−Y, r) 4: Project X from hyperboloid model to Poincaré model: x→ x\n1+ √ 1+‖x‖2\n5: If desired, center X at a different mean (e.g. the Karcher mean) 6: return X\nThis implies that u is an eigenvector of Y with positive eigenvalue, and the rest of Y ’s eigenvalues are negative. Therefore an eigendecomposition of Y will find u, X̂ such that Y = uuT − X̂X̂T , i.e. it will directly recover X up to rotation.\nIn fact, running PCA on −Y = XTX − uuT to find the n most significant non-negative eigenvectors will recover X up to rotation, and then u can be found by leveraging the fact that x0 = √ 1 + ‖~x‖2.\nThis leads to Algorithm 2, with optional post-processing steps for converting the embedding to the Poincaré ball model and for re-centering the points.\nA word on centering The MDS algorithm in Euclidean geometry returns points centered at their Karcher mean z, which is a point minimizing ∑ d2(z, xi) (where d is the distance metric). The Karcher center is particularly useful for interpreting dimensionality reduction; for example, we use the analogous hyperbolic Karcher mean to perform PGA in Section 4.2.\nAlthough Algorithm 2 returns points centered at their pseudo-Euclidean mean instead of their Karcher mean, they can be easily recentered by finding their Karcher mean and reflecting it onto the origin. Furthermore, we show that Algorithm 2 preserves the dimension of the embedding. More precisely, we prove Lemma 4.2 in Appendix E. Lemma 4.2. If a set of points lie in a dimension-k geodesic submanifold, then both their Karcher mean and their pseudo-Euclidean mean lie in the same submanifold.\nThis implies that centering with the pseudo-Euclidean mean preserves geodesic submanifolds: If it is possible to embed distances in a dimension-k geodesic submanifold centered and rooted at a Karcher mean, then it is also possible to embed the distances in a dimension-k submanifold centered and rooted at a pseudo-Euclidean mean, and vice versa."
        },
        {
            "heading": "4.2 Reducing Dimensionality with PGA",
            "text": "Sometimes we are given a high-rank embedding (resulting from h-MDS, for example), and wish to find a lower-rank version. In Euclidean space, one can get the optimal lower rank embedding by simply discarding components. However, this may not be the case in hyperbolic space. Motivated by this, we study dimensionality reduction in hyperbolic space.\nAs hyperbolic space does not have a linear subspace structure like Euclidean space, we need to define what we mean by lower-dimensional. We follow Principal Geodesic Analysis [12], [17]. Consider an initial embedding with points x1, . . . , xn ∈ H2 and let dH : H2 ×H2 → R+ be the hyperbolic distance. Suppose we want to map this embedding onto a one-dimensional subspace. (Note that we are considering a two-dimensional embedding and one-dimensional subspace here for simplicity, and these results immediately extend to higher dimensions.) In this case, the goal of PGA is to find a geodesic γ : [0, 1]→ H2 that passes through the mean of the points and that minimizes the squared error (or variance):\nf(γ) = n∑ i=1 min t∈[0,1] dH(γ(t), xi) 2.\nThis expression can be simplified significantly and reduced to a minimization in Euclidean space. First, we find the mean of the points, the point x̄ which minimizes ∑n i=1 dH(x̄, xi)\n2; this definition in terms of distances generalizes the mean in Euclidean space.5 Next, we reflect all the points xi so that their mean is 0 in the Poincaré disk model; we\n5As we noted earlier, considering the distances without squares leads to a non-continuously-differentiable formulation.\ncan do this using a circle inversion that maps x̄ onto 0. In the Poincaré disk model, a geodesic through the origin is a Euclidean line, and the action of the reflection across this line is the same in both Euclidean and hyperbolic space. Coupled with the fact that reflections are isometric, if γ is a line through 0 and Rγ is the reflection across γ, we have\ndH(γ, x) = min t∈[0,1]\ndH(γ(t), x) = 1\n2 dH(Rlx, x).\nCombining this with the Euclidean reflection formula and the hyperbolic metric produces\nf(γ) = 1\n4 n∑ i=1 acosh2 ( 1 + 8dE(γ, xi) 2 (1− ‖xi‖2)2 ) ,\nin which dE is the Euclidean distance from a point to a line. If we define wi = √\n8xi/(1− ‖xi‖2) this reduces to the simplified expression\nf(γ) = 1\n4 n∑ i=1 acosh2 ( 1 + dE(γ,wi) 2 ) .\nNotice that the loss function is not convex. We observe that there can be multiple local minima that are attractive and stable, in contrast to PCA. Figure 3 illustrates this nonconvexity on a simple dataset in H2 with only four examples. This makes globally optimizing the objective difficult.\nNevertheless, there will always be a region Ω containing a global optimum γ∗ that is convex and admits an efficient projection, and where f is convex when restricted to Ω. Thus it is possible to build a gradient descent-based algorithm to recover lower-dimensional subspaces: for example, we built a simple optimizer in PyTorch. We also give a sufficient condition on the data for f above to be convex. Lemma 4.3. For hyperbolic PGA if for all i,\nacosh2 ( 1 + dE(γ,wi) 2 ) < min ( 1, 1\n3 ‖wi‖2 ) then f is locally convex at γ.\nAs a result, if we initialize in and optimize over a region that contains γ∗ and where the condition of Lemma 4.3 holds, then gradient descent will be guaranteed to converge to γ∗. We can turn this result around and read it as a recovery result: if the noise is bounded in this regime, then we are able to provably recover the correct low-dimensional embedding."
        },
        {
            "heading": "5 Experiments",
            "text": "We evaluate the proposed approaches and compare against existing methods. We hypothesize that for tree-like data, the combinatorial construction offers the best performance. For general data, we expect h-MDS to produce the lowest\ndistortion, while it may have low MAP due to precision limitations. We anticipate that dimension is a critical factor (outside of the combinatorial construction). Finally, we expect that the MAP of h-MDS techniques can be improved by learning the correct scale and weighting the loss function as suggested in earlier sections. In the Appendix, we report on additional datasets, parameters found by the combinatorial construction, and the effect of hyperparameters.\nDatasets We consider trees, tree-like hierarchies, and graphs that are not tree-like. First, we consider hierarchies that form trees: fully-balanced trees along with phylogenetic trees expressing genetic heritage (of mosses growing in urban environments [16], available from [31]). Similarly, we used hierarchies that are nearly tree-like: WordNet hypernym (the largest connected component from Nickel and Kiela [28]) and a graph of Ph.D. advisor-advisee relationships [10]. Also included are datasets that vary in their tree nearness, such as biological sets involving disease relationships [14] and protein interactions in yeast bacteria [20], both available from [30]. We also include the collaboration network formed by authorship relations for papers submitted to the general relativity and quantum cosmology (Gr-QC) arXiv [26].\nApproaches Combinatorial embeddings into H2 are done using Steiner trees generated from a randomly selected root for the ε = 0.1 precision setting; others are considered in the Appendix. We performed h-MDS in floating point precision. We also include results for our PyTorch implementation of an SGD-based algorithm (described later), as well as a warm start version initialized with the high-dimensional combinatorial construction. We compare against classical MDS (i.e., PCA), and the optimization-based approach Nickel and Kiela [28], which we call FB. The experiments for h-MDS, PyTorch SGD, PCA, and FB used dimensions of 2,5,10,50,100,200; we recorded the best resulting MAP and distortion. Due to the large scale, we did not replicate the best FB numbers on large graphs (i.e., Gr-QC and WordNet). As a result, we report their best published MAP numbers for comparison (their work does not report distortion). These\nentries are marked with an asterisk. For the WordNet graph we use a random BFS tree rather than a Steiner tree. Moreover, for comparison against FB (which computes the transitive closure), we can use a weighted version of the graph that captures the ancestor relationships. The full details are in Appendix.\nQuality In Table 3, we report the distortion. As expected, when the graph is a tree or tree-like the combinatorial construction has exceedingly low distortion. Because h-MDS is meant to recover points exactly, we hypothesized that h-MDS would offer very low distortion on these datasets. We confirm this hypothesis: among h-MDS, PCA, and FB, h-MDS consistently offers the best (lowest) distortion, producing, for example, a distortion of 0.039 on the phylogenetic tree dataset. We observe that the optimization-based approach works quite well for reducing distortion, and on tree-like datasets it is bolstered by appropriate initialization from the combinatorial construction.\nTable 4 reports the MAP measure (this is shown in Table 2 for WordNet), which is a local measure. We expect that the combinatorial construction performs well for tree-like hierarchies. This is indeed the case: on trees and tree-like graphs, the MAP is close to 1, improving on approaches such as FB that rely on optimization. On larger graphs like WordNet, our approach yields a MAP of 0.989–improving on the FB MAP result of 0.870 at 200 dimensions. This is exciting because the combinatorial approach is deterministic and linear-time. In addition, it suggests that this refined understanding of hyperbolic embeddings may be used to improve the quality and runtime state of the art constructions. As expected, the MAP of the combinatorial construction decreases as the graphs are less tree-like. Interestingly, h-MDS solved in floating point indeed struggles with MAP. We separately confirmed that it is indeed due to precision using a high-precision solver, which obtains a perfect MAP—but uses 512 bits of precision. It may be possible to compensate for this with scaling, but we did not explore this possibility.\nSGD-Based Algorithm We also built an SGD-based algorithm implemented in PyTorch. Here the loss function is equivalent to the PGA loss, and so is continuously differentiable. We use this to verify two claims:\nLearned Scale. In Table 5, we verify the importance of scaling that our analysis suggests; our implementation has a simple learned scale parameter. Moreover, we added an exponential weighting to the distances in order to penalize long paths, thus improving the local reconstruction. These techniques indeed improve the MAP; in particular, the learned scale provides a better MAP at lower rank. We hope these techniques can be useful in other embedding techniques.\nIncomplete Information. To evaluate our algorithm’s ability to deal with incomplete information, we examine the quality of recovered solutions as we sample the distance matrix. We set the sampling rate of non-edges to edges at 10 : 1 following Nickel and Kiela [28]. We examine the phylogenetic tree, which is full rank in Euclidean space. In Figure 4, we are able to recover a good solution with a small fraction of the entries for the phylogenetic tree dataset; for example, we sampled approximately 4% of the graph but provide a MAP of 0.74 and distortion of less than 0.6. Understanding the sample complexity for this problem is an interesting theoretical question."
        },
        {
            "heading": "6 Conclusion and Future Work",
            "text": "Hyperbolic embeddings embed hierarchical information with high fidelity and few dimensions. We explored the limits of this approach by describing scalable, high quality algorithms. We hope the techniques here encourage more follow-on work on the exciting techniques of Chamberlain et al. [5], Nickel and Kiela [28]. As future work, we hope to explore how hyperbolic embeddings can be most effectively incorporated into downstream tasks and applications."
        },
        {
            "heading": "A Glossary of Symbols",
            "text": ""
        },
        {
            "heading": "B Related Work",
            "text": "Our study of representation tradeoffs for hyperbolic embeddings was motivated by exciting recent approaches towards such embeddings in Nickel and Kiela [28] and Chamberlain et al. [5]. Earlier efforts proposed using hyperbolic spaces for routing, starting with Kleinberg’s work on geographic routing [22]. Cvetkovski and Crovella [8] performed hyperbolic embeddings and routing for dynamic networks. Recognizing that the use of hyperbolic space for routing required a large number of bits to store the vertex coordinates, Eppstein and Goodrich [11] introduced a scheme for succinct embedding and routing in the hyperbolic plane. Another very recent effort also proposes using hyperbolic cones (similar to the cones that are the fundamental building block used in Sarkar [32] and our work) as a heuristic for embedding entailment relations, i.e. directed acyclic graphs [13]. The authors also propose to optimize on the hyperbolic manifold using its exponential map, as opposed to our approach of finding a closed form for the embedding should it exist (Section 4). An interesting avenue for future work is to compare both optimization methods empirically and theoretically, i.e., to understand the types of recovery guarantees under noise that such methods have.\nThere have been previous efforts to perform multidimensional scaling in hyperbolic space (the h-MDS problem), often in the context of visualization [25]. Most propose descent methods in hyperbolic space (e.g. [9], [37]) and fundamentally\ndiffer from ours. Arguably the most relevant is Wilson et al. [38], which mentions exact recovery as an intermediate result, but ultimately suggests a heuristic optimization. Our h-MDS analysis characterizes the recovered embedding and manifold and obtains the correctly centered one—a key issue in MDS. For example, this allows us to properly find the components of maximal variation. Furthermore, we discuss robustness to noise and produce optimization guarantees when a perfect embedding doesn’t exist.\nSeveral papers have studied the notion of hyperbolicity of networks, starting with the seminal work on hyperbolic graphs Gromov [15]. More recently, Chen et al. [6] considered the hyperbolicity of small world graphs and tree-like random graphs. Abu-Ata and Dragan [1] performed a survey that examines how well real-world networks can be approximated by trees using a variety of tree measures and tree embedding algorithms. To motivate their study of tree metrics, I. Abraham et al. [18] computed a measure of tree likeness on a Internet infrastructure network.\nWe use matrix completion (closure) to perform embeddings with incomplete data. Matrix completion is a celebrated problem. Candes and Tao [4] derive bounds on the minimum number of entries needed for completion for a fixed rank matrix; they also introduce a convex program for matrix completion operating at near the optimal rate.\nPrincipal geodesic analysis (PGA) generalizes principal components analysis (PCA) for the manifold setting. It was introduced and applied to shape analysis in [12] and extended to a probabilistic setting in [39]. There are other variants; the geodesic principal components analysis (GPCA) of Huckemann et al. [17] uses our loss function."
        },
        {
            "heading": "C Low-Level Formulation Details",
            "text": "We plan to release our PyTorch code, high precision solver, and other routines on Github. A few comments are helpful to understand the reformulation. In particular, we simply minimize the squared hyperbolic distance with a learned scale parameter, τ , e.g., :\nmin x1,...,xn,τ ∑ 1≤i<j≤n (τdH(xi, xj)− di,j)2\nWe typically require that τ ≥ 0.1.\n• On continuity of the derivative of the loss: Note that\n∂xacosh(1 + x) = 1√\n(1 + x)2 − 1 = 1√ x(x+ 2) hence lim x→0 ∂xacosh(1 + x) =∞.\nThus, limy→x ∂xdH(x, y) =∞. In particular, if two points happen to get near to one another during execution, gradient-based optimization becomes unstable. Note that exp{acosh(1 + x)} suffers from a similar issue, and is used in both [5, 28]. This change may increase numerical instability, and the public code for these approaches does indeed take steps like masking out updates to mitigate NANs. In contrast, the following may be more stable:\n∂xacosh(1 + x) 2 = 2 acosh(1 + x)√ x(x+ 2) and in particular lim x→0 ∂xacosh(1 + x) 2 = 2\nThe limits follows by simply applying L’Hopital’s rule. In turn, this implies the square formulation is continuously differentiable. Note that it is not convex.\n• One challenge is to make sure the gradient computed by PyTorch has the appropriate curvature correction (the Riemannian metric), as is well explained by Nickel and Kiela [28]. The modification is straightforward: we create a subclass of NN.PARAMETER called HYPERBOLIC PARAMETER. This wrapper class allows us to walk the tree to apply the appropriate correction to the metric (which amounts to multiplying∇wf(w) by 14 (1− ‖w‖\n2)2. After calling the BACKWARD function, we call a routine to walk the autodiff tree to find such parameters and correct them. This allows HYPERBOLIC PARAMETER and traditional parameters to be freely mixed.\n• We project back on the hypercube following Nickel and Kiela [28] and use gradient clipping with bounds of [−105, 105]. This allows larger batch sizes to more fully utilize the GPU."
        },
        {
            "heading": "D Combinatorial Construction Proofs",
            "text": "Precision vs. model We first provide a simple justification of the fact (used in Section 3.2) that representing distances d requires about d bits in hyperbolic space – independent of the model of the space. Formally, we show that the number of bits needed to represent a space depends only on the maximal and minimal desired distances and the geometry of the space. Thus although the bulk of our results are presented in the Poincaré sphere, our discussion on precision tradeoffs is fundamental to hyperbolic space.\nA representation using b bits can distinguish 2b distinct points in a space S. Suppose we wish to capture distances up to d with error tolerance ε – concretely, say every point in the ball B(0, d) must be within distance ε of a represented point. By a sphere covering argument, this requires at least VS(d)VS(ε) points to be represented, where VS(r) is the volume of a ball of radius r in the geometry. Thus at least b = log VS(d)VS(ε) bits are needed for the representation. Notice that VE(d) ∼ dn in Euclidean Rn space, so this gives the correct bit complexity of n log(d/ε). In hyperbolic space, VH is exponential instead of polynomial in d, so O(d) bits are needed in the representation (for any constant tolerance). In particular, this is independent of the model of the space.\nGraph embedding lower bound Now, we derive a lower bound on the bits of precision required for embedding a graph into H2. Afterwards we prove a result bounding the precision for our extension of Sarkar’s construction for the r-dimensional Poincaré ball Hr. Finally, we give some details on the algorithm for this extension.\nWe derive the lower bound by exhibiting an explicit graph and lower bounding the precision needed to represent its nodes (for any embedding of the graph into H2). The explicit graphGm we consider consists of a root node with degmax chains attached to it. Each of these chains has m nodes for a total of 1 +m(degmax) nodes, as shown in Figure 5. Lemma D.1. The bits of precision needed to embed a graph with longest path ` is Ω ( ` ε log(degmax) ) .\nProof. We first consider the case wherem = 1. ThenG1 is a star with 1+degmax children a1, a2, . . . , adegmax . Without loss of generality, we can place the root a0 at the origin 0.\nLet xi = f(ai) be the embedding into H2 for vertex ai for 0 ≤ i ≤ degmax. We begin by showing that the distortion does not increase if we equalize the distances between the origin and each child xi. Let us write `max = maxi dH(0, xi) and `min = mini dH(0, xi).\nWhat is the worst-case distortion? We must consider the maximal expansion and the maximal contraction of graph distances. Our graph distances are either 1 or 2, corresponding to edges (a0 to ai) and paths of length 2 (ai to a0 to aj). By triangle inequality, dH(xi,xj) 2 ≤ dH(0,xi) 2 + dH(0,xj) 2 ≤ `max. This implies that the maximal expansion maxi 6=j dH(f(ai), f(aj))/dG(ai, aj) is `max1 = `max occuring at a parent-child edge. Similarly, the maximal\ncontraction is at least 1`min . With this,\nDwc(f) ≥ `max `min .\nEqualizing the origin-to-child distances (that is, taking `max = `min) reduces the distortion. Moreover, these distances are a function of the norms ‖xi‖, so we set ‖xi‖ = v for each child.\nNext, observe that since there are degmax children to place, there exists a pair of children x, y so that the angle formed by x, 0, y is no larger than θ = 2πdegmax . In order to get a worst-case distortion of 1 + ε, we need the product of the maximum expansion and maximum contraction to be no more than 1 + ε. The maximum expansion is simply dH(0, x) while the maximum contraction is 2dH(x,y) , so we wan\n2dH(0, x) ≤ (1 + ε)dH(x, y).\nWe use the log-based expressions for hyperbolic distance:\ndH(0, x) = log\n( 1 + v\n1− v\n) ,\nand\ndH(x, y) = 2 log\n( ‖x− y‖+ √ ‖x‖2‖y‖2 − 2〈x, y〉+ 1√\n(1− ‖x‖2)(1− ‖y‖2)\n)\n= 2 log\n(√ 2v2(1− cos θ) + √ v4 − 2v2 cos θ + 1\n1− v2\n) .\nThis leaves us with\nlog\n(√ 2v2(1− cos θ) + √ v4 − 2v2 cos θ + 1\n1− v2\n) (1 + ε) ≥ log ( 1 + v\n1− v\n) .\nNow, since 1 > v2, we have that √ 2(1− cos θ) ≥ √ 2v2(1− cos θ). Some algebra shows that √\n3(1− cos θ) ≥√ v4 − 2v2 cos θ + 1, so that we can upper bound the left-hand side to write\nlog\n (1 + √ 3 2 ) √\n2(1− cos θ) 1− v2  (1 + ε) ≥ log(1 + v 1− v ) .\nNext we use the small angle approximation cos(θ) = 1− θ2/2 to get √ 2(1− cos θ) = θ. Now we have\nlog\n (1 + √ 3 2 )θ\n1− v2  (1 + ε) ≥ log(1 + v 1− v ) .\nSince v < 1, 11−v > 1 1−v2 and 1+v 1−v ≥ 1 1−v , so we can upper bound the left-hand side and lower bound the right-hand side:\nlog\n (1 + √ 3 2 )θ\n1− v  (1 + ε) ≥ log( 1 1− v ) .\nRearranging,\n− log(1− v) ≥ − log (( 1 + √ 3\n2\n) θ ) 1 + ε\nε .\nRecall that θ = 2πdegmax . Then we have that\n− log(1− v) ≥ ( 1 + ε\nε\n)( log(degmax)− log((2 + √ 6)π) ) ,\nso that\n− log(1− v) = Ω ( 1\nε log(degmax)\n) .\nSince v = ‖x‖ = ‖y‖, − log(1− v) is precisely the required number of bits of precision, so we have our lower bound for the m = 1 case.\nNext we analyze the m > 1 case. Consider the embedded vertices x1, x2, . . . , xm corresponding to one chain and y1, y2, . . . , ym corresponding to another. There exists a pair of chains such that the angle formed by xm, 0, y1 is at most θ = 2πdegmax . Let u = ‖xm‖ and v = ‖y1‖. From the m = 1 case, we have a lower bound on − log(1− v); we will now lower bound − log(1 − u). The worst-case distortion we consider uses the contraction given by the path xm → xm−1 → · · · → x1 → 0→ y1; this path has length m+ 1. The expansion is just the edge between 0 and y1. Then, to satisfy the worst-case distortion 1 + ε, we need\n(m+ 1)dH(0, y1) ≤ (1 + ε)dH(xm, y1).\nUsing the hyperbolic distance formulas, we can rewrite this as\n2 log\n( ‖xm − y1‖+ √ ‖xm‖2‖y1‖2 − 2〈xm, y1〉+ 1√\n(1− ‖xm‖2)(1− ‖y1‖2)\n) (1 + ε) ≥ (m+ 1) log ( 1 + v\n1− v\n) ,\nor,\n2 log\n(√ u2 + v2 − 2uv cos θ +\n√ u2v2 − 2uv cos θ + 1√\n(1− u2)(1− v2)\n) (1 + ε) ≥ (m+ 1) log ( 1 + v\n1− v\n) .\nNext,\n2 log\n(√ u2 + v2 − 2uv cos θ +\n√ u2v2 − 2uv cos θ + 1√\n(1− u2)(1− v2)\n)\n≤ 2 log\n (1 + √ 3 2 )θ√\n(1− u2)(1− v2)\n = log  (1 + √ 3 2 ) 2θ2\n(1− u2)(1− v2)  ≤ log  (1 + √ 3 2 ) 2θ2\n(1− u)(1− v)  . In the first step, we used the same arguments as earlier. Applying this result and using 1+v1−v ≥ 1 1−v , we have\nlog\n (1 + √ 3 2 ) 2θ2\n(1− u)(1− v)  (1 + ε) ≥ (m+ 1) log( 1 1− v ) ,\nor,\nlog\n (1 + √ 3 2 ) 2θ2\n1− u\n (1 + ε) ≥ (m− ε) log( 1 1− v ) .\nNext we can apply the bound on − log(1− v).\nlog\n( 1\n1− u\n) ≥ − log ( (1 + √ 3\n2 )2θ2\n) + ( m− ε 1 + ε ) log ( 1 1− v )\n≥ − log ( (1 + √ 3\n2 )2θ2\n) + ( m− ε 1 + ε )( 1 + ε ε )( log(degmax)− log((2 + √ 6)π) ) )\n= ( m− ε ε ) log(degmax)− ( m− ε ε ) log((2 + √ 6)π)− 1 2 ( log(degmax)− log((2 + √ 6)π) ) .\nHere, we applied the relationship between θ and degmax we derived earlier. To conclude, note that the longest path in our graph is ` = 2m. Then, we have that\n− log(1− u) = Ω ( `\nε log(degmax)\n) ,\nas desired.\nCombinatorial construction upper bounds Next, we prove our extension of Sarkar’s construction for Hr, restated below.\nProposition 3.1. The generalized Hr combinatorial construction has distortion at most 1 + ε and requires at most O( 1ε ` r log degmax) bits to represent a node component for r ≤ (log degmax)+1, andO( 1 ε `) bits for r > (log degmax)+ 1.\nProof. The combinatorial construction achieves worst-case distortion bounded by 1 + ε in two steps [32]. First, it is necessary to scale the embedded edges by a factor of τ sufficiently large to enable each child of a parent node to be placed in a disjoint cone. Note that there will be a cone with angle α less than πdegmax . The connection between this angle and the scaling factor τ is governed by τ = − log(tanα/2). As expected, as degmax increases, α decreases, and the necessary scale τ increases.\nThis initial step provides a Delaunay embedding (and thus a MAP of 1.0), but perhaps not sufficient distortion. The second step is to further scale the points by a factor of 1+εε ; this ensures the distortion upper bound.\nOur generalization to the Poincaré ball of dimension r will modify the first step by showing that we can pack more children around a parent while maintaining the same angle. In other words, for a fixed number of children we can increase the angle between them, correspondingly decreasing the scale. We use the following generalization of cones for Hr, defined by the maximum angle α ∈ [0, π/2] between the axis and any point in the cone. Let coneC(X,Y, α) be the cone at pointX with axis ~XY and cone angle α: C(X,Y, α) = {Z ∈ Hr : 〈Z −X,Y −X〉 ≥ ‖Z −X‖‖Y −X‖ cosα} . We seek the maximum angle α for which degmax disjoint cones can be fit around a sphere.\nSupposing r − 1 ≤ log degmax, we use the following lower bound [19] on the number of unit vectors A(r, θ) that can be placed on the unit sphere of dimension r with pairwise angle at least θ:\nA(r, θ) ≥ (1 + o(1)) √ 2πr cos θ\n(sin θ)r−1 .\nConsider taking angle θ = asin(degmax − 1r−1 ).\nNote that\ndegmax − 1r−1 = exp log degmax − 1r−1 = exp ( − log d r − 1 ) ≤ 1/e,\nwhich implies that θ is bounded from above and cos θ is bounded from below. Therefore\ndegmax = 1 (sin θ)r−1 ≤ O(1) cos θ (sin θ)r−1 ≤ A(r, θ).\nSo it is possible to place degmax children around the sphere with pairwise angle θ, or equivalently place degmax disjoint cones with cone angle α = θ/2. Note the key difference compared to the two-dimensional case where α = πdegmax ; here we reduce the angle’s dependence on the degree by an exponent of 1r−1 .\nIt remains to compute the explicit scaling factor τ that this angle yields; recall that τ = − log(tanα/2) suffices [32]. We then have\nτ = − log(tan(θ/4)) = − log ( sin(θ/2)\n1 + cos(θ/2)\n) = log ( 1 + cos(θ/2)\nsin(θ/2) ) ≤ log ( 2\nsin(θ/2)\n) = log ( 4 cos(θ/2)\nsin θ ) ≤ log ( 4\ndegmax − 1r−1\n) = O ( 1\nr log degmax\n) .\nThis quantity tells us the scaling factor without considering distortion (the first step). To yield the 1 + ε distortion, we just increase the scaling by a factor of 1+εε . The longest distance in the graph is the longest path ` multiplied by this quantity.\nPutting it all together, for a tree with longest path `, maximum degree degmax and distortion at most 1 + ε, the components of the embedding require (using the fact that distances ‖d‖ require d bits),\nO\n( 1\nε\n` r log dmax ) bits per component. This big-O is with respect to degmax and any r ≤ log degmax +1.\nWhen r > log degmax +1, O ( 1 ε ` )\nis a trivial upper bound. Note that this cannot be improved asymptotically: As degmax grows, the minimum pairwise angle approaches π/2, 6 so that τ = Ω(1) irrespective of the dimension r.\nNext, we provide more details on the coding-theoretic child placement construction for r-dimensional embeddings. Recall that children are placed at the vertices of a hypercube inscribed into the unit hypersphere, with components in ±1√ r . These points are indexed by sequences a ∈ {0, 1}r so that\nxa =\n( (−1)a1√\nr , (−1)a2√ r , . . . , (−1)ar√ r\n) .\nThe Euclidean distance between xa and xb is a function of the Hamming distance dHamming(a, b) between a and b. The Euclidean distance is exactly 2 √\ndHamming(a,b) r . Therefore, we can control the distances between the children by selecting\na set of binary sequences with a prescribed minimum Hamming distance—a binary error-correcting code—and placing the children at the resulting hypercube vertices.\nWe introduce a small amount of terminology from coding theory. A binary code C is a set of sequences a ∈ {0, 1}r. A [r, k, h]2 code C is a binary linear code with length r (i.e., the sequences are of length r), size 2k (there are 2k sequences), and minimum Hamming distance h (the minimum Hamming distance between two distinct members of the code is h).\nThe Hadamard code C has parameters [2k, k, 2k−1]. If r = 2k is the dimension of the space, the Hamming distance between two members of C is at least 2k−1 = r/2. Then, the distance between two distinct vertices of the hypercube xa and xb is 2 √ r/2 r = 2 √ 1/2 = √ 2. Moreover, we can place up to 2k = r points at least at this distance.\nTo build intuition, consider placing children on the unit circle (r = 2) compared to the r = 128-dimensional unit sphere. For r = 2, we can place up to 4 points with pairwise distance at least √ 2. However, for r = 128, we can place up to 128 children while maintaining this distance.\n6Given points x1, . . . , xn on the unit sphere, 0 ≤ ‖ ∑ xi‖22 = n+ ∑ i6=j〈xi, xj〉 implies there is a pair such that xi · xj ≥ − 1\nn−1 , i.e. an angle bounded by cos−1(−1/(n− 1)).\nWe briefly describe a few more practical details. Note that the Hadamard code is parametrized by k. To place c+ 1 children, take k = dlog2(c+1)e. However, the desired dimension r′ of the embedding might be larger than the resulting code length r = 2k. We can deal with this by repeating the codeword. If there are r′ dimensions and r|r′, then the distance between the resulting vertices is still at least √ 2. Also, recall that when placing children, the parent node has already been placed. Therefore, we perform the placement using the hypercube, and rotate the hypersphere so that one of the c+ 1 placed nodes is located at this parent.\nEmbedding the ancestor transitive closure Prior work embeds the transitive closure of the WordNet noun hypernym graph [28]. Here, edges are placed between each word and its hypernym ancestors; MAP is computed over edges of the form (word, hypernym), or, equivalently, edges (a, b) where b ∈ A(a) is an ancestor of a.\nIn this section, we show how to achieve arbitrarily good MAP on these types of transitive closures of a tree by embedding a weighted version of the tree (which we can do using the combinatorial construction with arbitrarily low distortion for any number dimensions). The weights are simply selected to ensure that nodes are always nearer to their ancestors than to any other node.\nLet T = (V,E) be our original graph. We recursively produce a weighted version of the graph called T ′ that satisfies the desired property. Let s be the depth of node a ∈ V . We weight each of the edges (a, c), where c is a child of a with weight 2s. Now we show the following property: Proposition D.2. Let b ∈ A(a) be an ancestor of a and e 6∈ A(a) be some node not an ancestor of a. Then,\ndG(a, b) < dG(a, e).\nProof. Let a be at depth s. First, the farthest ancestor from a is the root, at distance 2s−1 + 2s−2 + . . .+ 2 + 1 = 2s−1. Thus dG(a, b) ≤ 2s − 1.\nIf e is a descendant of a, then dG(a, e) is at least 2s Next, if e is neither a descendant nor an ancestor of a, let f be their nearest common ancestor, and let the depths of a, e, f be s, s2, s3, respectively, where s3 < min{s1, s2}. We have that\ndG(a, e) = (2 s−1 + . . .+ 2s3) + (2s2−1 + . . .+ 2s3)\n= 2s − 2s3 + 2s2 − 2s3\n= 2s + 2s2 − 2s3+1\n≥ 2s\n> dG(a, b).\nThe fourth line follows from s2 > s3. This concludes the argument.\nTherefore, embedding the weighted tree T ′ with the combinatorial construction enables us to keep all of a word’s ancestors nearer to it than any other word. This enables us to embed a transitive closure hierarchy (like WordNet’s) while still embedding a nearly tree-like graph. 7 Furthermore, the desirable properties of the construction still carry through (perfect MAP on trees, linear-time, etc)."
        },
        {
            "heading": "E Proof of h-MDS Results",
            "text": "We first prove the condition that XTu = 0 is equivalent to pseudo-Euclidean centering.\n7Note that further separation can be achieved by picking weights with a base larger than 2.\nProof of Lemma 4.1. In the hyperboloid model, the variance term Ψ can be written as\nΨ(z;x1, x2, . . . , xn) = k∑ i=1 sinh2(dH(xi, z))\n= k∑ i=1 ( cosh2(dH(xi, z))− 1 ) =\nk∑ i=1 ( (xTi Qz) 2 − 1 )\n= k∑ i=1 ( (x0,iz0 − ~xTi ~z)2 − 1 ) =\nk∑ i=1 (( x0,i √ 1 + ‖~z‖2 − ~xTi ~z )2 − 1 ) .\nThe derivative of this with respect to ~z is\n∇~zΨ(z;x1, x2, . . . , xn) = 2 k∑ i=1 ( x0,i √ 1 + ‖~z‖2 − ~xTi ~z )( x0,i ~z√ 1 + ‖~z‖2 − ~xi ) .\nAt ~z = 0 (or equivalently z = e0), this becomes\n∇~zΨ(z;x1, x2, . . . , xn)|~z=0 = 2 k∑ i=1 ( x0,i √ 1 + 0− 0 )( x0,i 0√ 1 + 0 − ~xi )\n= −2 k∑ i=1 x0,i~xi.\nIf we define the matrix X ∈ Rn×k such that XT ei = ~xi and the vector u ∈ Rk such that ui = x0,i, then\n∇~zΨ(z;x1, x2, . . . , xn)|~z=0 = −2 k∑ i=1 XT eie T i u\n= −2XTu.\nCentering and Geodesic Submanifolds A well-known property of the hyperboloid model is that the geodesic submanifolds on Mr are exactly the linear subspaces of Rr+1 intersected with the hyperboloid model (Corollary A.5.5. from [2]). This is analogous to how the affine subspaces of Rr are the linear subspaces of Rr+1 intersected with the homogeneous-coordinates model of Rr. Notice that this directly implies that any geodesic submanifold can be written as a geodesic submanifold centered on any of the points in that manifold. To be explicit with the definitions: Definition E.1. A geodesic submanifold is a subset S of a manifold such that for any two points x, y ∈ S, the geodesic from x to y is fully contained within S. Definition E.2. A geodesic submanifold rooted at a point x, given some local subspace of its tangent bundle T , is the subset S of the manifold that is the union of all the geodesics through x that are tangent at x in a direction contained in T .\nNow we prove that centering with the pseudo-Euclidean mean preserves geodesic submanifolds.\nFirst, we need the following technical lemma showing that projection to a manifold decreases distances. Lemma E.3. Consider a dimension-r geodesic submanifold S and point x̄ outside of it. Let z be the projection of x̄ onto S. Then for any point x ∈ S, dH(x, x̄) > dH(x, z).\nProof. As a consequence of the projection, the points x, z, x̄ form a right angle. From the hyperbolic Pythagorean theorem, we know that\ncosh(dH(x, x̄)) = cosh(dH(x, z)) cosh(dH(z, x̄)).\nSince cosh is increasing and at least 1 (with equality only at cosh(0) = 1), this implies that\ndH(x, x̄) > dH(x, z).\nLemma E.4. If some points x1, . . . , xk lie in a dimension-r geodesic submanifold S, then both a Karcher mean and a pseudo-Euclidean mean lie in this submanifold. Equivalently, if the points lie in a submanifold, then this submanifold can be written as centered at the Karcher mean or the pseudo-Euclidean mean.\nProof. Suppose by way of contradiction that there is a Karcher mean x̄ that lies outside this submanifold S. Then, consider the projection z of x̄ onto S. From Lemma E.3, projecting onto S has strictly decreased the distance to all the points on S.\nAs a result, the Frechet variance k∑ i=1 d2H(xi, x̄)\nalso decreases when x̄ is projected onto S. From this, it follows that there is a minimum value of the Frechet variance (a Karcher mean) that lies on S. An identical argument works for the pseudo-Euclidean distance, since the pseudo-Euclidean distance uses a variance that is just the sum of monotonically increasing functions of the hyperbolic distance.\nLemma E.5. Given some pairwise distances di,j , if it is possible to embed the distances in a dimension-r geodesic submanifold rooted and centered at a pseudo-Euclidean mean, then it is possible to embed the distances in a dimension-r geodesic submanifold rooted and centered at a Karcher mean, and vice versa.\nProof. Suppose that it is possible to embed the distances as some points x1, . . . , xk in a dimension-r geodesic submanifold S. Then, by Lemma E.4, S contains both a Karcher mean x̄ and a pseudo-Euclidean mean x̄P of these points. If we reflect all the points such that x̄ is reflected to the origin, then the new reflected points will also be an embedding of the distances (since reflection is isometric) and they will also be centered at the origin. Furthermore, we know that they will still lie in a dimension-r submanifold (now containing the origin) since reflection also preserves the dimension of geodesic submanifolds. So the reflected points that we have constructed are an embedding of di,j into a dimension-r geodesic submanifold rooted and centered at a Karcher mean. The same argument will show that (by reflecting x̄P to the origin instead of x̄) we can construct an embedding of di,j into a dimension-r geodesic submanifold rooted and centered at the pseudo-Euclidean mean. This proves the lemma."
        },
        {
            "heading": "F Perturbation Analysis",
            "text": "F.1 Handling Perturbations\nNow that we have shown that h-MDS recovers an embedding exactly, we consider the impact of perturbations on the data. Given the necessity of high precision for some embeddings, we expect that in some regimes the algorithm should be very sensitive. Our results identify the scaling of those perturbations.\nFirst, we consider how to measure the effect of a perturbation on the resulting embedding. We measure the gap between two configurations of points, written as matrices in Rn×r, by the sum of squared differences D(X,Y ) = trace((X−Y )T (X−Y )). Of course, this is not immediately useful, since X and Y can be rotated or reflected without affecting the distance matrix used for MDS–as these are isometries, while scalings and Euclidean translations are not. Instead, we measure the gap by\nDE(X,Y ) = inf{D(X,PY ) : PTP = I}.\nIn other words, we look for the configuration of Y with the smallest gap relative to X . For Euclidean MDS, Sibson [33] provides an explicit formula for DE(X,Y ) and uses this formulation to build a perturbation analysis for the case where Y is a configuration recovered by performing MDS on the perturbed matrix XXT + ∆(E), with ∆(E) symmetric.\nProblem setup In our case, the perturbations affect the hyperbolic distances. Let H ∈ Rn×n be the distance matrix for a set of points in hyperbolic space. Let ∆(H) ∈ Rn×n be the perturbation, with Hi,i = 0 and ∆(H) symmetric (so that Ĥ = H + ∆H remains symmetric). The goal of our analysis is to estimate the gap DE(X,Y ) between X recovered from H with h-MDS and X̂ recovered from the perturbed distances H + ∆(H). Lemma F.1. Under the above conditions, if λmin denotes the smallest nonzero eigenvalue of XXT then up to second order in ∆(H),\nDE(X, X̂) ≤ 2n2\nλmin sinh2 (‖H‖∞) ‖∆(H)‖2∞.\nThe key takeaway is that this upperbound matches our intuition for the scaling: if all points are close to one another, then ‖H‖∞ is small and the space is approximately flat (since sinh2(z) is dominated by 2z2 close to the origin). On the other hand, points at great distance are sensitive to perturbations in an absolute sense.\nProof of Lemma F.1. Similarly to our development of h-MDS, we proceed by accessing the underlying Euclidean distance matrix, and then apply the perturbation analysis from Sibson [34]. There are three steps: first, we get rid of the acosh in the distances to leave us with scaled Euclidean distances. Next, we remove the scaling factors, and apply Sibson’s result. Finally, we bound the gap when projecting to the Poincaré sphere.\nHyperbolic to scaled Euclidean distortion Let Y denote the scaled-Euclidean distance matrix, as in (1), so that Yi,j = cosh(Hi,j). Let Ŷi,j = cosh(Hi,j + ∆(H)i,j). We write ∆(Y ) = Ŷ − Y for the scaled Euclidean version of the perturbation. We can use the hyperbolic-cosine difference formula on each term to write\n∆(Y )i,j = cosh(Ĥi,j)− cosh(Hi,j) = (cosh(Hi,j + ∆(H)i,j)− cosh(Hi,j))\n= 2 sinh\n( 2Hi,j + ∆(H)i,j\n2\n) sinh ( ∆(H)i,j\n2\n) .\nIn terms of the infinity norm, as long as ‖H‖∞ ≥ ‖∆(H)‖∞ (it is fine to assume this because we are only deriving a bound up to second order, so we can suppose that ∆(H) is small), we can simplify this to\n‖∆(Y )‖∞ ≤ 2 sinh (‖H‖∞) sinh (‖∆(H)‖∞/2) .\nScaled Euclidean to Euclidean inner product. Recall that if X is the embedding in the hyperboloid model, then Y = uuT −XXT from equation (2), and furthermore XTu = 0 so that X can be recovered through PCA. Now we are in the Euclidean setting, and can thus measure the result of the perturbation on the recovered X . The proof of Theorem 4.1 in Sibson [34] transfers to this setting. This result states that if X̂ is the configuration recovered from the perturbed inner products, then, the lowest-order term of the expansion of the error DE(X, X̂) in the perturbation ∆(Y ) is\nDE(X, X̂) = 1\n2 ∑ j,k (vTj ∆(Y )vk) 2 λj + λk .\nHere, the λi and vi are the eigenvalues and corresponding orthonormal eigenvectors of XXT and the sum is taken over pairs of λj , λk that are not both 0. Let λmin be the smallest nonzero eigenvalue of XXT . Then,\nDE(X, X̂) ≤ 1\n2λmin ∑ j,k (vTj ∆(Y )vk) 2 ≤ 1 2λmin ‖∆(Y )‖2F\n≤ n 2\n2λmin ‖∆(Y )‖2∞.\nCombining this with the previous bounds, and restricting to second-order terms in ‖∆(H)‖2∞ proves Lemma F.1 for the embedding X in the hyperboloid model.\nProjecting to the Poincaré disk Algorithm 2 initially finds an embedding in Mr, but optionally converts it to the Poincaré disk. To convert a point x in the hyperboloid model to z in the Poincaré disk, take z = x\n1+ √ 1+‖x‖22 . Let\nZ ∈ Rn×r be the projected embedding. Now we show that the same perturbation bound holds after projection. Lemma F.2. For any x and y, ∥∥∥∥ x1+√1+‖x‖22 − x1+√1+‖x‖22 ∥∥∥∥ ≤ ‖x− y‖ Proof. Let ux = √ 1 + ‖x‖2 and define uy analogously. Note that ux ≥ 2, ux ≥ ‖x‖, and\nuy − ux = u2y − u2x uy + ux = (‖y‖ − ‖x‖)‖y‖+ ‖x‖ uy + ux ≤ ‖y‖ − ‖x‖.\nCombining these facts leads to the bound∥∥∥∥∥ x1 +√1 + ‖x‖22 − y1 +√1 + ‖y‖22 ∥∥∥∥∥ = ∥∥∥∥x− y + xuy − yuy + yuy − yux(1 + ux)(1 + uy) ∥∥∥∥\n= ∥∥∥∥ (x− y)(1 + uy) + y(uy − ux)(1 + ux)(1 + uy) ∥∥∥∥\n= ∥∥∥∥ x− y1 + ux + y1 + uy uy − ux1 + ux ∥∥∥∥ ≤ ‖x− y‖ 1 + ux + ‖uy − ux‖\n1 + ux ≤ ‖x− y‖ .\nLemma F.2 is equivalent to the statement thatD(z, ẑ) ≤ D(x, x̂) where z, ẑ are the projections of x, x̂. Since orthogonal matrices P preserve `2 norm, P ẑ is the projection of Px̂ so D(z, P ẑ) ≤ D(x, P x̂) for any P . Finally, D(Z,P Ẑ) is just a sum over all columns and therefore D(Z,P Ẑ) ≤ D(X,PX̂). This implies that DE(Z, Ẑ) ≤ DE(X, X̂) as desired. The hyperbolic gap The gap D(X, X̂) can be written as a sum ∑ dE(xi, x̂i)\n2 over the vectors (columns) of X, X̂ . We can instead ask about the hyperbolic gap\nDH(X, X̂) = inf {∑ dH(xi, P x̂i) 2 : PTP = I } ,\nwhich is a better interpretation of the perturbation error when recovering hyperbolic distances.\nNote that for any points x, y in the Gans model, we have dH(x, y) = acosh (√ 1 + ‖x‖2 √ 1 + ‖y‖2 − 〈x, y〉 ) ≤ acosh ( 2 + ‖x‖2 + ‖y‖2\n2 − 〈x, y〉\n) = acosh ( 1 + 1\n2 ‖x− y‖2\n) .\nFurthermore, the function acosh(1 + t2/2)− t is always negative except in a tiny region around t = 0 (and attains a maximum here on the order of 10−10), so effectively acosh ( 1 + 12‖x− y‖ 2 ) ≤ ‖x − y‖ = dE(x, y), and the same bound in Lemma F.1 carries over to the hyperbolic gap."
        },
        {
            "heading": "G Proof of Lemma 4.3",
            "text": "In this section, we prove Lemma 4.3, which gives a setting under which we can guarantee that the hyperbolic PGA objective is locally convex.\nProof of Lemma 4.3. We begin by considering the component function\nfi(γ) = acosh 2(1 + d2E(γ, vi)).\nHere, the γ is a geodesic through the origin. We can identify this geodesic on the Poincaré disk with a unit vector u such that γ(t) = (2t− 1)u. In this case, simple Euclidean projection gives us\nd2E(γ, vi) = ‖(I − uuT )vi‖2.\nOptimizing over γ is equivalent to optimizing over u, and so fi(u) = acosh 2 ( 1 + ‖(I − uuT )vi‖2 ) .\nIf we define the functions h(γ) = acosh2(1 + γ)\nand R(u) = ‖(I − uuT )vi‖2 = ‖vi‖2 − (uT vi)2\nthen we can rewrite fi as fi(u) = h(R(u)).\nNow, optimizing over u is an geodesic optimization problem on the hypersphere. Every goedesic on the hypersphere can be isometrically parameterized in terms of an angle θ as\nu(θ) = x cos(θ) + y sin(θ)\nfor orthogonal unit vectors x and y. Without loss of generality, suppose that yT vi = 0 (we can always choose such a y because there will always be some point on the geodesic that is orthogonal to vi). Then, we can write\nR(θ) = ‖vi‖2 − (xT vi)2 cos2(θ) = ‖vi‖2 − (xT vi)2 + (xT vi)2 sin2(θ).\nDifferentiating the objective with respect to θ,\nd\ndθ h(R(θ)) = h′(R(θ))R′(θ)\n= 2h′(R(θ)) · (vTi x)2 · sin(θ) cos(θ).\nDifferentiating again,\nd2\ndθ2 h(R(θ)) = 4h′′(R(θ)) · (vTi x)4 · sin2(θ) cos2(θ) + 2h′(R(θ)) · (vTi x)2 ·\n( cos2(θ)− sin2(θ) ) .\nNow, suppose that we are interested in the Hessian at a point z = x cos(θ) + y sin(θ) for some fixed angle θ. Here, R(θ) = R(z), and as always vTi z = v T i x cos(θ), so\nd2\ndθ2 h(R(θ))\n∣∣ u(θ)=z = 4h′′(R(θ)) · (vTi x)4 · sin2(θ) cos2(θ) + 2h′(R(θ)) · (vTi x)2 · ( cos2(θ)− sin2(θ) ) = 4h′′(R(z)) · (v T i z) 4\ncos4(θ) · sin2(θ) cos2(θ) + 2h′(R(z)) · (v\nT i x) 2 cos2(θ) · ( cos2(θ)− sin2(θ) ) = 4h′′(R(z)) · (vTi z)4 · tan2(θ) + 2h′(R(z)) · (vTi z)2 · ( 1− tan2(θ)\n) = 2h′(R(z)) · (vTi z)2 + ( 4h′′(R(z)) · (vTi z)4 − 2h′(R(z)) · (vTi z)2 ) tan2(θ).\nBut we know that since h is concave and increasing, this last expression in parenthesis must be negative. It follows that a lower bound on this expression for fixed z will be attained when tan2(θ) is maximized. For any geodesic through z, the angle θ is the distance along the geodesic to the point that is (angularly) closest to vi. By the Triangle inequality, this will be no greater than the distance θ along the Geodesic that connects z with the normalization of vi. On this worst-case geodesic,\nvTi z = ‖vi‖ cos(θ),\nand so\ncos2(θ) = (vTi z) 2\n‖vi‖2\nand\ntan2(θ) = sec2(θ)− 1 = ‖vi‖ 2 (vTi z) 2 − 1 = R(z) (vTi z) 2 .\nThus, for any geodesic, for the worst-case angle θ,\nd2\ndθ2 h(R(θ))\n∣∣ u(θ)=z ≥ 2h′(R(z)) · (vTi z)2 + ( 4h′′(R(z)) · (vTi z)4 − 2h′(R(z)) · (vTi z)2 ) tan2(θ)\n= 2h′(R(z)) · (vTi z)2 + ( 4h′′(R(z)) · (vTi z)2 − 2h′(R(z)) ) R(z).\nFrom here, it is clear that this lower bound on the second derivative (and as a consequence local convexity) is a function solely of the norm of vi and the residual to z. From simple evaluation, we can compute that\nh′(γ) = 2 acosh(1 + γ)√\nγ2 + 2γ\nand\nh′′(x) = 2\n√ γ2 + 2γ − (1 + γ) acosh(1 + γ)\n(γ2 + 2γ)3/2 .\nAs a result 4γh′′(γ) + h′(γ) = 8 γ √ γ2 + 2γ − (γ2 + γ) acosh(1 + γ)\n(γ2 + 2γ)3/2 + 2\n(γ2 + 2γ) acosh(1 + γ)\n(γ2 + 2γ)3/2 = 2 4γ √ γ2 + 2γ − 4(γ2 + γ) acosh(1 + γ) + (γ2 + 2γ) acosh(1 + γ)\n(γ2 + 2γ)3/2 = 2 4γ √ γ2 + 2γ − (3γ2 + 2γ) acosh(1 + γ)\n(γ2 + 2γ)3/2 .\nFor any γ that satisfies 0 ≤ γ ≤ 1, 4γ √ γ2 + 2γ ≥ (3γ2 + 2γ) acosh(1 + γ)\nand so 4γh′′(γ) + h′(γ) ≥ 0.\nThus, if 0 ≤ R(z) ≤ 1,\nd2\ndθ2 h(R(θ))\n∣∣ u(θ)=z ≥ 2h′(R(z)) · (vTi z)2 + ( 4h′′(R(z)) · (vTi z)2 − 2h′(R(z)) ) R(z)\n= h′(R(z)) · (vTi z)2 + (4h′′(R(z)) ·R(z) + h′(R(z))) · (vTi z)2 − 2h′(R(z)) ·R(z) ≥ h′(R(z)) · (vTi z)2 − 2h′(R(z)) ·R(z) = h′(R(z)) · ( ‖vi‖2 −R(z) ) − 2h′(R(z)) ·R(z)\n= h′(R(z)) · ( ‖vi‖2 − 3R(z) ) .\nThus, a sufficient condition for convexity is for (as we assumed above) R(z) ≤ 1 and\n‖vi‖2 ≥ 3R(z).\nCombining these together shows that if\nacosh2 ( 1 + dE(γ, vi) 2 ) = R(z) ≤ min ( 1, 1\n3 ‖vi‖2 ) then fi is locally convex at z. The result of the lemma now follows from the fact that f is the sum of many fi and the sum of convex functions is also convex."
        },
        {
            "heading": "H Experimental Results",
            "text": "In this section, we provide some additional experimental results. We also present results on an additional less tree-like graph (a search engine query response graph for the search term ‘California’ [21].)\nCombinatorial Construction: Parameters To improve the intuition behind the combinatorial construction, we report some additional parameters used by the construction. For each of the graphs, we report the maximum degree, the scaling factor ν that the construction used (note how these vary with the size of the graph and the maximal degree), the time it took to perform the embedding, in seconds, and the number of bits needed to store a component for ε = 0.1 and ε = 1.0.\nHyperparameter: Effect of Rank We also considered the influence of the dimension on the perfomance of hMDS, PCA, and FB. On the Phylogenetic tree dataset, we measured distortion and MAP metrics for dimensions of 2,5,10,50,100, and 200. The results are shown in Table 8. We expected all of the techniques to improve with better rank, and this was the case as well. Here, the optimization-based approach typically produces the best MAP, optimizing the fine details accurately. We observe that the gap is closed when considering 2-MAP (that is, MAP where the retrieved neighbors are at distance up to 2 away). In particular we see that the main limitation of h-MDS is at the finest layer, confirming the idea MAP is heavily influenced by local changes. In terms of distortion, we found that h-MDS offers good performance even at a very low dimension (0.083 at 5 dimensions).\nPrecision Experiment (cf Table 9). Finally, we considered the effect of precision on h-MDS for a balanced tree and fixed dimension 10."
        }
    ],
    "title": "Representation Tradeoffs for Hyperbolic Embeddings",
    "year": 2018
}