{
    "abstractText": "Representation learning has become an invaluable approach for learning from symbolic data such as text and graphs. However, while complex symbolic datasets often exhibit a latent hierarchical structure, state-of-the-art methods typically learn embeddings in Euclidean vector spaces, which do not account for this property. For this purpose, we introduce a new approach for learning hierarchical representations of symbolic data by embedding them into hyperbolic space – or more precisely into an n-dimensional Poincaré ball. Due to the underlying hyperbolic geometry, this allows us to learn parsimonious representations of symbolic data by simultaneously capturing hierarchy and similarity. We introduce an efficient algorithm to learn the embeddings based on Riemannian optimization and show experimentally that Poincaré embeddings outperform Euclidean embeddings significantly on data with latent hierarchies, both in terms of representation capacity and in terms of generalization ability.",
    "authors": [
        {
            "affiliations": [],
            "name": "Maximilian Nickel"
        }
    ],
    "id": "SP:6599ceebab0a3a1ca36e5aacba87af8ab25e7438",
    "references": [
        {
            "authors": [
                "Aaron B Adcock",
                "Blair D Sullivan",
                "Michael W Mahoney"
            ],
            "title": "Tree-like structure in large social and information networks",
            "venue": "In Data Mining (ICDM),",
            "year": 2013
        },
        {
            "authors": [
                "Shun-ichi Amari"
            ],
            "title": "Natural gradient works efficiently in learning",
            "venue": "Neural Computation,",
            "year": 1998
        },
        {
            "authors": [
                "M Boguñá",
                "F Papadopoulos",
                "D Krioukov"
            ],
            "title": "Sustaining the internet with hyperbolic mapping",
            "venue": "Nature communications,",
            "year": 2010
        },
        {
            "authors": [
                "Piotr Bojanowski",
                "Edouard Grave",
                "Armand Joulin",
                "Tomas Mikolov"
            ],
            "title": "Enriching word vectors with subword information",
            "venue": "arXiv preprint arXiv:1607.04606,",
            "year": 2016
        },
        {
            "authors": [
                "Silvere Bonnabel"
            ],
            "title": "Stochastic gradient descent on riemannian manifolds",
            "venue": "IEEE Trans. Automat. Contr.,",
            "year": 2013
        },
        {
            "authors": [
                "Antoine Bordes",
                "Nicolas Usunier",
                "Alberto García-Durán",
                "Jason Weston",
                "Oksana Yakhnenko"
            ],
            "title": "Translating embeddings for modeling multi-relational data",
            "venue": "In Advances in Neural Information Processing Systems",
            "year": 2013
        },
        {
            "authors": [
                "Guillaume Bouchard",
                "Sameer Singh",
                "Theo Trouillon"
            ],
            "title": "On approximate reasoning capabilities of low-rank vector spaces",
            "venue": "AAAI Spring Syposium on Knowledge Representation and Reasoning (KRR): Integrating Symbolic and Neural Approaches,",
            "year": 2015
        },
        {
            "authors": [
                "Aaron Clauset",
                "Cristopher Moore",
                "Mark EJ Newman"
            ],
            "title": "Hierarchical structure and the prediction of missing links",
            "venue": "in networks. Nature,",
            "year": 2008
        },
        {
            "authors": [
                "John Rupert Firth"
            ],
            "title": "A synopsis of linguistic theory, 1930-1955",
            "venue": "Studies in linguistic analysis,",
            "year": 1957
        },
        {
            "authors": [
                "Mikhael Gromov"
            ],
            "title": "Hyperbolic groups. In Essays in group theory, pages 75–263",
            "year": 1987
        },
        {
            "authors": [
                "Aditya Grover",
                "Jure Leskovec"
            ],
            "title": "node2vec: Scalable feature learning for networks",
            "venue": "In Proceedings of the 22nd ACM SIGKDD International Conference on Knowledge Discovery and Data Mining,",
            "year": 2016
        },
        {
            "authors": [
                "Peter D Hoff",
                "Adrian E Raftery",
                "Mark S Handcock"
            ],
            "title": "Latent space approaches to social network analysis",
            "venue": "Journal of the american Statistical association,",
            "year": 2002
        },
        {
            "authors": [
                "Douwe Kiela",
                "Laura Rimell",
                "Ivan Vulic",
                "Stephen Clark"
            ],
            "title": "Exploiting image generality for lexical entailment detection",
            "venue": "In Proceedings of the 53rd Annual Meeting of the Association for Computational Linguistics (ACL",
            "year": 2015
        },
        {
            "authors": [
                "Robert Kleinberg"
            ],
            "title": "Geographic routing using hyperbolic space",
            "venue": "IEEE International Conference on Computer Communications",
            "year": 2007
        },
        {
            "authors": [
                "Dmitri Krioukov",
                "Fragkiskos Papadopoulos",
                "Maksim Kitsak",
                "Amin Vahdat",
                "Marián"
            ],
            "title": "Boguná. Hyperbolic geometry of complex networks",
            "venue": "Physical Review E,",
            "year": 2010
        },
        {
            "authors": [
                "Tomas Mikolov",
                "Ilya Sutskever",
                "Kai Chen",
                "Greg Corrado",
                "Jeffrey Dean"
            ],
            "title": "Distributed representations of words and phrases and their compositionality",
            "venue": "CoRR, abs/1310.4546,",
            "year": 2013
        },
        {
            "authors": [
                "Maximilian Nickel",
                "Volker Tresp",
                "Hans-Peter Kriegel"
            ],
            "title": "A three-way model for collective learning on multi-relational data",
            "venue": "In Proceedings of the 28th International Conference on Machine Learning,",
            "year": 2011
        },
        {
            "authors": [
                "Maximilian Nickel",
                "Xueyan Jiang",
                "Volker Tresp"
            ],
            "title": "Reducing the rank in relational factorization models by including observable patterns",
            "venue": "In Advances in Neural Information Processing Systems",
            "year": 2014
        },
        {
            "authors": [
                "Maximilian Nickel",
                "Lorenzo Rosasco",
                "Tomaso A. Poggio"
            ],
            "title": "Holographic embeddings of knowledge graphs",
            "venue": "In Proceedings of the Thirtieth AAAI Conference on Artificial Intelligence,",
            "year": 2016
        },
        {
            "authors": [
                "Alberto Paccanaro",
                "Geoffrey E. Hinton"
            ],
            "title": "Learning distributed representations of concepts using linear relational embedding",
            "venue": "IEEE Trans. Knowl. Data Eng.,",
            "year": 2001
        },
        {
            "authors": [
                "Jeffrey Pennington",
                "Richard Socher",
                "Christopher D Manning"
            ],
            "title": "Glove: Global vectors for word representation",
            "venue": "In EMNLP,",
            "year": 2014
        },
        {
            "authors": [
                "Bryan Perozzi",
                "Rami Al-Rfou",
                "Steven Skiena"
            ],
            "title": "Deepwalk: Online learning of social representations",
            "venue": "In Proceedings of the 20th ACM SIGKDD international conference on Knowledge discovery and data mining,",
            "year": 2014
        },
        {
            "authors": [
                "Erzsébet Ravasz",
                "Albert-László Barabási"
            ],
            "title": "Hierarchical organization in complex networks",
            "venue": "Physical Review E,",
            "year": 2003
        },
        {
            "authors": [
                "Benjamin Recht",
                "Christopher Ré",
                "Stephen J. Wright",
                "Feng Niu"
            ],
            "title": "Hogwild: A lock-free approach to parallelizing stochastic gradient descent",
            "venue": "In Advances in Neural Information Processing Systems",
            "year": 2011
        },
        {
            "authors": [
                "Sebastian Riedel",
                "Limin Yao",
                "Andrew McCallum",
                "Benjamin M Marlin"
            ],
            "title": "Relation extraction with matrix factorization and universal schemas",
            "venue": "In Proceedings of NAACL-HLT,",
            "year": 2013
        },
        {
            "authors": [
                "Mark Steyvers",
                "Joshua B Tenenbaum"
            ],
            "title": "The large-scale structure of semantic networks: Statistical analyses and a model of semantic growth",
            "venue": "Cognitive science,",
            "year": 2005
        },
        {
            "authors": [
                "Théo Trouillon",
                "Johannes Welbl",
                "Sebastian Riedel",
                "Éric Gaussier",
                "Guillaume Bouchard"
            ],
            "title": "Complex embeddings for simple link prediction",
            "venue": "In Proceedings of the 33nd International Conference on Machine Learning,",
            "year": 2016
        },
        {
            "authors": [
                "Ivan Vendrov",
                "Ryan Kiros",
                "Sanja Fidler",
                "Raquel Urtasun"
            ],
            "title": "Order-embeddings of images and language",
            "venue": "arXiv preprint arXiv:1511.06361,",
            "year": 2015
        },
        {
            "authors": [
                "Luke Vilnis",
                "Andrew McCallum"
            ],
            "title": "Word representations via gaussian embedding",
            "venue": "In International Conference on Learning Representations (ICLR),",
            "year": 2015
        },
        {
            "authors": [
                "Ivan Vulić",
                "Daniela Gerz",
                "Douwe Kiela",
                "Felix Hill",
                "Anna Korhonen"
            ],
            "title": "Hyperlex: A large-scale evaluation of graded lexical entailment",
            "venue": "arXiv preprint arXiv:1608.02117,",
            "year": 2016
        },
        {
            "authors": [
                "Julie Weeds",
                "Daoud Clarke",
                "Jeremy Reffin",
                "David Weir",
                "Bill Keller"
            ],
            "title": "Learning to distinguish hypernyms and co-hyponyms",
            "venue": "In Proceedings of the 25th International Conference on Computational Linguistics COLING,",
            "year": 2014
        },
        {
            "authors": [
                "Hongyi Zhang",
                "Sashank J. Reddi",
                "Suvrit Sra"
            ],
            "title": "Riemannian SVRG: fast stochastic optimization on riemannian manifolds",
            "venue": "In Advances in Neural Information Processing Systems",
            "year": 2016
        },
        {
            "authors": [
                "George Kingsley Zipf"
            ],
            "title": "Human Behaviour and the Principle of Least Effort: an Introduction to Human Ecology",
            "year": 1949
        }
    ],
    "sections": [
        {
            "heading": "1 Introduction",
            "text": "Learning representations of symbolic data such as text, graphs and multi-relational data has become a central paradigm in machine learning and artificial intelligence. For instance, word embeddings such as WORD2VEC [17], GLOVE [23] and FASTTEXT [4] are widely used for tasks ranging from machine translation to sentiment analysis. Similarly, embeddings of graphs such as latent space embeddings [13], NODE2VEC [11], and DEEPWALK [24] have found important applications for community detection and link prediction in social networks. Embeddings of multi-relational data such as RESCAL [19], TRANSE [6], and Universal Schema [27] are being used for knowledge graph completion and information extraction.\nTypically, the objective of embedding methods is to organize symbolic objects (e.g., words, entities, concepts) in a way such that their similarity in the embedding space reflects their semantic or functional similarity. For this purpose, the similarity of objects is usually measured either by their distance or by their inner product in the embedding space. For instance, Mikolov et al. [17] embed words in Rd such that their inner product is maximized when words co-occur within similar contexts in text corpora. This is motivated by the distributional hypothesis [12, 9], i.e., that the meaning of words can be derived from the contexts in which they appear. Similarly, Hoff et al. [13] embed social networks such that the distance between social actors is minimized if they are connected in the network. This reflects the homophily property found in many real-world networks, i.e. that similar actors tend to associate with each other.\nAlthough embedding methods have proven successful in numerous applications, they suffer from a fundamental limitation: their ability to model complex patterns is inherently bounded by the dimensionality of the embedding space. For instance, Nickel et al. [20] showed that linear embeddings of graphs can require a prohibitively large dimensionality to model certain types of relations. Although non-linear embeddings can mitigate this problem [7], complex graph patterns can still require a computationally infeasible embedding dimensionality. As a consequence, no method yet exists that is\nar X\niv :1\n70 5.\n08 03\n9v 2\n[ cs\n.A I]\n2 6\nM ay\n2 01\nable to compute embeddings of large graph-structured data – such as social networks, knowledge graphs or taxonomies – without loss of information. Since the ability to express information is a precondition for learning and generalization, it is therefore important to increase the representation capacity of embedding methods such that they can realistically be used to model complex patterns on a large scale. In this work, we focus on mitigating this problem for a certain class of symbolic data, i.e., large datasets whose objects can be organized according to a latent hierarchy – a property that is inherent in many complex datasets. For instance, the existence of power-law distributions in datasets can often be traced back to hierarchical structures [25]. Prominent examples of power-law distributed data include natural language (Zipf’s law [35]) and scale-free networks such as social and semantic networks [28]. Similarly, the empirical analysis of Adcock et al. [1] indicated that many real-world networks exhibit an underlying tree-like structure.\nTo exploit this structural property for learning more efficient representations, we propose to compute embeddings not in Euclidean but in hyperbolic space, i.e., space with constant negative curvature. Informally, hyperbolic space can be thought of as a continuous version of trees and as such it is naturally equipped to model hierarchical structures. For instance, it has been shown that any finite tree can be embedded into a finite hyperbolic space such that distances are preserved approximately [10]. We base our approach on a particular model of hyperbolic space, i.e., the Poincaré ball model, as it is well-suited for gradient-based optimization. This allows us to develop an efficient algorithm for computing the embeddings based on Riemannian optimization, which is easily parallelizable and scales to large datasets. Experimentally, we show that our approach can provide high quality embeddings of large taxonomies – both with and without missing data. Moreover, we show that embeddings trained on WORDNET provide state-of-the-art performance for lexical entailment. On collaboration networks, we also show that Poincaré embeddings are successful in predicting links in graphs where they outperform Euclidean embeddings, especially in low dimensions.\nThe remainder of this paper is organized as follows: In Section 2 we briefly review hyperbolic geometry and discuss related work regarding hyperbolic embeddings. In Section 3 we introduce Poincaré embeddings and discuss how to compute them. In Section 4 we evaluate our approach on tasks such as taxonomy embedding, link prediction in networks and predicting lexical entailment."
        },
        {
            "heading": "2 Embeddings and Hyperbolic Geometry",
            "text": "Hyperbolic geometry is a non-Euclidean geometry which studies spaces of constant negative curvature. It is, for instance, associated with Minkowski spacetime in special relativity. In network science, hyperbolic spaces have started to receive attention as they are well-suited to model hierarchical data. For instance, consider the task of embedding a tree into a metric space such that its structure is reflected in the embedding. A regular tree with branching factor b has (b+ 1)b`−1 nodes at level ` and ((b + 1)b` − 2)/(b − 1) nodes on a level less or equal than `. Hence, the number of children grows exponentially with their distance to the root of the tree. In hyperbolic geometry this kind of tree structure can be modeled easily in two dimensions: nodes that are exactly ` levels below the root are placed on a sphere in hyperbolic space with radius r ∝ ` and nodes that are less than ` levels below the root are located within this sphere. This type of construction is possible as hyperbolic disc area and circle length grow exponentially with their radius.1 See Figure 1b for an example. Intuitively, hyperbolic spaces can be thought of as continuous versions of trees or vice versa, trees can be thought of as \"discrete hyperbolic spaces\" [16]. In R2, a similar construction is not possible as circle length (2πr) and disc area (2πr2) grow only linearly and quadratically with regard to r in Euclidean geometry. Instead, it is necessary to increase the dimensionality of the embedding to model increasingly complex hierarchies. As the number of parameters increases, this can lead to computational problems in terms of runtime and memory complexity as well as to overfitting.\nDue to these properties, hyperbolic space has recently been considered to model complex networks. For instance, Kleinberg [15] introduced hyperbolic geometry for greedy routing in geographic communication networks. Similarly, Boguñá et al. [3] proposed hyperbolic embeddings of the AS Internet topology to perform greedy shortest path routing in the embedding space. Krioukov et al. [16] developed a framework to model complex networks using hyperbolic spaces and discussed\n1For instance, in a two dimensional hyperbolic space with constant curvature K = −1, the length of a circle is given as 2π sinh r while the area of a disc is given as 2π(cosh r − 1). Since sinh r = 1\n2 (er − e−r) and\ncosh r = 1 2 (er + e−r), both disc area and circle length grow exponentially with r.\nhow typical properties such as heterogeneous degree distributions and strong clustering emerges by assuming an underlying hyperbolic geometry to these networks. Adcock et al. [1] proposed a measure based on Gromov’s δ-hyperbolicity [10] to characterize the tree-likeness of graphs.\nIn machine learning and artificial intelligence on the other hand, Euclidean embeddings have become a popular approach for learning from symbolic data. For instance, in addition to the methods discussed in Section 1, Paccanaro and Hinton [22] proposed one of the first embedding methods to learn from relational data. More recently, Holographic [21] and Complex Embeddings [29] have shown state-of-the-art performance in Knowledge Graph completion. In relation to hierarchical representations, Vilnis and McCallum [31] proposed to learn density-based word representations, i.e., Gaussian embeddings, to capture uncertainty and asymmetry. Given information about hierarchical relations in the form of ordered input pairs, Vendrov et al. [30] proposed Order Embeddings to model visual-semantic hierarchies over words, sentences, and images."
        },
        {
            "heading": "3 Poincaré Embeddings",
            "text": "In the following, we are interested in finding embeddings of symbolic data such that their distance in the embedding space reflects their semantic similarity. We assume that there exists a latent hierarchy in which the symbols can be organized. In addition to the similarity of objects, we intend to also reflect this hierarchy in the embedding space to improve over existing methods in two ways:\n1. By inducing an appropriate bias on the structure of the embedding space, we aim at learning more parsimonious embeddings for superior generalization performance and decreased runtime and memory complexity.\n2. By capturing the hierarchy explicitly in the embedding space, we aim at gaining additional insights about the relationships between symbols and the importance of individual symbols.\nHowever, we do not assume that we have direct access to information about the hierarchy, e.g., via ordered input pairs. Instead, we consider the task of inferring the hierarchical relationships fully unsupervised, as is, for instance, necessary for text and network data. For these reasons – and motivated by the discussion in Section 2 – we embed symbolic data into hyperbolic space H. In contrast to Euclidean space R, there exist multiple, equivalent models of H such as the Beltrami-Klein model, the hyperboloid model, and the Poincaré half-plane model. In the following, we will base our approach on the Poincaré ball model, as it is well-suited for gradient-based optimization.2 In\n2It can be seen easily that the distance function of the Poincare ball in Equation (1) is differentiable. Hence, for this model, an optimization algorithm only needs to maintain the constraint that ‖x‖ < 1 for all embeddings. Other models of hyperbolic space however, would be more more difficult to optimize, either due to the form of their distance function or due to the constraints that they introduce. For instance, the hyperboloid model is constrained to points where 〈x,x〉 = −1, while the distance function of the Beltrami-Klein model requires to compute the location of ideal points on the boundary ∂B of the unit ball.\nparticular, let Bd = {x ∈ Rd | ‖x‖ < 1} be the open d-dimensional unit ball, where ‖ · ‖ denotes the Euclidean norm. The Poincaré ball model of hyperbolic space corresponds then to the Riemannian manifold (Bd, gx), i.e., the open unit ball equipped with the Riemannian metric tensor\ngx =\n( 2\n1− ‖x‖2\n)2 gE ,\nwhere x ∈ Bd and gE denotes the Euclidean metric tensor. Furthermore, the distance between points u,v ∈ Bd is given as\nd(u,v) = arcosh ( 1 + 2\n‖u− v‖2\n(1− ‖u‖2)(1− ‖v‖2)\n) . (1)\nThe boundary of the ball is denoted by ∂B. It corresponds to the sphere Sd−1 and is not part of the hyperbolic space, but represents infinitely distant points. Geodesics in Bd are then circles that are orthogonal to ∂B (as well as all diameters). See Figure 1a for an illustration. It can be seen from Equation (1), that the distance within the Poincaré ball changes smoothly with respect to the location of u and v. This locality property of the Poincaré distance is key for finding continuous embeddings of hierarchies. For instance, by placing the root node of a tree at the origin of Bd it would have a relatively small distance to all other nodes as its Euclidean norm is zero. On the other hand, leaf nodes can be placed close to the boundary of the Poincaré ball as the distance grows very fast between points with a norm close to one. Furthermore, please note that Equation (1) is symmetric and that the hierarchical organization of the space is solely determined by the distance of points to the origin. Due to this self-organizing property, Equation (1) is applicable in an unsupervised setting where the hierarchical order of objects is not specified in advance such as text and networks. Remarkably, Equation (1) allows us therefore to learn embeddings that simultaneously capture the hierarchy of objects (through their norm) as well a their similarity (through their distance).\nSince a single hierarchical structure can already be represented in two dimensions, the Poincaré disk (B2) is typically used to represent hyperbolic geometry. In our method, we instead use the Poincaré ball (Bd), for two main reasons: First, in many datasets such as text corpora, multiple latent hierarchies can co-exist, which can not always be modeled in two dimensions. Second, a larger embedding dimension can decrease the difficulty for an optimization method to find a good embedding (also for single hierarchies) as it allows for more degrees of freedom during the optimization process.\nTo compute Poincaré embeddings for a set of symbols S = {xi}ni=1, we are then interested in finding embeddings Θ = {θi}ni=1, where θi ∈ Bd. We assume we are given a problem-specific loss function L(Θ) which encourages semantically similar objects to be close in the embedding space according to their Poincaré distance. To estimate Θ, we then solve the optimization problem\nΘ′ ← arg min Θ L(Θ) s.t. ∀θi ∈ Θ : ‖θi‖ < 1. (2)\nWe will discuss specific loss functions in Section 4."
        },
        {
            "heading": "3.1 Optimization",
            "text": "Since the Poincaré Ball has a Riemannian manifold structure, we can optimize Equation (2) via stochastic Riemannian optimization methods such as RSGD [5] or RSVRG [34]. In particular, let TθB denote the tangent space of a point θ ∈ Bd. Furthermore, let ∇R ∈ TθB denote the Riemannian gradient of L(θ) and let∇E denote the Euclidean gradient of L(θ). Using RSGD, parameter updates to minimize Equation (2) are then of the form\nθt+1 = Rθt (−ηt∇RL(θt))\nwhere Rθt denotes the retraction onto B at θ and ηt denotes the learning rate at time t. Hence, for the minimization of Equation (2), we require the Riemannian gradient and a suitable retraction. Since the Poincaré ball is a conformal model of hyperbolic space, the angles between adjacent vectors are identical to their angles in the Euclidean space. The length of vectors however might differ. To derive the Riemannian gradient from the Euclidean gradient, it is sufficient to rescale∇E with the inverse of the Poincaré ball metric tensor, i.e., g−1θ . Since gθ is a scalar matrix, the inverse is trivial to compute. Furthermore, since Equation (1) is fully differentiable, the Euclidean gradient can easily be derived\nusing standard calculus. In particular, the Euclidean gradient ∇E = ∂L(θ)∂d(θ,x) ∂d(θ,x) ∂θ depends on the gradient of L, which we assume is known, and the partial derivatives of the Poincaré distance, which can be computed as follows: Let α = 1− ‖θ‖2 , β = 1− ‖x‖2 and let\nγ = 1 + 2\nαβ ‖θ − x‖2 (3)\nThe partial derivate of the Poincaré distance with respect to θ is then given as\n∂d(θ,x)\n∂θ =\n4 β √ γ2 − 1\n( ‖x‖2 − 2〈θ,x〉+ 1\nα2 θ − x α\n) . (4)\nSince d(·, ·) is symmetric, the partial derivative ∂d(x,θ)∂θ can be derived analogously. As retraction operation we use Rθ(v) = θ + v. In combination with the Riemannian gradient, this corresponds then to the well-known natural gradient method [2]. Furthermore, we constrain the embeddings to remain within the Poincaré ball via the projection\nproj(θ) = { θ/‖θ‖ − ε if ‖θ‖ ≥ 1 θ otherwise ,\nwhere ε is a small constant to ensure numerical stability. In all experiments we used ε = 10−5. In summary, the full update for a single embedding is then of the form\nθt+1 ← proj ( θt − ηt (1− ‖θt‖2)2 4 ∇E ) . (5)\nIt can be seen from Equations (4) and (5) that this algorithm scales well to large datasets, as the computational and memory complexity of an update depends linearly on the embedding dimension. Moreover, the algorithm is straightforward to parallelize via methods such as Hogwild [26], as the updates are sparse (only a small number of embeddings are modified in an update) and collisions are very unlikely on large-scale data."
        },
        {
            "heading": "3.2 Training Details",
            "text": "In addition to this optimization procedure, we found that the following training details were helpful for obtaining good representations: First, we initialize all embeddings randomly from the uniform distribution U(−0.001, 0.001). This causes embeddings to be initialized close to the origin of Bd. Second, we found that a good initial angular layout can be helpful to find good embeddings. For this reason, we train during an initial \"burn-in\" phase with a reduced learning rate η/c. In combination with initializing close to the origin, this can improve the angular layout without moving too far towards the boundary. In our experiments, we set c = 10 and the duration of the burn-in to 10 epochs."
        },
        {
            "heading": "4 Evaluation",
            "text": "In this section, we evaluate the quality of Poincaré embeddings for a variety of tasks, i.e., for the embedding of taxonomies, for link prediction in networks, and for modeling lexical entailment. We compare the Poincaré distance as defined in Equation (1) to the following two distance functions:\nEuclidean In all cases, we include the Euclidean distance d(u,v) = ‖u− v‖2. As the Euclidean distance is flat and symmetric, we expect that it requires a large dimensionality to model the hierarchical structure of the data.\nTranslational For asymmetric data, we also include the score function d(u,v) = ‖u− v + r‖2, as proposed by Bordes et al. [6] for modeling large-scale graph-structured data. For this score function, we also learn the global translation vector r during training.\nNote that the translational score function has, due to its asymmetry, more information about the nature of an embedding problem than a symmetric distance when the order of (u, v) indicates the hierarchy of elements. This is, for instance, the case for is-a(u, v) relations in taxonomies. For the Poincaré distance and the Euclidean distance we could randomly permute the order of (u, v) and obtain the identical embedding, while this is not the case for the translational score function. As such, it is not fully unsupervised and only applicable where this hierarchical information is available."
        },
        {
            "heading": "4.1 Embedding Taxonomies",
            "text": "In the first set of experiments, we are interested in evaluating the ability of Poincaré embeddings to embed data that exhibits a clear latent hierarchical structure. For this purpose, we conduct experiments on the transitive closure of the WORDNET noun hierarchy [18] in two settings:\nReconstruction To evaluate representation capacity, we embed fully observed data and reconstruct it from the embedding. The reconstruction error in relation to the embedding dimension is then a measure for the capacity of the model.\nLink Prediction To test generalization performance, we split the data into a train, validation and test set by randomly holding out observed links. Links in the validation and test set do not include the root or leaf nodes as these links would either be trivial to predict or impossible to predict reliably.\nSince we are using the transitive closure, the hypernymy relations form a directed acyclic graph such that the hierarchical structure is not directly visible from the raw data but has to be inferred. The transitive closure of the WORDNET noun hierarchy consists of 82,115 nouns and 743,241 hypernymy relations. On this data, we learn embeddings in both settings as follows: Let D = {(u, v)} be the set of observed hypernymy relations between noun pairs. We then learn embeddings of all symbols in D such that related objects are close in the embedding space. In particular, we minimize the loss function\nL(Θ) = ∑\n(u,v)∈D\nlog e−d(u,v)∑\nv′∈N (u) e −d(u,v′) , (6)\nwhere N (u) = {v | (u, v) 6∈ D} ∪ {u} is the set of negative examples for u (including u). For training, we randomly sample 10 negative examples per positive example. Equation (6) can be interpreted as a soft ranking loss where related objects should be closer than objects for which we didn’t observe a relationship. This choice of loss function is motivated by the fact that we don’t want to push symbols belonging to distinct subtrees arbitrarily far apart as their subtrees might still be close. Instead we want them to be farther apart than symbols with an observed relation.\nWe evaluate the quality of the embeddings as commonly done for graph embeddings [6, 21]: For each observed relationship (u, v), we rank its distance d(u,v) among the ground-truth negative examples for u, i.e., among the set {d(u,v′) | (u, v′) 6∈ D)}. In the Reconstruction setting, we evaluate the ranking on all nouns in the dataset. We then record the mean rank of v as well as the mean average precision (MAP) of the ranking. The results of these experiments are shown in Table 1. It can be seen that Poincaré embeddings are very successful in the embedding of large taxonomies – both with regard to their representation capacity and their generalization performance. Even compared to Translational embeddings, which have more information about the structure of the task, Poincaré\nembeddings show a greatly improved performance while using an embedding that is smaller by an order of magnitude. Furthermore, the results of Poincaré embeddings in the link prediction task are very robust with regard to the embedding dimension. We attribute this result to the structural bias of Poincaré embeddings, what could lead to reduced overfitting on this kind of data with a clear latent hierarchy. In Figure 2 we show additionally a visualization of a two-dimensional Poincaré embedding. For purpose of clarity, this embedding has been trained only on the mammals subtree of WORDNET."
        },
        {
            "heading": "4.2 Network Embeddings",
            "text": "Next, we evaluated the performance of Poincaré embeddings for link prediction in networks. Since edges in complex networks can often be explained via latent hierarchies over their nodes [8], we are interested in the benefits of Poincaré embeddings both in terms representation size and generalization performance. We performed our experiments on four commonly used social networks, i.e, ASTROPH, CONDMAT, GRQC, and HEPPH. These networks represent scientific collaborations such that there exists an undirected edge between two persons if they co-authored a paper. For these networks, we model the probability of an edge as proposed by Krioukov et al. [16] via the Fermi-Dirac distribution\nP ((u, v) = 1 | Θ) = 1 e(d(u,v)−r)/t + 1\n(7)\nwhere r, t > 0 are hyperparameters. Here, r corresponds to the radius around each point u such that points within this radius are likely to have an edge with u. The parameter t specifies the steepness of the logistic function and influences both average clustering as well as the degree distribution [16]. We use the cross-entropy loss to learn the embeddings and sample negatives as in Section 4.1.\nFor evaluation, we split each dataset randomly into train, validation, and test set. The hyperparameters r and t where tuned for each method on the validation set. Table 2 lists the MAP score of Poincaré and Euclidean embeddings on the test set for the hyperparameters with the best validation score. Additionally, we again list the reconstruction performance without missing data. Translational embeddings are not applicable to these datasets as they consist of undirected edges. It can be seen that Poincaré embeddings perform again very well on these datasets and – especially in the low-dimensional regime – outperform Euclidean embeddings."
        },
        {
            "heading": "4.3 Lexical Entailment",
            "text": "An interesting aspect of Poincaré embeddings is that they allow us to make graded assertions about hierarchical relationships as hierarchies are represented in a continuous space. We test this property on HYPERLEX [32], which is a gold standard resource for evaluating how well semantic models\ncapture graded lexical entailment by quantifying to what degree X is a type of Y via ratings on a scale of [0, 10]. Using the noun part of HYPERLEX, which consists of 2163 rated noun pairs, we then evaluated how well Poincaré embeddings reflect these graded assertions. For this purpose, we used the Poincaré embeddings that were obtained in Section 4.1 by embedding WORDNET with a dimensionality d = 5. Note that these embeddings were not specifically trained for this task. To determine to what extent is-a(u, v) is true, we used the score function:\nscore(is-a(u, v)) = −(1 + α(‖v‖ − ‖u‖))d(u,v). (8) Here, the term α(‖v‖ − ‖u‖) acts as a penalty when v is lower in the embedding hierarchy, i.e., when v has a higher norm than u. The hyperparameter α determines the severity of the penalty. In our experiments we set α = 103.\nUsing Equation (8), we scored all noun pairs in HYPERLEX and recorded Spearman’s rank correlation with the ground-truth ranking. The results of this experiment are shown in Table 3. It can be seen that the ranking based on Poincaré embeddings clearly outperforms all state-of-the-art methods evaluated in [32]. Methods in Table 3 that are prefixed with WN also use WORDNET as a basis and therefore are most comparable. The same embeddings also achieved a state-of-the-art accuracy of 0.86 on WBLESS [33, 14], which evaluates non-graded lexical entailment."
        },
        {
            "heading": "5 Discussion and Future Work",
            "text": "In this paper, we introduced Poincaré embeddings for learning representations of symbolic data and showed how they can simultaneously learn the similarity and the hierarchy of objects. Furthermore, we proposed an efficient algorithm to compute the embeddings and showed experimentally, that Poincaré embeddings provide important advantages over Euclidean embeddings on hierarchical data: First, Poincaré embeddings enable very parsimonious representations whats allows us to learn high-quality embeddings of large-scale taxonomies. Second, excellent link prediction results indicate that hyperbolic geometry can introduce an important structural bias for the embedding of complex symbolic data. Third, state-of-the-art results for predicting lexical entailment suggest that the hierarchy in the embedding space corresponds well to the underlying semantics of the data.\nThe main focus of this work was to evaluate the general properties of hyperbolic geometry for the embedding of symbolic data. In future work, we intend, to both expand the applications of Poincaré embeddings – for instance to multi-relational data – and also to derive models that are tailored to specific applications such as word embeddings. Furthermore, we have shown that natural gradient based optimization already produces very good embeddings and scales to large datasets. We expect that a full Riemannian optimization approach can further increase the quality of the embeddings and lead to faster convergence."
        }
    ],
    "title": "Poincaré Embeddings for  Learning Hierarchical Representations",
    "year": 2017
}