{
    "abstractText": "This work tackles the risk estimation problem from a new perspective: a framework is proposed for reasoning about tra c situations and collision risk at a semantic level, while classic approaches typically reason at a trajectory level. Risk is assessed by estimating the intentions of drivers and detecting con icts between them, rather than by predicting the future trajectories of the vehicles and detecting collisions between them. More speci cally, dangerous situations are identi ed by comparing what drivers intend to do with what they are expected to do according to the tra c rules. The reasoning about intentions and expectations is performed in a probabilistic manner, in order to take into account sensor uncertainties and interpretation ambiguities. This framework can in theory be applied to any type of tra c situation; here we present its application to the speci c case of road intersections. The proposed motion model takes into account the mutual in uences between the maneuvers performed by vehicles at an intersection. It also incorporates information about the in uence of the geometry and topology of the intersection on the behavior of a vehicle, and therefore can be applied to arbitrary intersection layouts. The approach was validated with eld trials using passenger vehicles equipped with Vehicle-to-Vehicle wireless communication modems, and in simulation. The results demonstrate that the algorithm is able to detect dangerous situations early and complies with real-time constraints. Key-words: Risk estimation, driver intention estimation, situational awareness, driver assistance systems, road intersection safety ∗ Inria Grenoble Rhône-Alpes † Renault s.a.s. Méthode générale pour l'estimation du risque basée sur la comparaison d'intentions, et application aux intersections Résumé : Ces travaux abordent le problème de l'estimation du risque sous un angle nouveau : nous proposons une structure de raisonnement pour analyser les scènes routières et le risque de collision à un niveau sémantique, contrairement aux approches classiques qui raisonnent au niveau des trajectoires. Le risque est calculé en estimant les intentions des conducteurs et en détectant les con its, sans avoir à prédire les trajectoires futures des véhicules. Plus précisément, la détection des situations dangereuses est basée sur la comparaison entre ce que les conducteurs ont l'intention de faire et ce que les conducteurs devraient faire d'après les règles de la circulation. Ce raisonnement est réalisé de manière probabiliste a n de prendre en compte les incertitudes sur les mesures capteur et les ambigüités sur l'interprétation de la scène. En théorie ce raisonnement peut être appliqué à tout type de scène routière ; dans ce document nous présentons son application aux intersections. Le modèle proposé prend en compte l'in uence que la man÷uvre d'un véhicule exerce sur la man÷uvre des autres véhicules. Il incorpore aussi des informations sur l'in uence de la géométrie et topologie de l'intersection sur le comportement d'un véhicule. L'approche proposée a été validée par des tests en environnement réel avec des véhicules communicants, ainsi qu'en simulation. Les résultats montrent que l'algorithme est capable de détecter les situations dangereuses et qu'il est compatible avec des applications sécuritaires tempsréel. Mots-clés : Estimation du risque, estimation intention conducteur, compréhension de situation, systèmes d'aide à la conduite, sécurité aux intersections Intention-Aware Risk Estimation for General Tra c Situations, and Application to Intersection Safety3",
    "authors": [
        {
            "affiliations": [],
            "name": "Stéphanie Lefèvre"
        },
        {
            "affiliations": [],
            "name": "Christian Laugier"
        },
        {
            "affiliations": [],
            "name": "Javier Ibañez-Guzmán"
        },
        {
            "affiliations": [],
            "name": "Javier Ibañez-Guzmàn"
        }
    ],
    "id": "SP:5cae72da2bf9dcf629e2d5be880996f6967b6347",
    "references": [
        {
            "authors": [
                "D. Hall",
                "J. Llinas"
            ],
            "title": "An introduction to multisensor data fusion",
            "venue": "Proceedings of the IEEE, vol. 85, no. 1, pp. 6 23",
            "year": 1997
        },
        {
            "authors": [
                "J. Ibañez-Guzmán",
                "S. Lefèvre",
                "A. Mokkadem",
                "S. Rodhain"
            ],
            "title": "Vehicle to vehicle communications applied to road intersection safety",
            "venue": "eld results, in Proc. IEEE International Conference on Intelligent Transportation Systems",
            "year": 2010
        },
        {
            "authors": [
                "S. Worrall",
                "D. Orchansky",
                "F. Masson",
                "E. Nebot"
            ],
            "title": "Improving vehicle safety using context based detection of risk",
            "venue": "Proc. IEEE Intelligent Transportation Systems Conference",
            "year": 2010
        },
        {
            "authors": [
                "A. Chinea",
                "M. Parent"
            ],
            "title": "Risk assessment algorithms based on recursive neural networks",
            "venue": "Proc. International Joint Conference on Neural Networks",
            "year": 2007
        },
        {
            "authors": [
                "F.D. Salim",
                "S.W. Loke",
                "A. Rakotonirainy",
                "B. Srinivasan",
                "S. Krishnaswamy"
            ],
            "title": "Collision pattern modeling and real-time collision detection at road intersections",
            "venue": "Proc. IEEE Intelligent Transportation Systems Conference",
            "year": 2007
        },
        {
            "authors": [
                "S. Ammoun",
                "F. Nashashibi"
            ],
            "title": "Real time trajectory prediction for collision risk estimation between vehicles",
            "venue": "Proc. IEEE Intelligent Computer Communication and Processing",
            "year": 2009
        },
        {
            "authors": [
                "T. Batz",
                "K. Watson",
                "J. Beyerer"
            ],
            "title": "Recognition of dangerous situations within a cooperative group of vehicles",
            "venue": "Proc. IEEE Intelligent Vehicles Symposium",
            "year": 2009
        },
        {
            "authors": [
                "M. Brännström",
                "E. Coelingh",
                "J. Sjöberg"
            ],
            "title": "Model-based threat assessment for avoiding arbitrary vehicle collisions",
            "venue": "IEEE Transactions on Intelligent Transportation Systems, vol. 11, no. 3, pp. 658 669",
            "year": 2010
        },
        {
            "authors": [
                "A. Eidehall",
                "L. Petersson"
            ],
            "title": "Statistical threat assessment for general road scenes using Monte Carlo sampling",
            "venue": "IEEE Transactions on Intelligent Transportation Systems, vol. 9, no. 1, pp. 137 147",
            "year": 2008
        },
        {
            "authors": [
                "J. Hillenbrand",
                "A.M. Spieker",
                "K. Kroschel"
            ],
            "title": "A multilevel collision mitigation approach: situation assessment",
            "venue": "decision making, and performance tradeo s, IEEE Transactions on Intelligent Transportation Systems, vol. 7, no. 4, pp. 528 540",
            "year": 2006
        },
        {
            "authors": [
                "A. Polychronopoulos",
                "M. Tsogas",
                "A. Amditis",
                "L. Andreone"
            ],
            "title": "Sensor fusion for predicting vehicles' path for collision avoidance systems",
            "venue": "IEEE Transactions on Intelligent Transportation Systems, vol. 8, no. 3, pp. 549 562",
            "year": 2007
        },
        {
            "authors": [
                "G.S. Aoude",
                "B.D. Luders",
                "D.S. Levine",
                "J.P. How"
            ],
            "title": "Threat-aware path planning in uncertain urban environments",
            "venue": "Proc. IEEE/RSJ International Conference on Intelligent Robots and Systems",
            "year": 2010
        },
        {
            "authors": [
                "G.S. Aoude",
                "B.D. Luders",
                "K.K.H. Lee",
                "D.S. Levine",
                "J.P. How"
            ],
            "title": "Threat assessment design for driver assistance system at intersections",
            "venue": "Proc. IEEE Intelligent Transportation Systems Conference",
            "year": 2010
        },
        {
            "authors": [
                "C. Laugier",
                "I. Paromtchik",
                "M. Perrollaz",
                "M. Yong",
                "J. Yoder",
                "C. Tay",
                "K. Mekhnacha",
                "A. Negre"
            ],
            "title": "Probabilistic analysis of dynamic scenes and collision risks assessment to improve driving safety",
            "venue": "IEEE Intelligent Transportation Systems Magazine, vol. 3, no. 4, pp. 4 19",
            "year": 2011
        },
        {
            "authors": [
                "M. Altho",
                "A. Mergel"
            ],
            "title": "Comparison of Markov chain abstraction and Monte Carlo simulation for the safety assessment of autonomous cars",
            "venue": "IEEE Transactions on Intelligent Transportation Systems, vol. 12, no. 4, pp. 1237 1247",
            "year": 2011
        },
        {
            "authors": [
                "G. Agamennoni",
                "J.I. Nieto",
                "E.M. Nebot"
            ],
            "title": "Estimation of multivehicle dynamics by considering contextual information",
            "venue": "IEEE Transactions on Robotics, vol. 28, no. 4, pp. 855 870",
            "year": 2012
        },
        {
            "authors": [
                "T. Gindele",
                "S. Brechtel",
                "R. Dillmann"
            ],
            "title": "A probabilistic model for estimating driver behaviors and vehicle trajectories in tra c environments",
            "venue": "Proc. IEEE Intelligent Transportation Systems Conference",
            "year": 2010
        },
        {
            "authors": [
                "N. Oliver",
                "A.P. Pentland"
            ],
            "title": "Graphical models for driver behavior recognition in a Smart- Car",
            "venue": "Proc. IEEE Intelligent Vehicles Symposium",
            "year": 2000
        },
        {
            "authors": [
                "S. Lefèvre",
                "C. Laugier",
                "J. Ibañez-Guzmán"
            ],
            "title": "Risk assessment at road intersections: comparing intention and expectation",
            "venue": "Proc. IEEE Intelligent Vehicles Symposium",
            "year": 2012
        },
        {
            "authors": [
                "L. Fletcher",
                "S. Teller",
                "E. Olson",
                "D. Moore",
                "Y. Kuwata",
                "J. How",
                "J. Leonard",
                "I. Miller",
                "M. Campbell",
                "D. Huttenlocher",
                "A. Nathan",
                "F. Kline"
            ],
            "title": "The MIT-Cornell collision and why it happened",
            "venue": "Journal of Field Robotics, vol. 25, pp. 775 807",
            "year": 2008
        },
        {
            "authors": [
                "O. Lebeltel",
                "P. Bessiere",
                "J. Diard",
                "E. Mazer"
            ],
            "title": "Bayesian robot programming",
            "venue": "Autonomous Robots, vol. 16, no. 1, pp. 49 79",
            "year": 2004
        },
        {
            "authors": [
                "A. Spek",
                "P. Wieringa",
                "W. Janssen"
            ],
            "title": "Intersection approach speed and accident probability",
            "venue": "Transportation Research Part F: Tra c Psychology and Behaviour, vol. 9, no. 2, pp. 155 171",
            "year": 2006
        },
        {
            "authors": [
                "D.R. Ragland"
            ],
            "title": "A",
            "venue": "So a, S. E. Shladover, and J. A. Misener, Gap acceptance for vehicles turning left across on-coming tra c: implications for intersection decision support design, in Proc. Transportation Research Board Annual Meeting",
            "year": 2006
        },
        {
            "authors": [
                "H. Berndt",
                "S. Wender",
                "K. Dietmayer"
            ],
            "title": "Driver braking behavior during intersection approaches and implications for warning strategies for driver assistant systems",
            "venue": "Proc. IEEE Intelligent Vehicles Symposium",
            "year": 2007
        },
        {
            "authors": [
                "M.S. Arulampalam",
                "S. Maskell",
                "N. Gordon",
                "T. Clapp"
            ],
            "title": "A tutorial on particle lters for online nonlinear/non-Gaussian Bayesian tracking",
            "venue": "IEEE Transactions on Signal Processing, vol. 50, no. 2, pp. 174 188",
            "year": 2002
        },
        {
            "authors": [
                "S. Lefèvre",
                "C. Laugier",
                "J. Ibañez-Guzmán"
            ],
            "title": "Evaluating risk at road intersections by detecting con icting intentions",
            "venue": "Proc. IEEE/RSJ International Conference on Intelligent Robots and Systems",
            "year": 2012
        }
    ],
    "sections": [
        {
            "text": "HAL Id: hal-00875356 https://inria.hal.science/hal-00875356v1\nSubmitted on 21 Oct 2013\nHAL is a multi-disciplinary open access archive for the deposit and dissemination of scientific research documents, whether they are published or not. The documents may come from teaching and research institutions in France or abroad, or from public or private research centers. L’archive ouverte pluridisciplinaire HAL, est destinée au dépôt et à la diffusion de documents scientifiques de niveau recherche, publiés ou non, émanant des établissements d’enseignement et de recherche français ou étrangers, des laboratoires publics ou privés.\nIntention-Aware Risk Estimation for General Traffic Situations, and Application to Intersection Safety\nStéphanie Lefèvre, Christian Laugier, Javier Ibañez-Guzmán\nTo cite this version: Stéphanie Lefèvre, Christian Laugier, Javier Ibañez-Guzmán. Intention-Aware Risk Estimation for General Traffic Situations, and Application to Intersection Safety. [Research Report] RR-8379, INRIA. 2013. hal-00875356\nIS S\nN 02\n49 -6\n39 9\nIS R\nN IN\nR IA\n/R R\n-- 83\n79 --\nFR +E\nN G\nRESEARCH REPORT N° 8379 October 2013\nProject-Teams E-Motion\nIntention-Aware Risk Estimation for General Traffic Situations, and Application to Intersection Safety Stéphanie Lefèvre, Christian Laugier, Javier Ibañez-Guzmàn\nRESEARCH CENTRE GRENOBLE – RHÔNE-ALPES\nInovallée 655 avenue de l’Europe Montbonnot 38334 Saint Ismier Cedex\nIntention-Aware Risk Estimation for General\nTra c Situations, and Application to\nIntersection Safety\nStéphanie Lefèvre∗†, Christian Laugier∗, Javier\nIbañez-Guzmàn†\nProject-Teams E-Motion\nResearch Report n° 8379 October 2013 23 pages\nAbstract: This work tackles the risk estimation problem from a new perspective: a framework is proposed for reasoning about tra c situations and collision risk at a semantic level, while classic approaches typically reason at a trajectory level. Risk is assessed by estimating the intentions of drivers and detecting con icts between them, rather than by predicting the future trajectories of the vehicles and detecting collisions between them. More speci cally, dangerous situations are identi ed by comparing what drivers intend to do with what they are expected to do according to the tra c rules. The reasoning about intentions and expectations is performed in a probabilistic manner, in order to take into account sensor uncertainties and interpretation ambiguities. This framework can in theory be applied to any type of tra c situation; here we present its application to the speci c case of road intersections. The proposed motion model takes into account the mutual in uences between the maneuvers performed by vehicles at an intersection. It also incorporates information about the in uence of the geometry and topology of the intersection on the behavior of a vehicle, and therefore can be applied to arbitrary intersection layouts. The approach was validated with eld trials using passenger vehicles equipped with Vehicle-to-Vehicle wireless communication modems, and in simulation. The results demonstrate that the algorithm is able to detect dangerous situations early and complies with real-time constraints.\nKey-words: Risk estimation, driver intention estimation, situational awareness, driver assistance systems, road intersection safety\n∗ Inria Grenoble Rhône-Alpes † Renault s.a.s.\nMéthode générale pour l'estimation du risque basée sur la\ncomparaison d'intentions, et application aux intersections\nRésumé : Ces travaux abordent le problème de l'estimation du risque sous un angle nouveau : nous proposons une structure de raisonnement pour analyser les scènes routières et le risque de collision à un niveau sémantique, contrairement aux approches classiques qui raisonnent au niveau des trajectoires. Le risque est calculé en estimant les intentions des conducteurs et en détectant les con its, sans avoir à prédire les trajectoires futures des véhicules. Plus précisément, la détection des situations dangereuses est basée sur la comparaison entre ce que les conducteurs ont l'intention de faire et ce que les conducteurs devraient faire d'après les règles de la circulation. Ce raisonnement est réalisé de manière probabiliste a n de prendre en compte les incertitudes sur les mesures capteur et les ambigüités sur l'interprétation de la scène.\nEn théorie ce raisonnement peut être appliqué à tout type de scène routière ; dans ce document nous présentons son application aux intersections. Le modèle proposé prend en compte l'in uence que la man÷uvre d'un véhicule exerce sur la man÷uvre des autres véhicules. Il incorpore aussi des informations sur l'in uence de la géométrie et topologie de l'intersection sur le comportement d'un véhicule. L'approche proposée a été validée par des tests en environnement réel avec des véhicules communicants, ainsi qu'en simulation. Les résultats montrent que l'algorithme est capable de détecter les situations dangereuses et qu'il est compatible avec des applications sécuritaires tempsréel.\nMots-clés : Estimation du risque, estimation intention conducteur, compréhension de situation, systèmes d'aide à la conduite, sécurité aux intersections\nIntention-Aware Risk Estimation for General Tra c Situations, and Application to Intersection Safety3"
        },
        {
            "heading": "1 Introduction",
            "text": "Active safety systems are increasingly present in commercial vehicles, as part of a global e ort to make roads safer. The purpose of such systems is to avoid or mitigate accidents through driver warnings or direct actions on the commands of the vehicles (braking, steering). At an algorithmic level, active safety functions rely on four processing steps: detect and track relevant entities in the environment (object assessment step), establish the relationship between these entities for a better understanding of the current situation (situation assessment step), estimate the level of danger of the current situation (risk assessment step), and decide on the best course of action in order to promote safety (decision making step) [1].\nThe contribution of this work concerns the second step. While classic approaches evaluate the risk of a tra c situation by predicting the future trajectories of vehicles and detecting collisions between them, we propose to reason on risk at a semantic level. In the proposed framework, risk is assessed by estimating the intentions of drivers and detecting con icts between them. Tra c rules are explicitly represented in our model, which makes it possible to estimate both what drivers intend to do and what they are expected to do. Con icts are then identi ed by comparing intentions and expectations. This novel formulation of risk re ects the fact that most road accidents are caused by driver error [2], and has the advantage that it does not require to predict the future trajectories of vehicles.\nThe remainder of this report is organized as follows. Section 2 reviews related work. Section 3 describes the proposed approach for risk assessment for general tra c situations. Section 4 describes the application of this general framework to the speci c case of road intersections. Section 5 presents results obtained in simulation for a two-way-stop cross intersection, and in eld trials with passenger vehicles negotiating a T-shaped give-way intersection."
        },
        {
            "heading": "2 Related work",
            "text": "Risk estimation approaches can be classi ed in three main families."
        },
        {
            "heading": "2.1 Knowledge-Based Systems",
            "text": "An intuitive approach is to de ne a set of rules which detect danger based on the context and on the current observations of the state of the vehicles.\nThe rules can be simple heuristics on acceptable speeds in speci c locations [3], or can include more advanced concepts such as the semantics of the location, weather conditions or the level of fatigue of the driver [4].\nBecause context is explicitly taken into account in KBS, they can be applied to a large number of scenarios. However an established limitation of these systems is their inability to account for uncertainties (both on the data and on the model), which results in instabilities in the output."
        },
        {
            "heading": "2.2 Data mining",
            "text": "An alternative is to use accident databases to learn typical collision patterns between two vehicles. This way potentially dangerous con gurations can be identi ed when they occur again.\nNeural Networks and Support Vector Machines have been used in the past to map the relationship between vehicles states (input) and collision risk (output) directly [5, 6].\nHowever obtaining the data to learn from remains an issue, since real data is not available and simulations will not be representative of real accident situations. Another limitation is that these techniques learn collision patterns between pairs of vehicles without putting them in context\nRR n° 8379"
        },
        {
            "heading": "4 Lefèvre & Laugier & Ibañez-Guzmàn",
            "text": "with the other vehicles. Since the relationships between the di erent vehicles in the scene are not modeled, dangerous situations involving more than two vehicles will be detected very late (e.g. vehicle A preparing to overtake vehicle B, while vehicle C is driving on the same road but in the opposite direction)."
        },
        {
            "heading": "2.3 Trajectory prediction",
            "text": "By far the most popular approaches to risk estimation are based on trajectory prediction. The idea is to use a motion model to predict the possible future trajectories of each vehicle in the scene, and then to look for intersections between pairs of trajectories to detect future collisions.\nExtensive research has been conducted on trajectory prediction. The most common solution is to rely on purely physical models (dynamic or kinematic) of the motion of a vehicle [7, 8, 9, 10, 11, 12], however those cannot reason at a high level about the situation and therefore are limited to short-term collision prediction. Long-term prediction can be improved by reasoning at a maneuver level instead of a purely physical level, and by taking into account the constraints imposed by the road network on the motion of vehicles. One strategy is to rst identify the maneuver intention of each driver and to then generate trajectories corresponding to that maneuver intention on the current road layout. For this purpose, Aoude et. al. [13, 14] used a combination of Support Vector Machines and Bayesian Filtering for maneuver intention estimation, and Rapidly-exploring Random Trees for trajectory generation. As an alternative, Laugier et. al. [15] proposed to combine Hidden Markov Models and Gaussian Processes. Another solution is to use Monte-Carlo simulation to explore the di erent possible realizations of a maneuver by sampling on the input variables [16]. Other works propose integrated frameworks based on Markov State Space Models (MSSM) which explicitly represent the maneuver intention of drivers and allow the prediction of future trajectories without the need of a separate maneuver intention estimation step [17, 18, 19].\nThe main limitation of approaches based on trajectory prediction is their high computational cost. For advanced motion models, which take into account the local shape of the road layout and the dependencies between the motion of di erent vehicles, the cost of computing all the possible future trajectories and the probability that they intersect is not compatible with realtime safety applications. The classic solution to reduce the complexity and the computation time is to assume independence between vehicles. However this leads to misinterpretations of tra c situations and to an overestimation of the risk [20]."
        },
        {
            "heading": "3 Proposed approach for general tra c situations",
            "text": "To our knowledge, only two motion models have been proposed in the literature which take into account the mutual dependencies between the vehicles [17, 18]. Both are based on MSSMs and su er from the limitations mentioned in the previous section, i.e. the cost of predicting trajectories using such models is prohibitive for risk estimation and incompatible with real-time safety applications. As an alternative we propose a novel approach to risk estimation which is also based on MSSMs but does not rely on trajectory prediction to estimate the risk of a situation."
        },
        {
            "heading": "3.1 Principle and examples",
            "text": "We propose to detect dangerous situations by comparing what drivers intend to do with what drivers are expected to do according to the tra c rules.\nInria\nIntention-Aware Risk Estimation for General Tra c Situations, and Application to Intersection Safety5\nExample 1. Vehicle A is following vehicle B on the highway, then vehicle B starts braking. In this situation the driver of vehicle A is expected to either adapt its speed to the new speed of vehicle B, or to change lanes. If the intention of the driver does not match the expectation, e.g. if the driver intends to keep the same speed, the situation becomes dangerous.\nExample 2. Vehicle A is approaching a give-way intersection, vehicle B is approaching the same intersection and has the right-of-way. In this situation the driver of vehicle A is expected to yield to vehicle B if the time gap before vehicle B reaches the intersection is too short for vehicle A to execute its maneuver. If the intention of the driver does not match the expectation, e.g. if the driver intends to proceed in the intersection while the time gap is too short, the situation becomes dangerous.\nThis novel approach to risk assessment re ects the fact that most road accidents are caused by driver error [2], and matches the intuitive notion that dangerous situations are situations where drivers are acting di erently from what is expected of them."
        },
        {
            "heading": "3.2 Implementation",
            "text": "As explained above, the proposed approach relies on the estimation of:\n1. The maneuver that a driver intends to perform\n2. The maneuver that is expected of the driver\nThe former is already explicitly represented as a variable in the classic MSSM. The latter is implicitly encoded in the classic MSSM, in the multi-vehicle dependencies. In the proposed MSSM, what is expected of the driver is made explicit by de ning an additional variable. The di erences between the two models are illustrated graphically in Fig. 1 and Fig. 2, and explained in more detail below.\nIn the classic MSSM (Fig. 1), the motion of a vehicle is typically modeled based on three layers of abstraction:\nThe highest level corresponds to the maneuver performed by the vehicle (e.g. overtake, turn right at the intersection). The variables at this level are discrete and hidden (not observable).\nWe call I the conjunction of these variables. Int therefore represents the maneuver being performed by vehicle n at time t. We call it I as Intention , since the maneuver performed by a vehicle re ects the intended maneuver of the driver.\nRR n° 8379"
        },
        {
            "heading": "6 Lefèvre & Laugier & Ibañez-Guzmàn",
            "text": "This level corresponds to the physical state of the vehicle (e.g. position, speed). The variables at this level are hidden (not observable).\nWe call Φ the conjunction of these variables. Φnt therefore represents the physical state of vehicle n at time t.\nThe lowest level corresponds to the measurements available (e.g. measurement of the vehicle's position). The variables at this level are observable. They often correspond to a noisy version of a subset of the physical variables.\nWe call Z the conjunction of these variables. Znt therefore represents the measurements of the state of vehicle n at time t.\nIn this model, what a driver is expected to do is implicitly encoded in the multi-vehicle dependencies: it is assumed that the current maneuver intention of the driver is dependent on the previous situational context , i.e. on the maneuver intention and physical state of the other vehicles (see bold arrows in Fig. 1). For example, it is assumed that a vehicle driving on the highway will - with a high probability - slow down or change lanes if the vehicle in front starts braking. Similarly, it is assumed that a driver approaching an intersection will - with a high probability - yield to vehicles with right-of-way.\nIn the proposed MSSM (Fig. 2), what a driver is expected to do is explicitly represented by the expected maneuver Ent . E n t is a conjunction of variables analogous to the intended maneuver Int : every variable in the conjunction I n t has an equivalent in the conjunction E n t . As can be seen in the graph, the expected maneuver Ent is derived from the previous situational context and has an in uence on the intended maneuver Int .\nIn both the classic MSSM and the proposed MSSM, the dependencies between the vehicles are modeled by making the current intended maneuver Int dependent on the previous situational context . The di erence is that the dependency is not direct in the proposed MSSM: the expected maneuver Ent is inserted as an intermediate. The previous situational context in uences what the driver is expected to do, which in turn in uences what the driver intends to do.\nInria\nIntention-Aware Risk Estimation for General Tra c Situations, and Application to Intersection Safety7"
        },
        {
            "heading": "3.3 Applications",
            "text": "Modeling explicitly what is expected of a vehicle at time t, as proposed above, creates new possibilities for the estimation of the risk of a situation. Instead of using the MSSM to predict the future trajectories of the vehicles, we propose to use it to jointly infer what drivers currently intend to do (It) and what they are expected to do (Et). The risk of a situation is computed based on the probability that intention and expectation do not match, given the measurements:\nP ([Int 6= Ent ]|Z0:t) (1)\nBased on Eq. 1, a variety of safety-oriented applications can be derived."
        },
        {
            "heading": "3.3.1 Detection of hazardous vehicles",
            "text": "A hazard probability can be computed for every vehicle in the scene using Eq. 1. Subsequently, actions can be triggered depending on the value of the risk. An example ADAS application would be to warn all the drivers in the area when the risk is higher than a prede ned threshold, i.e. if:\n∃n ∈ N : P ([Int 6= Ent ]|Z0:t) > λ (2)\nThe warning message could be adapted to the level of danger, so that the driver is aware of the urgency of the situation. If autonomous braking is considered, the deceleration could be adapted to the risk value."
        },
        {
            "heading": "3.3.2 Risk of a speci c maneuver",
            "text": "The risk of a speci c maneuver Int can be computed for a vehicle n:\nP ( N⋃ m=1 [Imt 6= Emt ]|Int Z0:t) (3)\nThis is an important feature for autonomous driving, but also for ADAS. One application is to nd the best escape maneuver in a dangerous situation. Another one is to assist the driver for tasks such as changing lanes on the highway or negotiating an intersection by computing the risk of each possible maneuver and informing the driver about how safe each maneuver is."
        },
        {
            "heading": "3.3.3 Other applications",
            "text": "The proposed model can be used to estimate the intended maneuver of a driver, or to predict future trajectories. These are useful features for numerous applications which need to reason about tra c situations [21]."
        },
        {
            "heading": "4 Application to road intersections",
            "text": "The model presented in the previous section could in theory be applied to any tra c situations, by de ning the variables Int , E n t , Z n t , and Φ n t accordingly. This section presents its application to unsignalized road intersections, i.e. intersections ruled by anything but tra c lights (stop, give-way, priority to the right). More speci cally we address accidents caused by tra c sign\nRR n° 8379"
        },
        {
            "heading": "8 Lefèvre & Laugier & Ibañez-Guzmàn",
            "text": "violations. Driver error in the lateral direction (such as hazardous lane changes) is not addressed in this work.\nThe description of the algorithm follows the Bayesian Programming formalism [22]: rst the variables are de ned, then the proposed joint distribution, the parametric forms, and nally the calculation of risk."
        },
        {
            "heading": "4.1 Variable de nition",
            "text": "This section proposes de nitions for the intended maneuver Int , the expected maneuver E n t , the physical state Φnt , and the measurements Z n t , in the context of road intersections."
        },
        {
            "heading": "4.1.1 Intended maneuver",
            "text": "As was mentioned above, the focus of this work is on errors in the longitudinal execution of the maneuver. Since we want to be able to reason on the lateral motion and on the longitudinal motion separately, we make a distinction between the lateral and longitudinal components of a maneuver in our speci cation of the intended maneuver Int . Lateral component: For the lateral component we exploit the fact that intersections are highly structured areas where the lateral motion of vehicles is constrained by the geometry and the topology of the intersection. It is assumed that a digital map of the road network is available. From this digital map we extract a set of courses , where a course is de ned for each authorized maneuver at the intersection as the typical path that is followed by a vehicle when executing that particular maneuver. The concept of a course is illustrated in Fig. 3. The variable representing the lateral component of a maneuver is de ned as:\nIcnt ∈ {ci}i=1:NC : the driver's intended lateral motion, which will also be called the driver's intended course in the context of road intersections. It corresponds to the course followed by vehicle n at time t. {ci}i=1:NC is the set of possible courses at the intersection, extracted from the digital map.\nLongitudinal component: For the longitudinal component we exploit the fact that intersections are highly structured areas where the longitudinal motion of vehicles is constrained by the geometry and the topology of the intersection as well as by the tra c rules. For a vehicle n at time t we de ne two possible intentions with respect to the motion in the longitudinal direction: go and stop. The variable representing the longitudinal component of a maneuver is de ned as:\nInria\nIntention-Aware Risk Estimation for General Tra c Situations, and Application to Intersection Safety9\nIsnt ∈ {go, stop}: the driver's intended longitudinal motion, which will also be called the driver's intention to stop in the context of road intersections. It corresponds to the driver's intention regarding the longitudinal execution of the maneuver.\nIsnt = go means that the driver intends to adapt its speed to the layout of the intersection only. In other words, the driver intends to negotiate the intersection as if there were no constraints from the tra c rules (stop, give-way). This is typically the case for vehicles which have priority: drivers will adapt their speed to the topology and the geometry of the intersection (slowing down to make a turn) but will not slow down to stop or yield to another vehicle.\nIsnt = stop means that the driver intends to adapt its speed to the layout of the intersection (similarly to Isnt = go), but will also adapt his speed so that he can stop at the intersection. Typically, this behavior will be adopted by vehicles approaching a stop intersection with the intention to respect the stop, and by vehicles which do not have the right-of-way and intend to yield to another vehicle.\n4.1.2 Expected maneuver Ent\nIn the general framework presented in Sec. 3, each variable in the conjunction Int has an equivalent in the conjunction Ent . The purpose is twofold: to model the in uences of the surrounding vehicles on the maneuver performed by a vehicle, and to compute the risk based on the probability that the expected maneuver and the intended maneuver do not match. If this principle is applied to our problem, the expected maneuver Ent should contain two variables: the expected lateral motion (analogous to Icnt ) and the expected longitudinal motion (analogous to Isnt ). However in our case it is not necessary to include an expected lateral motion variable, for two reasons. The rst reason is that in the context of road intersections the dependencies between the vehicles mostly concern the longitudinal motion: whether a driver will stop or not at the intersection is in uenced by the presence of other vehicles, but the course followed by a driver is not. Therefore it is reasonable to assume independence between the lateral motion of vehicles. The second reason is that, as mentioned earlier, this work addresses risks in the longitudinal direction only.\nFor a vehicle n at time t we de ne the following variable:\nEsnt ∈ {go, stop}: the expected longitudinal motion, which will also be called the expectation to stop in the context of road intersections. It corresponds to the expected longitudinal motion of the vehicle according to the tra c rules.\nThe de nitions of Esnt = go and Es n t = stop are analogous to the de nitions provided for Isnt = go and Is n t = stop in the previous section; the only di erence is that is corresponds to what the driver should do (according to the tra c rules) instead of what he intends to do:\nEsnt = go means that the driver should adapt his speed to the layout of the intersection only.\nEsnt = stop means that the driver should adapt his speed to the layout of the intersection, and should also adapt his speed so that he can stop at the intersection.\nRR n° 8379\n10 Lefèvre & Laugier & Ibañez-Guzmàn\n4.1.3 Measurements Znt\nIn this work, the following measurements of the state of a vehicle n ∈ N at time t are available:\nPmnt = (Xm n t Y m n t θm n t ) ∈ R3: the measured pose, i.e. the position and orientation of the vehicle in the Universal Transverse Mercator (UTM) coordinate system.\nSmnt ∈ R: the measured speed of the vehicle.\nFor the experimental validation (see Sec. 5.3), this information originates from the vehicles' proprioceptive sensors and is shared via Vehicle-to-Vehicle wireless communication. However, the method can be applied independently of the type of sensors that are used to observe the scene."
        },
        {
            "heading": "4.1.4 Physical state Φnt",
            "text": "Based on the available measurements (see previous section), the following variables are selected to represent the physical state of a vehicle n ∈ N at time t:\nPnt = (X n t Y n t θ n t ) ∈ R3: the true pose of the vehicle.\nSnt ∈ R: the true speed of the vehicle."
        },
        {
            "heading": "4.1.5 Summary and notations",
            "text": "The variables of our MSSM were de ned by adapting the general model proposed in Sec. 3 to the context of road intersections. The following variables were de ned for a vehicle n ∈ N at time t:\nFor the intended maneuver: Int = (Ic n t Is n t )\nFor the expected maneuver: Ent = Es n t\nFor the measurements: Znt = (Pm n t Sm n t )\nFor the physical state: Φnt = (P n t S n t )\nThe variables Znt and Φ n t were de ned according to the measurements available, and the variables Int and E n t were de ned with the objective to detect dangerous situations at a road intersection by comparing driver intention and driver expectation, as illustrated in Fig. 4 with some example scenarios. In the next sections we carry on with the speci cation of the model, still following the Bayesian Programming formalism. For more clarity in the equations, in the remainder of this report a bold symbol will be used to represent the conjunction of variables for all the vehicles in the scene. For example, for a variable X:\nX , (X1...XN ) (4)\nwith Xn the variable associated with vehicle n.\nInria\nIntention-Aware Risk Estimation for General Tra c Situations, and Application to Intersection Safety11"
        },
        {
            "heading": "4.2 Joint distribution",
            "text": "For the general model proposed in Fig. 2, the joint distribution over all the vehicles is as follows:\nP (E0:TI0:TΦ0:TZ0:T) = P (E0I0Φ0Z0)\n× T∏ t=1 × N∏ n=1 [ P (Ent |It−1Φt−1)× P (Int |Φnt−1Int−1Ent )\n×P (Φnt |Φnt−1Int−1Int )× P (Znt |Φnt ) ]\n(5)\nIn this section we adapt this general model to road intersection situations, with the variables de ned in the previous section. We start by making the following classic independence assumptions:\nFor the intended maneuver: The current intended lateral motion and intended longitudinal motion are conditionally independent given (Φnt−1I n t−1E n t ). Therefore the following simpli cation is obtained:\nP (Int |Φnt−1Int−1Ent ) = P (Icnt |Φnt−1Int−1Ent )× P (Isnt |Φnt−1Int−1Ent ) (6)\nFor the physical state: The current pose and current speed are conditionally independent given (Φnt−1I n t−1I n t ). Therefore the following simpli cation is obtained:\nP (Φnt |Φnt−1Int−1Int ) = P (Pnt |Φnt−1Int−1Int )× P (Snt |Φnt−1Int−1Int ) (7)\nFor the measurements: A classic sensor model is used, i.e. the measurements are conditionally independent given the physical quantities they are associated with. Therefore the following simpli cation is obtained:\nP (Znt |Φnt ) = P (Pmnt |Pnt )× P (Smnt |Snt ) (8)\nAfter applying these independence assumptions, and taking into account that Ent = Es n t ,\nthe joint distribution (Eq. 5) becomes:\nRR n° 8379"
        },
        {
            "heading": "12 Lefèvre & Laugier & Ibañez-Guzmàn",
            "text": "P (E0:TI0:TΦ0:TZ0:T) = P (E0I0Φ0Z0)\n× T∏ t=1 × N∏ n=1 [P (Esnt |It−1Φt−1) × P (Icnt |Φnt−1Int−1Esnt )× P (Isnt |Φnt−1Int−1Esnt ) × P (Pnt |Φnt−1Int−1Int )× P (Snt |Φnt−1Int−1Int ) ×P (Pmnt |Pnt )× P (Smnt |Snt )] (9)"
        },
        {
            "heading": "4.3 Parametric forms",
            "text": "In this section the parametric forms of the conditional probability terms in Eq. 9 are described, along with the hypotheses they build on.\n4.3.1 Expected longitudinal motion Esnt\nThe expected longitudinal motion of a vehicle is derived from the previous intended course, pose and speed of all the vehicles in the scene:\nP (Esnt |It−1Φt−1) = P (Esnt |Ict−1Pt−1St−1) (10)\nWhat is expected of vehicles on the road is regulated by tra c rules, but a lot is left to the judgment of drivers. If we take as an example give-way intersections in France, the rules specify that the driver which does not have the right-of-way must yield to vehicles driving on the other road(s) and make sure there is no danger before entering the intersection [23]. There exists no formula to calculate whether it is legal or not for a driver to enter an intersection at time t in a speci c context. Instead, our expectation model is based on typical driver behavior, i.e. on a statistical analysis of what drivers consider to be acceptable. The necessity for a vehicle to stop given the context is derived using probabilistic gap acceptance models [24, 25]:\nP ([Esnt = stop]|[Ict−1 = ct−1][Pt−1 = pt−1][St−1 = st−1]) = f(ct−1, pt−1, st−1) (11)\nwith ct−1 the conjunction of courses for the N vehicles in the scene, pt−1 the conjunction of positions for the N vehicles in the scene, st−1 the conjunction of speeds for the N vehicles in the scene, and f a function which computes the probability that the gap available for vehicle n to execute its maneuver is su cient given the previous situational context (ct−1, pt−1, st−1). For a vehicle n heading towards a give-way intersection, the calculation is detailed below:\ni. Project forward (or backward) the position of vehicle n until the time tn when it reaches the intersection, using the vehicle's previous state (cnt−1, p n t−1, s n t−1) and a constant speed\nmodel.\nii. Let VROW be the set of vehicles whose maneuvers have the right-of-way w.r.t. the maneuver of vehicle n. For each vehicle m ∈ VROW project forward (or backward) the position of vehicle m until the time tm when it reaches the intersection, using the vehicle's previous state (cmt−1, p m t−1, s m t−1) and a constant speed model.\nInria\nIntention-Aware Risk Estimation for General Tra c Situations, and Application to Intersection Safety13\niii. Find the vehicle k ∈ VROW which is the most likely to cause vehicle n to stop, by nding the smallest positive time gap available for vehicle n to execute its maneuver:k = arg minm∈VROW (t m − tn), for tm − tn ≥ 0\ngmin = t k − tn\n(12)\niv. The necessity for vehicle n to stop at the intersection is calculated as the probability that the gap gmin is not su cient, using a probabilistic gap acceptance model ([24] for merging cases, [25] for left turn across path cases).\nFor a vehicle approaching a stop intersection the calculation is similar, except the probability that the vehicle is expected to stop is set to 1 until it reaches the intersection (i.e. P ([Esnt = stop]|Ict−1Pt−1St−1) = 1), and after that point the last two steps of the calculation above are used (i.e. steps 3 and 4). This context-aware reasoning about the necessity for a vehicle to stop at the intersection will allow us to detect vehicles running stop signs, or vehicles entering an intersection when they should have waited for another vehicle to pass (as illustrated earlier in Fig. 4).\n4.3.2 Intended longitudinal motion Isnt\nA number of di erent strategies could be applied for the intended longitudinal motion model, to model drivers' habits in terms of compliance with tra c rules. In this work, the evolution model is based on the comparison between the previous intention Isnt−1 and the current expectation Esnt :\nP (Isnt |Φnt−1Int−1Esnt ) = P (Isnt |Isnt−1Esnt ) (13)\nIf the driver's intention at time t − 1 coincides with what is currently expected of him, it is assumed that the driver will comply with a probability Pcomply. Otherwise a uniform prior (0.5) is assumed:\nIsnt−1 Es n t P ([Is n t = go]|Isnt−1Esnt )\ngo go Pcomply go stop 0.5 stop go 0.5 stop stop 1.0− Pcomply\nThe probability Pcomply is set to Pcomply = 0.9 to re ect our assumption that chances are high that the driver will comply, but ideally it should be learned from data.\n4.3.3 Intended lateral motion Icnt\nIn the general case of a vehicle driving from point A to point B on the road network, the lateral motion will change with time as one maneuver is performed after another. In this work the focus is on road intersections, and the possible lateral motions were de ned as a set of possible courses. Courses cover the entire maneuver at the intersection (approaching phase + execution\nRR n° 8379"
        },
        {
            "heading": "14 Lefèvre & Laugier & Ibañez-Guzmàn",
            "text": "inside the intersection + exit phase), and there is no reason to believe that a driver will change his mind about the course he wants to follow. For this reason, it is assumed that the probability of a course at time t is dependent on the previous intended course only (Eq. 14) and that drivers keep the same intention between two timesteps with probability Psame, all the other courses being equally probable (Eq. 15).\nP (Isnt |Φnt−1Int−1Esnt ) = P (Icnt |Icnt−1) (14)\nP ([Icnt = c n t ]|[Icnt−1 = cnt−1]) =\n{ Psame if c n t = c n t−1\n1.0−Psame NC−1 otherwise\n(15)\nThe value of Psame was set manually to Psame = 0.9 to indicate that drivers rarely change their intended course, but should ideally be learned from data.\n4.3.4 Pose Pnt\nIt is assumed that a vehicle performing a maneuver will follow the course corresponding to that maneuver. The evolution of the pose of a vehicle is computed from its previous pose, previous speed, and current intended course:\nP (Pnt |Φnt−1Int ) = P (Pnt |Pnt−1Snt−1Icnt ) (16) The likelihood of a pose is de ned as a trivariate normal distribution with no correlation between x, y and θ:\nP (Pnt |[Pnt−1 = pnt−1][Snt−1 = snt−1][Icnt = cnt−1]) = N (µxyθ(pnt−1, snt−1, cnt−1), σxyθ) (17)\nwhere µxyθ(p n t−1, s n t−1, c n t−1) is a function which computes the mean pose (µx, µy, µθ), and σxyθ = (σx, σy, σθ) is the standard deviation. The mean pose of the vehicle is computed from the previous pose, the previous speed, and the current maneuver intention as the average between two poses: the rst one is obtained through a constant velocity model, the second one is obtained by projecting the rst one orthogonally on the exemplar path. This average provides a compromise between the current pose of the vehicle and the ideal pose that the vehicle would have if following the exemplar path.\n4.3.5 Speed Snt\nIt is assumed that drivers adapt their speed to their intentions and to the geometry of the road. The evolution of the speed of a vehicle is computed from its previous speed, previous pose, and current intended maneuver:\nP (Snt |Φnt−1Int ) = P (Snt |Snt−1Pnt−1Icnt Isnt ) (18) The distribution on Snt is assumed normal and de ned as:\nP (Snt |[Snt−1 = snt−1][Pnt−1 = pnt−1][Icnt = cnt ][Isnt = isnt ]) = N (µs(snt−1, pnt−1, cnt , isnt ), σs(snt−1, pnt−1, cnt , isnt )) (19)\nInria\nIntention-Aware Risk Estimation for General Tra c Situations, and Application to Intersection Safety15\nwhere µs(s n t−1, p n t−1, c n t , is n t ) is a function which computes the mean speed and σs(s n t−1, p n t−1, c n t , is n t ) is a function which computes the standard deviation. The mean speed is computed as a function of the previous speed, the previous pose, the current course intention, and the current intention to stop, using a set of typical speed pro les. These speed pro les are created based on generic speed pro les of vehicles negotiating intersections found in the literature [26]. These generic speed pro les are automatically modi ed in our algorithm to match the speed limit and the geometry of the intersection of interest (e.g. the speed is made dependent on the curvature of the course). Moreover the calculation of the mean speed accounts for some variations in the driving styles, by taking into account the previous speed of the vehicle snt−1. The predicted speed pro le will therefore adapt to sporty drivers as well as to more relaxed drivers.\n4.3.6 Measured pose Pmnt\nA classic sensor model is assumed, with a trivariate normal distribution centered on the true state and with no correlation between x, y and θ:\nP (Pmnt |[Pnt = pnt ]) = N (pnt , σxyθ) (20)\n4.3.7 Measured speed Smnt\nA classic sensor model is assumed, with a normal distribution centered on the true state:\nP (Smnt |[Snt = snt ]) = N (snt , σs) (21)"
        },
        {
            "heading": "4.3.8 Summary",
            "text": "Throughout this section a number of independence assumptions were made. As a result the joint distribution in Eq. 9 becomes:\nP (E0:TI0:TΦ0:TZ0:T) = P (E0I0Φ0Z0)\n× T∏ t=1 × N∏ n=1 [P (Esnt |Ict−1Pt−1St−1) × P (Icnt |Icnt−1)× P (Isnt |Isnt−1Esnt ) × P (Pnt |Pnt−1Snt−1Icnt )× P (Snt |Snt−1Pnt−1Icnt Isnt ) ×P (Pmnt |Pnt )× P (Smnt |Snt )] (22)"
        },
        {
            "heading": "4.4 Bayesian risk estimation",
            "text": "The equation for risk estimation is given in Eq. 1 for general tra c situations. When applied to our problem, the principle of comparing intention and expectation leads to computing the risk based on the probability that a driver does not intend to stop at the intersection while he is expected to:\nRR n° 8379"
        },
        {
            "heading": "16 Lefèvre & Laugier & Ibañez-Guzmàn",
            "text": "P ([Isnt = go][Es n t = stop]|Pm0:tSm0:t) (23)\nExact inference on such a non-linear non-Gaussian model is not tractable. Here, approximate inference is performed using the classic bootstrap lter [27]. For two vehicles, we found that a good compromise between computation time and quality of the estimation was achieved for a number of particles Nparticles = 400."
        },
        {
            "heading": "5 Results",
            "text": ""
        },
        {
            "heading": "5.1 Evaluation strategy",
            "text": "Evaluating the performance of risk assessment algorithms is not straightforward: the ground truth of the risk of a situation is not available, therefore the evaluation cannot be conducted on the output of the algorithm directly. Instead it is generally conducted at the application level by applying a threshold on the risk value to separate dangerous and non-dangerous situations. The algorithm is then evaluated based on:\n1. The rate of false alarms, i.e. non-dangerous situations classi ed as dangerous by the algorithm,\n2. The rate of missed detections, i.e. dangerous situations classi ed as non-dangerous by the algorithm,\n3. The collision prediction horizon, i.e. how early before a collision the algorithm is able to classify the situation as dangerous. The collision prediction horizon Tprediction is de ned as:\nTprediction = tcollision − tdetection (24)\nwith tcollision the time at which the collision happens and tdetection the earliest time when the situation is classi ed as dangerous by the algorithm.\nThroughout this section, dangerous and non-dangerous situations are classi ed using the hazard probability criterion introduced in Sec. 3.3.1. The idea is to compute a hazard probability\nInria\nIntention-Aware Risk Estimation for General Tra c Situations, and Application to Intersection Safety17\nfor every vehicle in the scene by comparing the driver's intention Isnt with the expectation Es n t . Subsequently a situation is classi ed as dangerous if the hazard probability is higher than a threshold for at least one vehicle, i.e. i :\n∃n ∈ N : P ([Isnt = go][Esnt = stop]|Pm0:tSm0:t) > λ (25) The threshold λ is set with the double objective to detect dangerous situations as early as possible and to avoid false alarms in non-dangerous situations. After a recall and precision analysis, λ = 0.3 was found to be the optimal value and was used in all the experiments.\nTests were run both in simulation and with real vehicles, and the results are reported in the next two sections."
        },
        {
            "heading": "5.2 Simulations",
            "text": ""
        },
        {
            "heading": "5.2.1 Scenarios",
            "text": "The approach was evaluated in simulation at a two-way stop intersection for seven collision scenarios. The scenarios are illustrated in Fig. 5. All of them involve a Priority Vehicle (PV) driving on the main road and an Other Vehicle (OV) performing a dangerous maneuver. These scenarios were selected because they cover 70% of all accident scenarios at road intersections in Europe [2]. Four maneuvers are considered for the OV: merging right, merging left, crossing, and left turn across path. For each of these maneuvers except for the last one, there is a priority violation scenario and a stop violation scenario. A priority violation scenario is a situation where the OV stops at the stop line but then proceeds into the intersection when it should have yielded to the PV, causing an accident1. A stop violation scenario is a situation where the OV does not stop at the stop sign, causing an accident2. There is no stop violation scenario for the left turn across path maneuver since the regulation does not require the OV to stop when executing this maneuver. A total of 240 instances of these scenarios were simulated, by varying the speed pro les of the OV and the synchronization between the trajectories of the two vehicles..\nThe same number of instances was simulated for equivalent non-dangerous scenarios. Trajectories were generated for the same con gurations as in Fig. 5, this time without violating the tra c rules and with a safety distance of 3 seconds: the vehicles were always at least 3 seconds apart when passing the point where their paths intersected."
        },
        {
            "heading": "5.2.2 Results",
            "text": "There were no false alarms and no missed detections. Collision prediction horizon: Fig. 6 shows the percentage of detected collisions as a function of the time remaining before the collision, for the 240 dangerous tests. The graph show that every collision in the dataset was predicted at least 0.6 s before it occurred, and that a majority of collisions were predicted between 2 s and 3 s ahead of time. In 80% of the cases the algorithm was able to predict collisions at least 2 s before they occurred. This opens possibilities for accident avoidance and mitigation, by triggering relevant actions on a vehicle after a danger has been detected [28].\n1Such accidents are typically caused by the driver of the OV failing to notice the PV, or misjudging the speed and distance of the PV [2].\n2Such accidents are typically caused by the driver of the OV failing to notice the presence of the stop sign, or choosing to ignore it [2].\nRR n° 8379"
        },
        {
            "heading": "18 Lefèvre & Laugier & Ibañez-Guzmàn",
            "text": "Impact of the type of violation: In order to analyze the in uence of the type of violation on the performance of our algorithm, results for priority violation scenarios are compared with results for stop violation scenarios in Fig. 7. On average, collisions which are caused by a stop violation are detected 1 s earlier than the ones caused by a priority violation. All of them are detected more than 1.5 s before the crash, against 0.6 s for priority violations. This is explained by the fact the OV's intention to violate the stop is given away by the evolution of the vehicle's speed while it is approaching the intersection, while priority violations can be detected only as the OV accelerates to enter the intersection.\nImpact of the type of maneuver: In order to analyze the in uence of the type of maneuver executed by the OV on the performance of our algorithm, results for the four maneuvers present in our dataset are compared in Fig. 8: merging right, merging left, crossing, and left turn across path. The graph shows that 100% of the collisions are predicted at least 1.5 s before they occur for crossing and merging maneuvers. This means that all the collisions which were detected less than 1.5 s in advance in the previous graphs (Fig. 6 and Fig. 7) correspond to left turn across path maneuvers. These results highlight the fact that collisions caused by a priority violation during a left turn across path maneuver are more di cult to predict than other collisions. Indeed, contrary to crossing and merging maneuvers there is no marking on the road to indicate where a vehicle making a left turn across path should stop to yield to a vehicle with right-of-way. As a result there is a lot of variation in the way vehicles execute a left turn across path maneuver, and this makes it more challenging to estimate the intentions of drivers. The high variation in driver behavior during left turn across path maneuvers has been pointed out in the past by other works [25]."
        },
        {
            "heading": "5.3 Field trials",
            "text": ""
        },
        {
            "heading": "5.3.1 Experimental setup",
            "text": "Two passenger vehicles were equipped with o -the-shelf Vehicle-to-Vehicle communication modems (802.11p) and shared their pose and speed information at a rate of 10 Hz. In each vehicle the pose and speed information was obtained via a GPS + IMU unit with a precision of σ = 2m for the position. In its current non-optimized state the risk estimation algorithm runs at 10 Hz\nInria\nIntention-Aware Risk Estimation for General Tra c Situations, and Application to Intersection Safety19\nRR n° 8379"
        },
        {
            "heading": "20 Lefèvre & Laugier & Ibañez-Guzmàn",
            "text": "on a dedicated dual core 2.26 GHz processor PC. The test vehicles were not equipped with autonomous emergency braking functions. Instead, an auditory and a visual warning were triggered whenever the algorithm detected a dangerous situation."
        },
        {
            "heading": "5.3.2 Scenarios",
            "text": "Experiments were conducted at a T-shaped give-way intersection for two collision scenarios. The scenarios are illustrated in Fig. 9. All of them involve a Priority Vehicle (PV) driving on the main road and an Other Vehicle (OV) performing a dangerous maneuver. In these scenarios, emergency braking is the only way to avoid an accident, therefore we expect the application to issue a warning as early as possible.\nNon-dangerous tests were also run, using the same con gurations as in Fig. 9 but this time without violating the tra c rules.\nIn total 90 dangerous and 20 non-dangerous tests were run. We alternated between 6 di erent drivers both for the PV and the OV. In order to generate some diversity in the scenario instances, the drivers of the OV were not given precise instructions about the execution of the maneuvers; they were told to execute the maneuver in a manner that they felt was dangerous or nondangerous. Out of the 90 dangerous trials, 60 were performed with the warning system running on the PV, and 30 with the warning system running on the OV."
        },
        {
            "heading": "5.3.3 Results",
            "text": "In the 20 non-dangerous tests there was no false alarm, i.e. no warning was ever triggered by the system.\nFor every of the 90 dangerous tests, the system was able to issue a warning early enough that the driver avoided the collision by braking. Fig. 10 shows a sample dangerous left turn across path scenario during which we recorded the view from inside the PV. The danger is detected as soon as the OV starts to execute the left turn. The driver of the PV receives a warning indicating that a dangerous situation was detected and that the danger comes from a vehicle on the left side.\nSince we did not create real collisions, the statistical analysis about the collision prediction horizon that was performed on the simulated data cannot be performed on the real data. However, the eld trials proved that our approach can operate with success in real-life situations where passenger vehicles share data via a Vehicle-to-Vehicle wireless link.\nInria\nIntention-Aware Risk Estimation for General Tra c Situations, and Application to Intersection Safety21"
        },
        {
            "heading": "6 Conclusions",
            "text": "In this work a probabilistic framework was proposed to reason about the motion of vehicles and the associated risk in general tra c situations. The intentions of drivers are explicitly modeled, as well as what the tra c rules expect of drivers in the current situation. Risk is then computed as the probability that intentions and expectations do not match, given the available observations. As opposed to state art approaches relying on trajectory prediction the proposed approach reasons on risk at a semantic level. As a result it can run in real-time without having to assume independence between vehicles.\nThis general framework was implemented and tested in the context of unsignalized road intersections. The necessity for a driver to stop at an intersection is represented in the model, as well as the driver's intention to comply. In order to compute the risk, inference on these two variables is performed given measurements of the pose and speed of all the vehicles in the scene. The model takes into account the mutual in uences between the maneuvers performed by the vehicles, and can be used with an arbitrary number of vehicles. It models the in uence of the topology and the geometry of the intersection on the behavior of a vehicle (position, speed), and therefore can automatically adapt to any intersection layout.\nTests were conducted in simulation for collision scenarios at a two-way stop intersection, and with passenger vehicles equipped with o -the-shelf Vehicle-to-Vehicle communication modems at a T-shaped give-way intersection. The results show that the algorithm is able to detect dangerous situations in real-time for di erent types of collision scenarios and di erent driving styles.\nIn order to show the applicability of the comparing intentions and expectations risk estimation algorithm, future work will include the implementation of that approach in the context of highway driving. Another line of research will be the addition of learning components so that the model adapts to di erent drivers."
        },
        {
            "heading": "22 Lefèvre & Laugier & Ibañez-Guzmàn",
            "text": "[4] S. Worrall, D. Orchansky, F. Masson, and E. Nebot, Improving vehicle safety using context based detection of risk, in Proc. IEEE Intelligent Transportation Systems Conference, 2010, pp. 379 385.\n[5] A. Chinea and M. Parent, Risk assessment algorithms based on recursive neural networks, in Proc. International Joint Conference on Neural Networks, 2007, pp. 1434 1440.\n[6] F. D. Salim, S. W. Loke, A. Rakotonirainy, B. Srinivasan, and S. Krishnaswamy, Collision pattern modeling and real-time collision detection at road intersections, in Proc. IEEE Intelligent Transportation Systems Conference, 2007, pp. 161 166.\n[7] S. Ammoun and F. Nashashibi, Real time trajectory prediction for collision risk estimation between vehicles, in Proc. IEEE Intelligent Computer Communication and Processing, 2009, pp. 417 422.\n[8] T. Batz, K. Watson, and J. Beyerer, Recognition of dangerous situations within a cooperative group of vehicles, in Proc. IEEE Intelligent Vehicles Symposium, 2009, pp. 907 912.\n[9] M. Brännström, E. Coelingh, and J. Sjöberg, Model-based threat assessment for avoiding arbitrary vehicle collisions, IEEE Transactions on Intelligent Transportation Systems, vol. 11, no. 3, pp. 658 669, 2010.\n[10] A. Eidehall and L. Petersson, Statistical threat assessment for general road scenes using Monte Carlo sampling, IEEE Transactions on Intelligent Transportation Systems, vol. 9, no. 1, pp. 137 147, 2008.\n[11] J. Hillenbrand, A. M. Spieker, and K. Kroschel, A multilevel collision mitigation approach: situation assessment, decision making, and performance tradeo s, IEEE Transactions on Intelligent Transportation Systems, vol. 7, no. 4, pp. 528 540, 2006.\n[12] A. Polychronopoulos, M. Tsogas, A. Amditis, and L. Andreone, Sensor fusion for predicting vehicles' path for collision avoidance systems, IEEE Transactions on Intelligent Transportation Systems, vol. 8, no. 3, pp. 549 562, 2007.\n[13] G. S. Aoude, B. D. Luders, D. S. Levine, and J. P. How, Threat-aware path planning in uncertain urban environments, in Proc. IEEE/RSJ International Conference on Intelligent Robots and Systems, 2010, pp. 6058 6063.\n[14] G. S. Aoude, B. D. Luders, K. K. H. Lee, D. S. Levine, and J. P. How, Threat assessment design for driver assistance system at intersections, in Proc. IEEE Intelligent Transportation Systems Conference, 2010, pp. 25 30.\n[15] C. Laugier, I. Paromtchik, M. Perrollaz, M. Yong, J. Yoder, C. Tay, K. Mekhnacha, and A. Negre, Probabilistic analysis of dynamic scenes and collision risks assessment to improve driving safety, IEEE Intelligent Transportation Systems Magazine, vol. 3, no. 4, pp. 4 19, 2011.\n[16] M. Altho and A. Mergel, Comparison of Markov chain abstraction and Monte Carlo simulation for the safety assessment of autonomous cars, IEEE Transactions on Intelligent Transportation Systems, vol. 12, no. 4, pp. 1237 1247, 2011.\n[17] G. Agamennoni, J. I. Nieto, and E. M. Nebot, Estimation of multivehicle dynamics by considering contextual information, IEEE Transactions on Robotics, vol. 28, no. 4, pp. 855 870, 2012.\nInria\nIntention-Aware Risk Estimation for General Tra c Situations, and Application to Intersection Safety23\n[18] T. Gindele, S. Brechtel, and R. Dillmann, A probabilistic model for estimating driver behaviors and vehicle trajectories in tra c environments, in Proc. IEEE Intelligent Transportation Systems Conference, 2010, pp. 1625 1631.\n[19] N. Oliver and A. P. Pentland, Graphical models for driver behavior recognition in a SmartCar, in Proc. IEEE Intelligent Vehicles Symposium, 2000, pp. 7 12.\n[20] S. Lefèvre, C. Laugier, and J. Ibañez-Guzmán, Risk assessment at road intersections: comparing intention and expectation, in Proc. IEEE Intelligent Vehicles Symposium, 2012, pp. 165 171.\n[21] L. Fletcher, S. Teller, E. Olson, D. Moore, Y. Kuwata, J. How, J. Leonard, I. Miller, M. Campbell, D. Huttenlocher, A. Nathan, and F. Kline, The MIT-Cornell collision and why it happened, Journal of Field Robotics, vol. 25, pp. 775 807, 2008.\n[22] O. Lebeltel, P. Bessiere, J. Diard, and E. Mazer, Bayesian robot programming, Autonomous Robots, vol. 16, no. 1, pp. 49 79, 2004.\n[23] Code de la route français - Article R415-7, available at http://www.legifrance.gouv.fr. [Accessed 5 Dec. 2012].\n[24] A. Spek, P. Wieringa, and W. Janssen, Intersection approach speed and accident probability, Transportation Research Part F: Tra c Psychology and Behaviour, vol. 9, no. 2, pp. 155 171, 2006.\n[25] D. R. Ragland, A. So a, S. E. Shladover, and J. A. Misener, Gap acceptance for vehicles turning left across on-coming tra c: implications for intersection decision support design, in Proc. Transportation Research Board Annual Meeting, 2006.\n[26] H. Berndt, S. Wender, and K. Dietmayer, Driver braking behavior during intersection approaches and implications for warning strategies for driver assistant systems, in Proc. IEEE Intelligent Vehicles Symposium, 2007, pp. 245 251.\n[27] M. S. Arulampalam, S. Maskell, N. Gordon, and T. Clapp, A tutorial on particle lters for online nonlinear/non-Gaussian Bayesian tracking, IEEE Transactions on Signal Processing, vol. 50, no. 2, pp. 174 188, 2002.\n[28] S. Lefèvre, C. Laugier, and J. Ibañez-Guzmán, Evaluating risk at road intersections by detecting con icting intentions, in Proc. IEEE/RSJ International Conference on Intelligent Robots and Systems, 2012, pp. 4841 4846.\nRR n° 8379\nRESEARCH CENTRE GRENOBLE – RHÔNE-ALPES\nInovallée 655 avenue de l’Europe Montbonnot 38334 Saint Ismier Cedex\nPublisher Inria Domaine de Voluceau - Rocquencourt BP 105 - 78153 Le Chesnay Cedex inria.fr\nISSN 0249-6399"
        }
    ],
    "title": "Intention-Aware Risk Estimation for General Traffic Situations, and Application to Intersection Safety",
    "year": 2025
}