{
    "abstractText": "In recent years there have been many successes of using deep representations in reinforcement learning. Still, many of these applications use conventional architectures, such as convolutional networks, LSTMs, or auto-encoders. In this paper, we present a new neural network architecture for model-free reinforcement learning. Our dueling network represents two separate estimators: one for the state value function and one for the state-dependent action advantage function. The main benefit of this factoring is to generalize learning across actions without imposing any change to the underlying reinforcement learning algorithm. Our results show that this architecture leads to better policy evaluation in the presence of many similar-valued actions. Moreover, the dueling architecture enables our RL agent to outperform the state-of-the-art on the Atari 2600 domain.",
    "authors": [
        {
            "affiliations": [],
            "name": "Ziyu Wang"
        },
        {
            "affiliations": [],
            "name": "Tom Schaul"
        },
        {
            "affiliations": [],
            "name": "Matteo Hessel"
        },
        {
            "affiliations": [],
            "name": "Hado van Hasselt"
        },
        {
            "affiliations": [],
            "name": "Marc Lanctot"
        }
    ],
    "id": "SP:6e6223004337b149be7dbb2a2f4b69888188831f",
    "references": [
        {
            "authors": [
                "J. Ba",
                "V. Mnih",
                "K. Kavukcuoglu"
            ],
            "title": "Multiple object recognition with visual attention",
            "venue": "In ICLR,",
            "year": 2015
        },
        {
            "authors": [
                "L.C. Baird"
            ],
            "title": "Advantage updating",
            "venue": "Technical Report WLTR-93-1146, Wright-Patterson Air Force Base,",
            "year": 1993
        },
        {
            "authors": [
                "M.G. Bellemare",
                "Y. Naddaf",
                "J. Veness",
                "M. Bowling"
            ],
            "title": "The arcade learning environment: An evaluation platform for general agents",
            "venue": "Journal of Artificial Intelligence Research,",
            "year": 2013
        },
        {
            "authors": [
                "M.G. Bellemare",
                "G. Ostrovski",
                "A. Guez",
                "P.S. Thomas",
                "R. Munos"
            ],
            "title": "Increasing the action gap: New operators for reinforcement learning",
            "venue": "In AAAI,",
            "year": 2016
        },
        {
            "authors": [
                "Y. Bengio",
                "N. Boulanger-Lewandowski",
                "R. Pascanu"
            ],
            "title": "Advances in optimizing recurrent networks",
            "venue": "In ICASSP,",
            "year": 2013
        },
        {
            "authors": [
                "K. Fukushima"
            ],
            "title": "Neocognitron: A self-organizing neural network model for a mechanism of pattern recognition unaffected by shift in position",
            "venue": "Biological Cybernetics,",
            "year": 1980
        },
        {
            "authors": [
                "X. Guo",
                "S. Singh",
                "H. Lee",
                "R.L. Lewis",
                "X. Wang"
            ],
            "title": "Deep learning for real-time Atari game play using offline Monte-Carlo tree search planning",
            "venue": "In NIPS,",
            "year": 2014
        },
        {
            "authors": [
                "M.E. Harmon",
                "L.C. Baird"
            ],
            "title": "Multi-player residual advantage learning with general function approximation",
            "venue": "Technical Report WL-TR-1065, Wright-Patterson Air Force Base,",
            "year": 1996
        },
        {
            "authors": [
                "M.E. Harmon",
                "L.C. Baird",
                "A.H. Klopf"
            ],
            "title": "Advantage updating applied to a differential game",
            "year": 1995
        },
        {
            "authors": [
                "S. Levine",
                "C. Finn",
                "T. Darrell",
                "P. Abbeel"
            ],
            "title": "End-toend training of deep visuomotor policies",
            "venue": "arXiv preprint arXiv:1504.00702,",
            "year": 2015
        },
        {
            "authors": [
                "L.J. Lin"
            ],
            "title": "Reinforcement learning for robots using neural networks",
            "venue": "PhD thesis,",
            "year": 1993
        },
        {
            "authors": [
                "C.J. Maddison",
                "A. Huang",
                "I. Sutskever",
                "D. Silver"
            ],
            "title": "Move Evaluation in Go Using Deep Convolutional Neural Networks",
            "venue": "In ICLR,",
            "year": 2015
        },
        {
            "authors": [
                "T. Schaul",
                "J. Quan",
                "I. Antonoglou",
                "D. Silver"
            ],
            "title": "Prioritized experience replay",
            "venue": "In ICLR,",
            "year": 2016
        },
        {
            "authors": [
                "J. Schulman",
                "P. Moritz",
                "S. Levine",
                "M.I. Jordan",
                "P. Abbeel"
            ],
            "title": "High-dimensional continuous control using generalized advantage estimation",
            "venue": "arXiv preprint arXiv:1506.02438,",
            "year": 2015
        },
        {
            "authors": [
                "K. Simonyan",
                "A. Vedaldi",
                "A. Zisserman"
            ],
            "title": "Deep inside convolutional networks: Visualising image classification models and saliency maps",
            "venue": "arXiv preprint arXiv:1312.6034,",
            "year": 2013
        },
        {
            "authors": [
                "B.C. Stadie",
                "S. Levine",
                "P. Abbeel"
            ],
            "title": "Incentivizing exploration in reinforcement learning with deep predictive models",
            "venue": "arXiv preprint arXiv:1507.00814,",
            "year": 2015
        },
        {
            "authors": [
                "R.S. Sutton",
                "A.G. Barto"
            ],
            "title": "Introduction to reinforcement learning",
            "year": 1998
        },
        {
            "authors": [
                "R.S. Sutton",
                "D. Mcallester",
                "S. Singh",
                "Y. Mansour"
            ],
            "title": "Policy gradient methods for reinforcement learning with function approximation",
            "venue": "In NIPS, pp",
            "year": 2000
        },
        {
            "authors": [
                "H. van Seijen",
                "H. van Hasselt",
                "S. Whiteson",
                "M. Wiering"
            ],
            "title": "A theoretical and empirical analysis of Expected Sarsa",
            "venue": "In IEEE Symposium on Adaptive Dynamic Programming and Reinforcement Learning,",
            "year": 2009
        },
        {
            "authors": [
                "M. Watter",
                "J.T. Springenberg",
                "J. Boedecker",
                "M.A. Riedmiller"
            ],
            "title": "Embed to control: A locally linear latent dynamics model for control from raw images",
            "venue": "In NIPS,",
            "year": 2015
        }
    ],
    "sections": [
        {
            "heading": "1. Introduction",
            "text": "Over the past years, deep learning has contributed to dramatic advances in scalability and performance of machine learning (LeCun et al., 2015). One exciting application is the sequential decision-making setting of reinforcement learning (RL) and control. Notable examples include deep Q-learning (Mnih et al., 2015), deep visuomotor policies (Levine et al., 2015), attention with recurrent networks (Ba et al., 2015), and model predictive control with embeddings (Watter et al., 2015). Other recent successes include massively parallel frameworks (Nair et al., 2015) and expert move prediction in the game of Go (Maddison et al., 2015), which produced policies matching those of Monte Carlo tree search programs, and squarely beaten a professional player when combined with search (Silver et al., 2016).\nIn spite of this, most of the approaches for RL use standard neural networks, such as convolutional networks, MLPs, LSTMs and autoencoders. The focus in these recent advances has been on designing improved control and RL algorithms, or simply on incorporating existing neural network architectures into RL methods. Here, we take an alternative but complementary approach of focusing primarily on innovating a neural network architecture that is better suited for model-free RL. This approach has the benefit that the new network can be easily combined with existing and future algorithms for RL. That is, this paper advances a new network (Figure 1), but uses already published algorithms.\nThe proposed network architecture, which we name the dueling architecture, explicitly separates the representation of state values and (state-dependent) action advantages. The dueling architecture consists of two streams that represent the value and advantage functions, while sharing a common\nar X\niv :1\n51 1.\n06 58\n1v 3\n[ cs\n.L G\n] 5\nA pr\nconvolutional feature learning module. The two streams are combined via a special aggregating layer to produce an estimate of the state-action value function Q as shown in Figure 1. This dueling network should be understood as a single Q network with two streams that replaces the popular single-stream Q network in existing algorithms such as Deep Q-Networks (DQN; Mnih et al., 2015). The dueling network automatically produces separate estimates of the state value function and advantage function, without any extra supervision.\nIntuitively, the dueling architecture can learn which states are (or are not) valuable, without having to learn the effect of each action for each state. This is particularly useful in states where its actions do not affect the environment in any relevant way. To illustrate this, consider the saliency maps shown in Figure 21. These maps were generated by computing the Jacobians of the trained value and advantage streams with respect to the input video, following the method proposed by Simonyan et al. (2013). (The experimental section describes this methodology in more detail.) The figure shows the value and advantage saliency maps for two different time steps. In one time step (leftmost pair of images), we see that the value network stream pays attention to the road and in particular to the horizon, where new cars appear. It also pays attention to the score. The advantage stream on the other hand does not pay much attention to the visual input because its action choice is practically irrelevant when there are no cars in front. However, in the second time step (rightmost pair of images) the advantage stream pays attention as there is a car immediately in front, making its choice of action very relevant.\nIn the experiments, we demonstrate that the dueling architecture can more quickly identify the correct action during policy evaluation as redundant or similar actions are added to the learning problem.\nWe also evaluate the gains brought in by the dueling architecture on the challenging Atari 2600 testbed. Here, an RL agent with the same structure and hyper-parameters must be able to play 57 different games by observing image pixels and game scores only. The results illustrate vast improvements over the single-stream baselines of Mnih et al. (2015) and van Hasselt et al. (2015). The combination of prioritized replay (Schaul et al., 2016) with the proposed dueling network results in the new state-of-the-art for this popular domain."
        },
        {
            "heading": "1.1. Related Work",
            "text": "The notion of maintaining separate value and advantage functions goes back to Baird (1993). In Baird’s original\n1https://www.youtube.com/playlist?list= PLVFXyCSfS2Pau0gBh0mwTxDmutywWyFBP\nadvantage updating algorithm, the shared Bellman residual update equation is decomposed into two updates: one for a state value function, and one for its associated advantage function. Advantage updating was shown to converge faster than Q-learning in simple continuous time domains in (Harmon et al., 1995). Its successor, the advantage learning algorithm, represents only a single advantage function (Harmon & Baird, 1996).\nThe dueling architecture represents both the value V (s) and advantage A(s, a) functions with a single deep model whose output combines the two to produce a state-action value Q(s, a). Unlike in advantage updating, the representation and algorithm are decoupled by construction. Consequently, the dueling architecture can be used in combination with a myriad of model free RL algorithms.\nThere is a long history of advantage functions in policy gradients, starting with (Sutton et al., 2000). As a recent example of this line of work, Schulman et al. (2015) estimate advantage values online to reduce the variance of policy gradient algorithms.\nThere have been several attempts at playing Atari with deep reinforcement learning, including Mnih et al. (2015); Guo et al. (2014); Stadie et al. (2015); Nair et al. (2015); van Hasselt et al. (2015); Bellemare et al. (2016) and Schaul\net al. (2016). The results of Schaul et al. (2016) are the current published state-of-the-art."
        },
        {
            "heading": "2. Background",
            "text": "We consider a sequential decision making setup, in which an agent interacts with an environment E over discrete time steps, see Sutton & Barto (1998) for an introduction. In the Atari domain, for example, the agent perceives a video st consisting of M image frames: st = (xt−M+1, . . . , xt) ∈ S at time step t. The agent then chooses an action from a discrete set at ∈ A = {1, . . . , |A|} and observes a reward signal rt produced by the game emulator.\nThe agent seeks maximize the expected discounted return, where we define the discounted return as Rt =∑∞ τ=t γ\nτ−trτ . In this formulation, γ ∈ [0, 1] is a discount factor that trades-off the importance of immediate and future rewards.\nFor an agent behaving according to a stochastic policy π, the values of the state-action pair (s, a) and the state s are defined as follows\nQπ(s, a) = E [Rt| st = s, at = a, π] , and V π(s) = Ea∼π(s) [Qπ(s, a)] . (1)\nThe preceding state-action value function (Q function for short) can be computed recursively with dynamic programming:\nQπ(s, a) = Es′ [ r + γEa′∼π(s′) [Qπ(s′, a′)] | s, a, π ] .\nWe define the optimal Q∗(s, a) = maxπ Qπ(s, a). Under the deterministic policy a = argmaxa′∈AQ\n∗(s, a′), it follows that V ∗(s) = maxaQ∗(s, a). From this, it also follows that the optimal Q function satisfies the Bellman equation:\nQ∗(s, a) = Es′ [ r + γmax\na′ Q∗(s′, a′) | s, a\n] . (2)\nWe define another important quantity, the advantage function, relating the value and Q functions:\nAπ(s, a) = Qπ(s, a)− V π(s). (3)\nNote that Ea∼π(s) [Aπ(s, a)] = 0. Intuitively, the value function V measures the how good it is to be in a particular state s. The Q function, however, measures the the value of choosing a particular action when in this state. The advantage function subtracts the value of the state from the Q function to obtain a relative measure of the importance of each action."
        },
        {
            "heading": "2.1. Deep Q-networks",
            "text": "The value functions as described in the preceding section are high dimensional objects. To approximate them, we can use a deep Q-network: Q(s, a; θ) with parameters θ. To estimate this network, we optimize the following sequence of loss functions at iteration i:\nLi(θi) = Es,a,r,s′ [( yDQNi −Q(s, a; θi) )2] , (4)\nwith yDQNi = r + γmax\na′ Q(s′, a′; θ−), (5)\nwhere θ− represents the parameters of a fixed and separate target network. We could attempt to use standard Qlearning to learn the parameters of the network Q(s, a; θ) online. However, this estimator performs poorly in practice. A key innovation in (Mnih et al., 2015) was to freeze the parameters of the target network Q(s′, a′; θ−) for a fixed number of iterations while updating the online network Q(s, a; θi) by gradient descent. (This greatly improves the stability of the algorithm.) The specific gradient update is\n∇θiLi(θi) = Es,a,r,s′ [( yDQNi −Q(s, a; θi) ) ∇θiQ(s, a; θi) ] This approach is model free in the sense that the states and rewards are produced by the environment. It is also offpolicy because these states and rewards are obtained with a behavior policy (epsilon greedy in DQN) different from the online policy that is being learned.\nAnother key ingredient behind the success of DQN is experience replay (Lin, 1993; Mnih et al., 2015). During learning, the agent accumulates a dataset Dt = {e1, e2, . . . , et} of experiences et = (st, at, rt, st+1) from many episodes. When training the Q-network, instead only using the current experience as prescribed by standard temporaldifference learning, the network is trained by sampling mini-batches of experiences from D uniformly at random. The sequence of losses thus takes the form\nLi(θi) = E(s,a,r,s′)∼U(D) [( yDQNi −Q(s, a; θi) )2] .\nExperience replay increases data efficiency through re-use of experience samples in multiple updates and, importantly, it reduces variance as uniform sampling from the replay buffer reduces the correlation among the samples used in the update."
        },
        {
            "heading": "2.2. Double Deep Q-networks",
            "text": "The previous section described the main components of DQN as presented in (Mnih et al., 2015). In this paper,\nwe use the improved Double DQN (DDQN) learning algorithm of van Hasselt et al. (2015). In Q-learning and DQN, the max operator uses the same values to both select and evaluate an action. This can therefore lead to overoptimistic value estimates (van Hasselt, 2010). To mitigate this problem, DDQN uses the following target:\nyDDQNi = r + γQ(s ′, argmax a′ Q(s′, a′; θi); θ −). (6)\nDDQN is the same as for DQN (see Mnih et al. (2015)), but with the target yDQNi replaced by y DDQN i . The pseudocode for DDQN is presented in Appendix A."
        },
        {
            "heading": "2.3. Prioritized Replay",
            "text": "A recent innovation in prioritized experience replay (Schaul et al., 2016) built on top of DDQN and further improved the state-of-the-art. Their key idea was to increase the replay probability of experience tuples that have a high expected learning progress (as measured via the proxy of absolute TD-error). This led to both faster learning and to better final policy quality across most games of the Atari benchmark suite, as compared to uniform experience replay.\nTo strengthen the claim that our dueling architecture is complementary to algorithmic innovations, we show that it improves performance for both the uniform and the prioritized replay baselines (for which we picked the easier to implement rank-based variant), with the resulting prioritized dueling variant holding the new state-of-the-art."
        },
        {
            "heading": "3. The Dueling Network Architecture",
            "text": "The key insight behind our new architecture, as illustrated in Figure 2, is that for many states, it is unnecessary to estimate the value of each action choice. For example, in the Enduro game setting, knowing whether to move left or right only matters when a collision is eminent. In some states, it is of paramount importance to know which action to take, but in many other states the choice of action has no repercussion on what happens. For bootstrapping based algorithms, however, the estimation of state values is of great importance for every state.\nTo bring this insight to fruition, we design a single Qnetwork architecture, as illustrated in Figure 1, which we refer to as the dueling network. The lower layers of the dueling network are convolutional as in the original DQNs (Mnih et al., 2015). However, instead of following the convolutional layers with a single sequence of fully connected layers, we instead use two sequences (or streams) of fully connected layers. The streams are constructed such that they have they have the capability of providing separate estimates of the value and advantage functions. Finally, the two streams are combined to produce a single output Q\nfunction. As in (Mnih et al., 2015), the output of the network is a set of Q values, one for each action.\nSince the output of the dueling network is a Q function, it can be trained with the many existing algorithms, such as DDQN and SARSA. In addition, it can take advantage of any improvements to these algorithms, including better replay memories, better exploration policies, intrinsic motivation, and so on.\nThe module that combines the two streams of fullyconnected layers to output a Q estimate requires very thoughtful design.\nFrom the expressions for advantage Qπ(s, a) = V π(s) + Aπ(s, a) and state-value V π(s) = Ea∼π(s) [Qπ(s, a)], it follows that Ea∼π(s) [Aπ(s, a)] = 0. Moreover, for a deterministic policy, a∗ = argmaxa′∈AQ(s, a\n′), it follows that Q(s, a∗) = V (s) and hence A(s, a∗) = 0.\nLet us consider the dueling network shown in Figure 1, where we make one stream of fully-connected layers output a scalar V (s; θ, β), and the other stream output an |A|dimensional vector A(s, a; θ, α). Here, θ denotes the parameters of the convolutional layers, while α and β are the parameters of the two streams of fully-connected layers.\nUsing the definition of advantage, we might be tempted to construct the aggregating module as follows:\nQ(s, a; θ, α, β) = V (s; θ, β) +A(s, a; θ, α), (7)\nNote that this expression applies to all (s, a) instances; that is, to express equation (7) in matrix form we need to replicate the scalar, V (s; θ, β), |A| times.\nHowever, we need to keep in mind that Q(s, a; θ, α, β) is only a parameterized estimate of the true Q-function. Moreover, it would be wrong to conclude that V (s; θ, β) is a good estimator of the state-value function, or likewise that A(s, a; θ, α) provides a reasonable estimate of the advantage function.\nEquation (7) is unidentifiable in the sense that given Q we cannot recover V and A uniquely. To see this, add a constant to V (s; θ, β) and subtract the same constant from A(s, a; θ, α). This constant cancels out resulting in the same Q value. This lack of identifiability is mirrored by poor practical performance when this equation is used directly.\nTo address this issue of identifiability, we can force the advantage function estimator to have zero advantage at the chosen action. That is, we let the last module of the network implement the forward mapping\nQ(s, a; θ, α, β) = V (s; θ, β) +( A(s, a; θ, α)− max\na′∈|A| A(s, a′; θ, α)\n) . (8)\nNow, for a∗ = argmaxa′∈AQ(s, a ′; θ, α, β) = argmaxa′∈AA(s, a ′; θ, α), we obtain Q(s, a∗; θ, α, β) = V (s; θ, β). Hence, the stream V (s; θ, β) provides an estimate of the value function, while the other stream produces an estimate of the advantage function.\nAn alternative module replaces the max operator with an average:\nQ(s, a; θ, α, β) = V (s; θ, β) +( A(s, a; θ, α)− 1\n|A| ∑ a′ A(s, a′; θ, α)\n) . (9)\nOn the one hand this loses the original semantics of V and A because they are now off-target by a constant, but on the other hand it increases the stability of the optimization: with (9) the advantages only need to change as fast as the mean, instead of having to compensate any change to the optimal action’s advantage in (8). We also experimented with a softmax version of equation (8), but found it to deliver similar results to the simpler module of equation (9). Hence, all the experiments reported in this paper use the module of equation (9).\nNote that while subtracting the mean in equation (9) helps with identifiability, it does not change the relative rank of the A (and hence Q) values, preserving any greedy or - greedy policy based on Q values from equation (7). When acting, it suffices to evaluate the advantage stream to make decisions.\nIt is important to note that equation (9) is viewed and implemented as part of the network and not as a separate algorithmic step. Training of the dueling architectures, as with standard Q networks (e.g. the deep Q-network of Mnih et al. (2015)), requires only back-propagation. The estimates V (s; θ, β) and A(s, a; θ, α) are computed automatically without any extra supervision or algorithmic modifications.\nAs the dueling architecture shares the same input-output interface with standard Q networks, we can recycle all learning algorithms with Q networks (e.g., DDQN and SARSA) to train the dueling architecture."
        },
        {
            "heading": "4. Experiments",
            "text": "We now show the practical performance of the dueling network. We start with a simple policy evaluation task and then show larger scale results for learning policies for general Atari game-playing."
        },
        {
            "heading": "4.1. Policy evaluation",
            "text": "We start by measuring the performance of the dueling architecture on a policy evaluation task. We choose this par-\nticular task because it is very useful for evaluating network architectures, as it is devoid of confounding factors such as the choice of exploration strategy, and the interaction between policy improvement and policy evaluation.\nIn this experiment, we employ temporal difference learning (without eligibility traces, i.e., λ = 0) to learn Q values. More specifically, given a behavior policy π, we seek to estimate the state-action value Qπ(·, ·) by optimizing the sequence of costs of equation (4), with target\nyi = r + γEa′∼π(s′) [Q(s′, a′; θi)] .\nThe above update rule is the same as that of Expected SARSA (van Seijen et al., 2009). We, however, do not modify the behavior policy as in Expected SARSA.\nTo evaluate the learned Q values, we choose a simple environment where the exact Qπ(s, a) values can be computed separately for all (s, a) ∈ S ×A. This environment, which we call the corridor is composed of three connected corridors. A schematic drawing of the corridor environment is shown in Figure 3, The agent starts from the bottom left corner of the environment and must move to the top right to get the largest reward. A total of 5 actions are available: go up, down, left, right and no-op. We also have the freedom of adding an arbitrary number of no-op actions. In our setup, the two vertical sections both have 10 states while the horizontal section has 50.\nWe use an -greedy policy as the behavior policy π, which chooses a random action with probability or an action according to the optimal Q function argmaxa∈AQ\n∗(s, a) with probability 1 − . In our experiments, is chosen to be 0.001.\nWe compare a single-stream Q architecture with the dueling architecture on three variants of the corridor environment with 5, 10 and 20 actions respectively. The 10 and 20 action variants are formed by adding no-ops to the original environment. We measure performance by Squared Error (SE) against the true state values: ∑ s∈S,a∈A(Q(s, a; θ)− Qπ(s, a))2. The single-stream architecture is a three layer MLP with 50 units on each hidden layer. The dueling architecture is also composed of three layers. After the first hidden layer of 50 units, however, the network branches off into two streams each of them a two layer MLP with 25 hidden units. The results of the comparison are summarized in Figure 3.\nThe results show that with 5 actions, both architectures converge at about the same speed. However, when we increase the number of actions, the dueling architecture performs better than the traditional Q-network. In the dueling network, the stream V (s; θ, β) learns a general value that is shared across many similar actions at s, hence leading to faster convergence. This is a very promising result be-\ncause many control tasks with large action spaces have this property, and consequently we should expect that the dueling network will often lead to much faster convergence than a traditional single stream network. In the following section, we will indeed see that the dueling network results in substantial gains in performance in a wide-range of Atari games."
        },
        {
            "heading": "4.2. General Atari Game-Playing",
            "text": "We perform a comprehensive evaluation of our proposed method on the Arcade Learning Environment (Bellemare et al., 2013), which is composed of 57 Atari games. The challenge is to deploy a single algorithm and architecture, with a fixed set of hyper-parameters, to learn to play all the games given only raw pixel observations and game rewards. This environment is very demanding because it is both comprised of a large number of highly diverse games and the observations are high-dimensional.\nWe follow closely the setup of van Hasselt et al. (2015) and compare to their results using single-stream Q-networks. We train the dueling network with the DDQN algorithm as presented in Appendix A. At the end of this section, we incorporate prioritized experience replay (Schaul et al., 2016).\nOur network architecture has the same low-level convolutional structure of DQN (Mnih et al., 2015; van Hasselt et al., 2015). There are 3 convolutional layers followed by 2 fully-connected layers. The first convolutional layer has 32 8×8 filters with stride 4, the second 64 4×4 filters with stride 2, and the third and final convolutional layer consists 64 3 × 3 filters with stride 1. As shown in Figure 1, the dueling network splits into two streams of fully connected layers. The value and advantage streams both have a fullyconnected layer with 512 units. The final hidden layers of the value and advantage streams are both fully-connected with the value stream having one output and the advantage\nas many outputs as there are valid actions2. We combine the value and advantage streams using the module described by Equation (9). Rectifier non-linearities (Fukushima, 1980) are inserted between all adjacent layers.\nWe adopt the optimizers and hyper-parameters of van Hasselt et al. (2015), with the exception of the learning rate which we chose to be slightly lower (we do not do this for double DQN as it can deteriorate its performance). Since both the advantage and the value stream propagate gradients to the last convolutional layer in the backward pass, we rescale the combined gradient entering the last convolutional layer by 1/ √ 2. This simple heuristic mildly increases stability. In addition, we clip the gradients to have their norm less than or equal to 10. This clipping is not standard practice in deep RL, but common in recurrent network training (Bengio et al., 2013).\nTo isolate the contributions of the dueling architecture, we re-train DDQN with a single stream network using exactly the same procedure as described above. Specifically, we apply gradient clipping, and use 1024 hidden units for the first fully-connected layer of the network so that both architectures (dueling and single) have roughly the same number of parameters. We refer to this re-trained model as Single Clip, while the original trained model of van Hasselt et al. (2015) is referred to as Single.\nAs in (van Hasselt et al., 2015), we start the game with up to 30 no-op actions to provide random starting positions for the agent. To evaluate our approach, we measure improvement in percentage (positive or negative) in score over the better of human and baseline agent scores:\nScoreAgent − ScoreBaseline max{ScoreHuman, ScoreBaseline} − ScoreRandom . (10)\nWe took the maximum over human and baseline agent scores as it prevents insignificant changes to appear as\n2The number of actions ranges between 3-18 actions in the ALE environment.\nFreeway Video Pinball\nBreakout Assault\nBeam Rider Solaris\nJames Bond Tutankham\nBowling Private Eye\nMontezuma's Revenge Pong\nRobotank Pitfall! Skiing\nH.E.R.O. Asteroids\nDemon Attack Wizard Of Wor\nGravitar Gopher Boxing\nBerzerk Alien\nKangaroo Kung-Fu Master\nBattle Zone Name This Game\nDefender Centipede\nCrazy Climber Ice Hockey\nZaxxon Q*Bert\nFishing Derby Amidar Venture\nRiver Raid Double Dunk\nSurround Star Gunner Ms. Pac-Man\nKrull Bank Heist\nRoad Runner Asterix\nTime Pilot Frostbite\nYars' Revenge Seaquest\nChopper Command Enduro\nPhoenix Up and Down\nSpace Invaders Tennis\nAtlantis\n-100.00% -68.31% -17.56% -14.93% -9.71% -7.37% -3.42% -3.38% -1.89% -0.04% 0.00% 0.24% 0.32% 0.45% 1.29% 2.31% 4.51% 4.78% 5.24% 5.54% 6.02% 8.52% 9.86% 10.34% 14.39% 15.56% 15.65% 16.28% 21.18% 21.68% 24.68% 26.45% 27.45% 27.68% 28.82% 31.40% 33.60%\n39.79% 42.75% 44.24% 48.92% 53.76% 55.85% 57.19% 57.57%\n63.17% 69.73% 70.02% 73.63%\n80.51% 82.20% 86.35%\n94.33% 97.90%\n164.11% 180.00%\n296.67%\nFigure 4. Improvements of dueling architecture over the baseline Single network of van Hasselt et al. (2015), using the metric described in Equation (10). Bars to the right indicate by how much the dueling network outperforms the single-stream network.\nlarge improvements when neither the agent in question nor the baseline are doing well. For example, an agent that achieves 2% human performance should not be interpreted as two times better when the baseline agent achieves 1% human performance. We also chose not to measure performance in terms of percentage of human performance alone because a tiny difference relative to the baseline on some games can translate into hundreds of percent in human performance difference.\nThe results for the wide suite of 57 games are summarized in Table 1. Detailed results are presented in the Appendix.\nUsing this 30 no-ops performance measure, it is clear that the dueling network (Duel Clip) does substantially better than the Single Clip network of similar capacity. It also does considerably better than the baseline (Single) of van Hasselt et al. (2015). For comparison we also show results for the deepQ-network of Mnih et al. (2015), referred to as Nature DQN.\nFigure 4 shows the improvement of the dueling network over the baseline Single network of van Hasselt et al. (2015). Again, we seen that the improvements are often very dramatic.\nAs shown in Table 1, Single Clip performs better than Single. We verified that this gain was mostly brought in by gradient clipping. For this reason, we incorporate gradient clipping in all the new approaches.\nDuel Clip does better than Single Clip on 75.4% of the games (43 out of 57). It also achieves higher scores compared to the Single baseline on 80.7% (46 out of 57) of the games. Of all the games with 18 actions, Duel Clip is better 86.6% of the time (26 out of 30). This is consistent with the findings of the previous section. Overall, our agent (Duel Clip) achieves human level performance on 42 out of 57 games. Raw scores for all the games, as well as measurements in human performance percentage, are presented in the Appendix.\nRobustness to human starts. One shortcoming of the 30 no-ops metric is that an agent does not necessarily have to generalize well to play the Atari games. Due to the deterministic nature of the Atari environment, from an unique starting point, an agent could learn to achieve good performance by simply remembering sequences of actions.\nTo obtain a more robust measure, we adopt the methodology of Nair et al. (2015). Specifically, for each game, we use 100 starting points sampled from a human expert’s trajectory. From each of these points, an evaluation episode is launched for up to 108,000 frames. The agents are evaluated only on rewards accrued after the starting point. We refer to this metric as Human Starts.\nAs shown in Table 1, under the Human Starts metric, Duel Clip once again outperforms the single stream variants. In particular, our agent does better than the Single baseline on 70.2% (40 out of 57) games and on games of 18 actions, Duel Clip is 83.3% better (25 out of 30).\nCombining with Prioritized Experience Replay. The dueling architecture can be easily combined with other algorithmic improvements. In particular, prioritization of the experience replay has been shown to significantly improve performance of Atari games (Schaul et al., 2016). Furthermore, as prioritization and the dueling architecture address very different aspects of the learning process, their combination is promising. So in our final experiment, we investigate the integration of the dueling architecture with prioritized experience replay. We use the prioritized variant of DDQN (Prior. Single) as the new baseline algorithm, which replaces with the uniform sampling of the experi-\nKangaroo James Bond\nDouble Dunk Skiing\nSeaquest Robotank\nMs. Pac-Man Surround\nSolaris Time Pilot\nIce Hockey Gravitar H.E.R.O.\nAlien Asteroids Breakout Freeway Bowling Venture\nTennis Montezuma's Revenge\nPrivate Eye Pong\nFishing Derby Demon Attack\nBoxing Pitfall!\nRoad Runner Krull\nEnduro Atlantis\nBattle Zone Q*Bert\nCrazy Climber Tutankham\nKung-Fu Master Amidar\nBeam Rider Centipede\nZaxxon Name This Game\nDefender River Raid\nBank Heist Assault\nChopper Command Video Pinball\nFrostbite Berzerk\nStar Gunner Yars' Revenge Up and Down\nWizard Of Wor Gopher Phoenix\nSpace Invaders Asterix 1097.02%\n-89.22% -84.70% -83.56% -77.99% -60.56% -58.11% -48.03% -40.74% -37.65% -29.21% -13.60% -9.77% -6.72% -3.81% -3.13% -2.12% -2.08% -0.87% -0.51% 0.00% 0.00% 0.01% 0.73% 1.37% 1.44% 3.46% 5.33% 7.89% 7.95% 10.20% 11.16% 11.46% 15.56% 16.16% 21.38% 22.36% 24.98% 29.94% 32.48% 32.74% 33.09% 35.33% 38.56% 43.11% 51.07% 58.87%\n69.92% 70.29%\n83.91% 98.69%\n113.16% 113.47%\n178.13% 223.03%\n281.56% 457.93%\nFigure 5. Improvements of dueling architecture over Prioritized DDQN baseline, using the same metric as Figure 4. Again, the dueling architecture leads to significant improvements over the single-stream baseline on the majority of games.\nence tuples by rank-based prioritized sampling. We keep all the parameters of the prioritized replay as described in (Schaul et al., 2016), namely a priority exponent of 0.7, and an annealing schedule on the importance sampling exponent from 0.5 to 1. We combine this baseline with our dueling architecture (as above), and again use gradient clipping (Prior. Duel Clip).\nNote that, although orthogonal in their objectives, these extensions (prioritization, dueling and gradient clipping) interact in subtle ways. For example, prioritization interacts with gradient clipping, as sampling transitions with high absolute TD-errors more often leads to gradients with higher norms. To avoid adverse interactions, we roughly re-tuned the learning rate and the gradient clipping norm on a subset of 9 games. As a result of rough tuning, we settled on 6.25×10−5 for the learning rate and 10 for the gradient clipping norm (the same as in the previous section).\nWhen evaluated on all 57 Atari games, our prioritized dueling agent performs significantly better than both the prioritized baseline agent and the dueling agent alone. The full mean and median performance against the human performance percentage is shown in Table 1. When initializing the games using up to 30 no-ops action, we observe mean and median scores of 591% and 172% respectively. The direct comparison between the prioritized baseline and prioritized dueling versions, using the metric described in Equation 10, is presented in Figure 5.\nThe combination of prioritized replay and the dueling network results in vast improvements over the previous stateof-the-art in the popular ALE benchmark.\nSaliency maps. To better understand the roles of the value and the advantage streams, we compute saliency maps (Simonyan et al., 2013). More specifically, to visualize the salient part of the image as seen by the value stream, we compute the absolute value of the Jacobian of V̂ with respect to the input frames: |∇sV̂ (s; θ)|. Similarly, to visualize the salient part of the image as seen by the advantage stream, we compute |∇sÂ(s, argmaxa′ Â(s, a′); θ)|. Both quantities are of the same dimensionality as the input frames and therefore can be visualized easily alongside the input frames.\nHere, we place the gray scale input frames in the green and blue channel and the saliency maps in the red channel. All three channels together form an RGB image. Figure 2 depicts the value and advantage saliency maps on the Enduro game for two different time steps. As observed in the introduction, the value stream pays attention to the horizon where the appearance of a car could affect future performance. The value stream also pays attention to the score. The advantage stream, on the other hand, cares more about cars that are on an immediate collision course."
        },
        {
            "heading": "5. Discussion",
            "text": "The advantage of the dueling architecture lies partly in its ability to learn the state-value function efficiently. With every update of the Q values in the dueling architecture, the value stream V is updated – this contrasts with the updates in a single-stream architecture where only the value for one of the actions is updated, the values for all other actions remain untouched. This more frequent updating of the value stream in our approach allocates more resources to V , and thus allows for better approximation of the state values, which in turn need to be accurate for temporaldifference-based methods like Q-learning to work (Sutton & Barto, 1998). This phenomenon is reflected in the experiments, where the advantage of the dueling architecture over single-stream Q networks grows when the number of actions is large.\nFurthermore, the differences between Q-values for a given state are often very small relative to the magnitude of Q. For example, after training with DDQN on the game of Seaquest, the average action gap (the gap between the Q values of the best and the second best action in a given state) across visited states is roughly 0.04, whereas the average state value across those states is about 15. This difference in scales can lead to small amounts of noise in the updates can lead to reorderings of the actions, and thus make the nearly greedy policy switch abruptly. The dueling ar-\nchitecture with its separate advantage stream is robust to such effects."
        },
        {
            "heading": "6. Conclusions",
            "text": "We introduced a new neural network architecture that decouples value and advantage in deep Q-networks, while sharing a common feature learning module. The new dueling architecture, in combination with some algorithmic improvements, leads to dramatic improvements over existing approaches for deep RL in the challenging Atari domain. The results presented in this paper are the new state-of-theart in this popular domain."
        },
        {
            "heading": "A. Double DQN Algorithm",
            "text": "Algorithm 1: Double DQN Algorithm. input : D – empty replay buffer; θ – initial network parameters, θ− – copy of θ input : Nr – replay buffer maximum size; Nb – training batch size; N− – target network replacement freq. for episode e ∈ {1, 2, . . . ,M } do\nInitialize frame sequence x← () for t ∈ {0, 1, . . .} do\nSet state s← x, sample action a ∼ πB Sample next frame xt from environment E given (s, a) and receive reward r, and append xt to x if |x| > Nf then delete oldest frame xtmin from x end Set s′ ← x, and add transition tuple (s, a, r, s′) to D, replacing the oldest tuple if |D| ≥ Nr Sample a minibatch of Nb tuples (s, a, r, s′) ∼ Unif(D) Construct target values, one for each of the Nb tuples: Define amax (s′; θ) = argmaxa′ Q(s ′, a′; θ)\nyj = { r if s′ is terminal r + γQ(s′, amax (s′; θ); θ−), otherwise. Do a gradient descent step with loss ‖yj −Q(s, a; θ)‖2\nReplace target parameters θ− ← θ every N− steps end\nend"
        }
    ],
    "title": "Dueling Network Architectures for Deep Reinforcement Learning",
    "year": 2016
}