{
    "abstractText": "We introduce a design strategy for neural network macro-architecture based on selfsimilarity. Repeated application of a single expansion rule generates an extremely deep network whose structural layout is precisely a truncated fractal. Such a network contains interacting subpaths of different lengths, but does not include any pass-through connections: every internal signal is transformed by a filter and nonlinearity before being seen by subsequent layers. This property stands in stark contrast to the current approach of explicitly structuring very deep networks so that training is a residual learning problem. Our experiments demonstrate that residual representation is not fundamental to the success of extremely deep convolutional neural networks. A fractal design achieves an error rate of 22.85% on CIFAR-100, matching the state-of-the-art held by residual networks. Fractal networks exhibit intriguing properties beyond their high performance. They can be regarded as a computationally efficient implicit union of subnetworks of every depth. We explore consequences for training, touching upon connection with student-teacher behavior, and, most importantly, demonstrating the ability to extract high-performance fixed-depth subnetworks. To facilitate this latter task, we develop drop-path, a natural extension of dropout, to regularize co-adaptation of subpaths in fractal architectures. With such regularization, fractal networks exhibit an anytime property: shallow subnetworks provide a quick answer, while deeper subnetworks, with higher latency, provide a more accurate answer.",
    "authors": [
        {
            "affiliations": [],
            "name": "Gustav Larsson"
        },
        {
            "affiliations": [],
            "name": "Michael Maire"
        },
        {
            "affiliations": [],
            "name": "Gregory Shakhnarovich"
        }
    ],
    "id": "SP:76fe6b41bcfefbc2efbfb8ea29de6ca1f3e71f8e",
    "references": [
        {
            "authors": [
                "J. Ba",
                "R. Caruana"
            ],
            "title": "Do deep nets really need to be deep? In NIPS",
            "venue": "pages 2654–2662",
            "year": 2014
        },
        {
            "authors": [
                "D.-A. Clevert",
                "T. Unterthiner",
                "S. Hochreiter"
            ],
            "title": "Fast and accurate deep network learning by exponential linear units (elus)",
            "venue": "ICLR",
            "year": 2016
        },
        {
            "authors": [
                "J. Deng",
                "W. Dong",
                "R. Socher",
                "L.-J. Li",
                "K. Li",
                "L. Fei-Fei"
            ],
            "title": "Imagenet: A large-scale hierarchical image database",
            "venue": "CVPR, pages 248–255",
            "year": 2009
        },
        {
            "authors": [
                "X. Glorot",
                "Y. Bengio"
            ],
            "title": "Understanding the difficulty of training deep feedforward neural networks",
            "venue": "AISTATS",
            "year": 2010
        },
        {
            "authors": [
                "B. Graham"
            ],
            "title": "Fractional max-pooling",
            "venue": "arXiv preprint arXiv:1412.6071",
            "year": 2014
        },
        {
            "authors": [
                "B. Hariharan",
                "P. Arbelaez",
                "R. Girshick",
                "J. Malik"
            ],
            "title": "Hypercolumns for object segmentation and finegrained localization",
            "venue": "CVPR",
            "year": 2015
        },
        {
            "authors": [
                "K. He",
                "X. Zhang",
                "S. Ren",
                "J. Sun"
            ],
            "title": "Delving deep into rectifiers: Surpassing human-level performance on imagenet classification",
            "venue": "ICCV, pages 1026–1034",
            "year": 2015
        },
        {
            "authors": [
                "K. He",
                "X. Zhang",
                "S. Ren",
                "J. Sun"
            ],
            "title": "Deep residual learning for image recognition",
            "venue": "CVPR",
            "year": 2016
        },
        {
            "authors": [
                "K. He",
                "X. Zhang",
                "S. Ren",
                "J. Sun"
            ],
            "title": "Identity mappings in deep residual networks",
            "venue": "arXiv preprint arXiv:1603.05027",
            "year": 2016
        },
        {
            "authors": [
                "G.E. Hinton",
                "N. Srivastava",
                "A. Krizhevsky",
                "I. Sutskever",
                "R. Salakhutdinov"
            ],
            "title": "Improving neural networks by preventing co-adaptation of feature detectors",
            "venue": "CoRR, abs/1207.0580",
            "year": 2012
        },
        {
            "authors": [
                "G. Huang",
                "Y. Sun",
                "Z. Liu",
                "D. Sedra",
                "K. Weinberger"
            ],
            "title": "Deep networks with stochastic depth",
            "venue": "arXiv preprint arXiv:1603.09382",
            "year": 2016
        },
        {
            "authors": [
                "S. Ioffe",
                "C. Szegedy"
            ],
            "title": "Batch normalization: Accelerating deep network training by reducing internal covariate shift",
            "venue": "ICML",
            "year": 2015
        },
        {
            "authors": [
                "Y. Jia",
                "E. Shelhamer",
                "J. Donahue",
                "S. Karayev",
                "J. Long",
                "R. Girshick",
                "S. Guadarrama",
                "T. Darrell"
            ],
            "title": "Caffe: Convolutional architecture for fast feature embedding",
            "venue": "arXiv preprint arXiv:1408.5093",
            "year": 2014
        },
        {
            "authors": [
                "A. Krizhevsky"
            ],
            "title": "Learning multiple layers of features from tiny images",
            "venue": "Technical Report",
            "year": 2009
        },
        {
            "authors": [
                "A. Krizhevsky",
                "S.Ilya",
                "G.E. Hinton"
            ],
            "title": "Imagenet classification with deep convolutional neural networks",
            "venue": "In NIPS,",
            "year": 2012
        },
        {
            "authors": [
                "Q.V. Le",
                "N. Jaitly",
                "G.E. Hinton"
            ],
            "title": "A simple way to initialize recurrent networks of rectified linear units",
            "venue": "arXiv preprint arXiv:1504.00941",
            "year": 2015
        },
        {
            "authors": [
                "C.-Y. Lee",
                "P.W. Gallagher",
                "Z. Tu"
            ],
            "title": "Generalizing pooling functions in convolutional neural networks: Mixed",
            "venue": "gated, and tree. In AISTATS, pages 464–472",
            "year": 2016
        },
        {
            "authors": [
                "C.-Y. Lee",
                "S. Xie",
                "P. Gallagher",
                "Z. Zhang",
                "Z. Tu"
            ],
            "title": "Deeply-supervised nets",
            "venue": "NIPS Workshop on Deep Learning and Representation Learning",
            "year": 2014
        },
        {
            "authors": [
                "M. Liang",
                "X. Hu"
            ],
            "title": "Recurrent convolutional neural network for object recognition",
            "venue": "CVPR, pages 3367–3375",
            "year": 2015
        },
        {
            "authors": [
                "Z. Liao",
                "G. Carneiro"
            ],
            "title": "Competitive multi-scale convolution",
            "venue": "arXiv preprint arXiv:1511.05635",
            "year": 2015
        },
        {
            "authors": [
                "M. Lin",
                "Q. Chen",
                "S. Yan"
            ],
            "title": "Network in network",
            "venue": "ICLR",
            "year": 2013
        },
        {
            "authors": [
                "M. Maire",
                "S.X. Yu",
                "P. Perona"
            ],
            "title": "Reconstructive sparse code transfer for contour detection and semantic labeling",
            "venue": "ACCV",
            "year": 2014
        },
        {
            "authors": [
                "D. Mishkin",
                "J. Matas"
            ],
            "title": "All you need is a good init",
            "venue": "ICLR",
            "year": 2016
        },
        {
            "authors": [
                "V. Nair",
                "G.E. Hinton"
            ],
            "title": "Rectified linear units improve restricted boltzmann machines",
            "venue": "ICML, pages 807–814",
            "year": 2010
        },
        {
            "authors": [
                "Y. Netzer",
                "T. Wang",
                "A. Coates",
                "A. Bissacco",
                "B. Wu",
                "A.Y. Ng"
            ],
            "title": "Reading digits in natural images with unsupervised feature learning",
            "venue": "NIPS Workshop on Deep Learning and Unsupervised Feature Learning",
            "year": 2011
        },
        {
            "authors": [
                "B. Neyshabur",
                "R. Salakhutdinov",
                "N. Srebro"
            ],
            "title": "Path-sgd: Path-normalized optimization in deep neural networks",
            "venue": "NIPS",
            "year": 2015
        },
        {
            "authors": [
                "A. Romero",
                "N. Ballas",
                "S.E. Kahou",
                "A. Chassang",
                "C. Gatta",
                "Y. Bengio"
            ],
            "title": "Fitnets: Hints for thin deep nets",
            "venue": "ICLR",
            "year": 2015
        },
        {
            "authors": [
                "K. Simonyan",
                "A. Zisserman"
            ],
            "title": "Very deep convolutional networks for large-scale image recognition",
            "venue": "ICLR",
            "year": 2015
        },
        {
            "authors": [
                "J. Snoek",
                "O. Rippel",
                "K. Swersky",
                "R. Kiros",
                "N. Satish",
                "N. Sundaram",
                "M. Patwary",
                "M. Ali",
                "R.P. Adams"
            ],
            "title": "et al",
            "venue": "Scalable bayesian optimization using deep neural networks. ICML",
            "year": 2015
        },
        {
            "authors": [
                "J.T. Springenberg",
                "A. Dosovitskiy",
                "T. Brox",
                "M. Riedmiller"
            ],
            "title": "Striving for simplicity: The all convolutional net",
            "venue": "ICLR (workshop track)",
            "year": 2014
        },
        {
            "authors": [
                "R.K. Srivastava",
                "K. Greff",
                "J. Schmidhuber"
            ],
            "title": "Highway networks",
            "venue": "ICML",
            "year": 2015
        },
        {
            "authors": [
                "C. Szegedy",
                "W. Liu",
                "Y. Jia",
                "P. Sermanet",
                "S. Reed",
                "D. Anguelov",
                "D. Erhan",
                "V. Vanhoucke",
                "A. Rabinovich"
            ],
            "title": "Going deeper with convolutions",
            "venue": "CVPR",
            "year": 2015
        },
        {
            "authors": [
                "S. Targ",
                "D. Almeida",
                "K. Lyman"
            ],
            "title": "Resnet in resnet: Generalizing residual architectures",
            "venue": "arXiv preprint arXiv:1603.08029",
            "year": 2016
        },
        {
            "authors": [
                "G. Urban",
                "K.J. Geras",
                "S. Ebrahimi Kahou",
                "O. Aslan",
                "S. Wang",
                "R. Caruana",
                "A. Mohamed",
                "M. Philipose",
                "M. Richardson"
            ],
            "title": "Do deep convolutional nets really need to be deep (or even convolutional)",
            "venue": "ArXiv e-prints",
            "year": 2016
        },
        {
            "authors": [
                "L. Wan",
                "M. Zeiler",
                "S. Zhang",
                "Y.L. Cun",
                "R. Fergus"
            ],
            "title": "Regularization of neural networks using dropconnect",
            "venue": "ICML, pages 1058–1066",
            "year": 2013
        }
    ],
    "sections": [
        {
            "text": "Fractal networks exhibit intriguing properties beyond their high performance. They can be regarded as a computationally efficient implicit union of subnetworks of every depth. We explore consequences for training, touching upon connection with student-teacher behavior, and, most importantly, demonstrating the ability to extract high-performance fixed-depth subnetworks. To facilitate this latter task, we develop drop-path, a natural extension of dropout, to regularize co-adaptation of subpaths in fractal architectures. With such regularization, fractal networks exhibit an anytime property: shallow subnetworks provide a quick answer, while deeper subnetworks, with higher latency, provide a more accurate answer."
        },
        {
            "heading": "1 Introduction",
            "text": "ResNet [8] is a recent and dramatic increase in both depth and accuracy of convolutional neural networks, facilitated by constraining the network to learn residuals. ResNet variants [8, 9, 11] and related architectures [31] employ the common technique of initializing and anchoring, via a passthrough channel, a network to the identity function. Training now differs in two respects. First, the objective changes to learning residual outputs, rather than unreferenced absolute mappings. Second, these networks exhibit a type of deep supervision [18], as near-identity layers effectively reduce distance to the loss. He et al. [8] speculate that the former, residual formulation itself, is crucial.\nWe show otherwise, by constructing a competitive extremely deep architecture that does not rely on residuals. Our design principle is pure enough to communicate in a single word, fractal, and a simple diagram (Figure 1). Yet, fractal networks implicitly recapitulate many properties hard-wired into previous successful architectures. Deep supervision not only arises automatically, but also drives a type of student-teacher learning [1, 34] internal to the network. Modular building blocks of other designs [32, 20] are almost special cases of a fractal network’s nested substructure.\nFor fractal networks, simplicity of training mirrors simplicity of design. A single loss, attached to the final layer, suffices to drive internal behavior mimicking deep supervision. Parameters are randomly initialized. As they contain subnetworks of many depths, fractal networks are robust to choice of overall depth; make them deep enough and training will carve out a useful assembly of subnetworks.\nar X\niv :1\n60 5.\n07 64\n8v 1\n[ cs\n.C V\n] 2\n4 M\nay 2\n01 6\nThe entirety of emergent behavior resulting from a fractal design may erode the need for recent engineering tricks intended to achieve similar effects. These tricks include residual functional forms with identity initialization, manual deep supervision, hand-crafted architectural modules, and studentteacher training regimes. Section 2 reviews this large body of related techniques. Hybrid designs could certainly integrate any of them with a fractal architecture; we leave open the question of the degree to which such hybrids are redundant or synergistic.\nOur main contribution is twofold:\n• We introduce FractalNet, the first alternative to ResNet in the realm of extremely deep convolutional neural networks. FractalNet is scientifically surprising; it shows that residual learning is not required for ultra-deep networks.\n• Through analysis and experiments, we elucidate connections between FractalNet and an array of phenomena engineered into previous deep network designs.\nAs an additional contribution, we develop drop-path, a novel regularization protocol for ultra-deep fractal networks. Existing work on deep residual networks actually lacks demonstration of an effective regularization technique, instead relying solely on data augmentation [8, 11]. In the absence of data augmentation, fractal networks, trained with dropout [10] and drop-path together, far exceed the reported performance of residual networks.\nDrop-path constitutes not only an intuitive regularization strategy, but also provides means of optionally guaranteeing that trained fractal networks exhibit anytime behavior. Specifically, a particular schedule of dropped paths during learning prevents subnetworks of different depths from co-adapting. As a consequence, both shallow and deep subnetworks must individually produce correct output. Querying a shallow subnetwork at test time thus yields a quick and moderately accurate result in advance of completion of the full network.\nSection 3 elaborates the technical details of fractal networks and drop-path. Section 4 provides experimental comparisons to residual networks across the CIFAR-10, CIFAR-100 [14], and SVHN [25] datasets. We also evaluate regularization and data augmentation strategies, investigate subnetwork student-teacher behavior during training, and benchmark anytime networks obtained using drop-path. Section 5 provides synthesis. By virtue of encapsulating many known, yet seemingly distinct, design principles, self-similar structure may materialize as a fundamental component of neural architectures."
        },
        {
            "heading": "2 Related Work",
            "text": "Deepening feed-forward neural networks has generally returned dividends in performance. For example, see the improvement on the ImageNet [3] classification task when transitioning from AlexNet [15] to VGG-16 [28] to ResNet [8]. Unfortunately, greater depth also makes training more challenging, at least when employing a first-order optimization algorithm with a randomly initialized stack of layers. As the network grows deeper and more non-linear, the linear approximation of a gradient step becomes increasingly inappropriate. Desire to overcome these difficulties has driven research on both optimization techniques and network architectures.\nOn the optimization side, much work has yielded improvements. To prevent vanishing gradients, ReLU activation functions have widely replaced sigmoid and tanh units [24]. This subject remains an area of active inquiry, with various tweaks on ReLUs (e.g. PReLUs [7], ELUs [2]). Even with ReLUs, employing batch normalization [12] speeds training by reducing internal covariate shift. Good initialization can also partially ameliorate this problem [4, 23]. Path-SGD [26] offers an alternative normalization scheme. Progress in optimization is somewhat orthogonal to our architectural focus, with the expectation that advances in either are ripe for combination.\nNotable ideas in architecture reach back to skip connections, the earliest example of a nontrivial routing pattern within a neural network. Recent work further elaborates upon them [22, 6]. Highway networks [31] and ResNet [8, 9] offer additional twists in the form of parameterized pass-through and gating. To date, they share distinction as the only designs scalable to hundreds of layers. ResNet’s building block uses the identity map as an anchor point and explicitly parameterizes an additive correction term (the residual). Identity initialization also appears in the context of recurrent networks [16]. A tendency of ResNet and highway networks to fall-back to the identity map may make their effective depth much smaller than their nominal depth.\nSome prior results hint at what we experimentally demonstrate in Section 4. Namely, reduction of effective depth is key to training extremely deep networks; residuals are incidental. Huang et al. [11] provide one clue by showing that randomly dropping layers from ResNet during training, thereby shrinking depth, improves performance. The success of deep supervision [18] provides another. Here, an auxiliary loss, forked off from mid-level layers, introduces a shorter path during backpropagation. The layer at the fork receives two gradients, originating from the main loss and the auxiliary loss, that are added together. Deep supervision is now common, being adopted, for example, by GoogLeNet [32]. However, irrelevance of the auxiliary loss at test time introduces the drawback of having a discrepancy between the actual objective and that used for training.\nExploration of the student-teacher paradigm [1] illuminates the potential for interplay between networks of different depth. In the model compression scenario, a deeper network (previously trained) guides and improves the learning of a shallower and faster student network [1, 34]. This is accomplished by feeding unlabeled data through the teacher and having the student mimic the teacher’s soft output predictions. FitNets [27] explicitly couple students and teachers, forcing mimic behavior across several intermediate points in the network. Our fractal networks capture yet another alternative, in the form of implicit coupling, with the potential for bidirectional information flow between shallow and deep subnetworks.\nWidening networks, by using larger modules in place of individual layers, has also produced performance gains. For example, an Inception module [32] concatenates results of convolutional layers of different receptive field size. Stacking these modules forms the GoogLeNet architecture. Liao and Carneiro employ a variant with maxout in place of concatenation [20]. Figure 1 makes apparent our connection with this work. As a fractal network deepens, it also widens. Moreover, note that stacking two 2D convolutional layers with the same receptive field (say 3ˆ3) achieves a larger (5ˆ5) receptive field. Instantiating our fractal network in this manner makes a horizontal cross-section somewhat reminiscent of an Inception module, except with additional joins due to recursive self-similarity."
        },
        {
            "heading": "3 Fractal Networks",
            "text": "We begin with a more formal presentation of the ideas sketched in Figure 1. Convolutional neural networks serve as our running example and, in the subsequent section, our experimental platform. However, it is worth emphasizing that our framework is more general. In principle, convolutional layers in Figure 1 could be replaced by a different layer type, or even a custom-designed module or subnetwork, in order to generate other fractal architectures.\nLet C denote the index of the truncated fractal fCp¨q. Our network’s structure, connections and layer types, is defined by fCp¨q. A network consisting of a single convolutional layer is the base case:\nf1pzq “ convpzq (1) We define successive fractals recursively:\nfC`1pzq “ rpfC ˝ fCqpzqs ‘ rconvpzqs (2) where ˝ denotes composition and ‘ a join operation. When drawn in the style of Figure 1, C corresponds to the number of columns, or width, of network fCp¨q. Depth, defined to be the number of conv layers on the longest path between input and output, scales as 2C´1. Convolutional networks for classification typically intersperse pooling layers. We achieve the same by using fCp¨q as a building block and stacking it with subsequent pooling layers B times, yielding total depth B ¨ 2C´1. The join operation ‘ merges two feature blobs into one. Here, a blob is the result of a conv layer: a tensor holding activations for a fixed number of channels over a spatial domain. The channel count corresponds to the size of the filter set in the preceding conv layer. As the fractal is expanded, we collapse neighboring joins into a single join layer which spans multiple columns, as shown on the right side of Figure 1. The join layer merges all of its input feature blobs into a single output blob.\nSeveral choices seem reasonable for the action of a join layer, including concatenation and addition. We instantiate each join to compute the element-wise mean of its inputs. This is appropriate for convolutional networks in which channel count is set the same for all conv layers within a fractal block. Averaging might appear similar to ResNet’s addition operation, but there are critical differences:\n• ResNet makes clear distinction between pass-through and residual signals. In FractalNet, no signal is privileged. Every input to a join layer is the output of an immediately preceding conv layer. The network structure alone cannot identify any as being primary.\n• Drop-path regularization, as described next in Section 3.1, forces each input to a join to be individually reliable. This reduces the reward for even implicitly learning to allocate part of one signal to act as a residual for another.\n• Experiments show that we can extract high-performance subnetworks consisting of a single column (Section 4.2). Such a subnetwork is effectively devoid of joins, as only a single path is active throughout. They produce no signal to which a residual could be added.\nTogether, these properties ensure that join layers are not an alternative method of residual learning."
        },
        {
            "heading": "3.1 Regularization via Drop-path",
            "text": "Dropout [10] and drop-connect [35] modify interactions between sequential network layers in order to discourage co-adaptation. Since fractal networks contain additional macro-scale structure, we propose to complement these techniques with an analogous coarse-scale regularization scheme.\nFigure 2 illustrates Drop-path. Just as dropout prevents co-adaptation of activations, drop-path prevents co-adaptation of parallel paths by randomly dropping operands of the join layers. This discourages the network from using one input path as an anchor and another as a corrective term (a configuration that, if not prevented, is prone to overfitting). We consider two sampling strategies:\n• Local: a join drops each input with fixed probability, but we make sure at least one survives. • Global: a single path is selected for the entire network. We restrict this path to be a single\ncolumn, thereby promoting individual columns as independently strong predictors.\nAs with dropout, signals may need appropriate rescaling. With element-wise means, this is trivial; the join computes the mean of only the active inputs.\nIn experiments, we train with dropout and a mixture model of 50% local and 50% global sampling for drop-path. We sample a new subnetwork each mini-batch. With sufficient memory, we can opt to simultaneously evaluate one local sample and all global samples for each mini-batch by keeping separate networks and tying them together via weight sharing.\nGlobal drop-path serves not only as a regularizer, but also as a diagnostic tool. Monitoring performance of individual columns provides insight into both the network and training mechanisms, as further discussed in Section 4.3). Individually strong columns of various depths also give users choices in the trade-off between fast (shallow) and more accurate (deep)."
        },
        {
            "heading": "3.2 Data Augmentation",
            "text": "Data augmentation can greatly reduce the need for regularization. ResNet demonstrates this, achieving 27.22% error rate on CIFAR-100 with augmentation compared to 44.76% without [11]. While data augmentation benefits fractal networks, we make it a point to show that drop-path provides highly effective regularization, allowing them to achieve competitive results even without data augmentation."
        },
        {
            "heading": "3.3 Optimization",
            "text": "We train fractal networks using stochastic gradient descent with momentum. As now standard, we employ batch normalization together with each conv layer (convolution, batch norm, then ReLU)."
        },
        {
            "heading": "4 Experiments",
            "text": "We implement FractalNet using Caffe [13]. Purely for convenience during implementation, we flip the order of pool and join layers at the end of a block in Figure 1. We pool individual columns immediately before the joins spanning all columns, rather than pooling once immediately after them.\nCIFAR-100, CIFAR-10 [14], and SVHN [25] serve as testbeds for comparison to prior work and analysis of FractalNet’s internal behavior. We evaluate performance on the standard classification task associated with each dataset. As these datasets all consist of 32ˆ 32 images, we fix our fractal network to have 5 blocks (B “ 5) with 2ˆ 2 non-overlapping max-pooling and subsampling applied\nafter each. This reduces the input’s 32ˆ 32 spatial resolution to 1ˆ 1 over the course of the entire network. A softmax prediction layer attaches at the end of the network.\nUnless otherwise noted, we set the number of filter channels within blocks 1 through 5 as p64, 128, 256, 512, 512q. This progression is similar to that of VGG-16 [28] and ResNet [8]. It mostly matches the convention of doubling the number of channels after halving spatial resolution."
        },
        {
            "heading": "4.1 Training",
            "text": "For experiments using dropout, we fix drop rate per block at p0%, 10%, 20%, 30%, 40%q (similar to [2]). Local drop-path uses 15% drop rate across the entire network.\nWe train for 400 epochs on CIFAR-10/CIFAR-100 and 20 epochs on SVHN and drop the learning rate by a factor 10 every time we have halved the number of remaining epochs (e.g.at 200, 300, 350, 375). Our learning rate starts at 0.02 and we train using stochastic gradient decent with batch size 100 and momentum 0.9. We use Xavier initialization [4] for parameters.\nA standard scheme for data augmentation on CIFAR-10 and CIFAR-100 is widely employed [21, 2, 31, 8, 9, 11, 33]. It consists only of translation and mirroring. Translation offsets are uniformly sampled from t´4, . . . , 4u for both image axes separately. The image is zero-padded where needed, after mean subtraction. Half of the images are flipped horizontally. We denote results achieved using no more than this degree of training data augmentation by appending a “+” to the dataset name (e.g. CIFAR-100+). A “++” marks results reliant on more data augmentation; here exact schemes may vary. Our entry in this category is modest and simply changes the zero-padding to reflect-padding."
        },
        {
            "heading": "4.2 Results",
            "text": "Table 1 reports performance of FractalNet, with C “ 3 columns, on CIFAR and SVHN classification tasks. Scores of all competing methods are shown to provide context. FractalNet outperforms the original ResNet across the board. With data augmentation, FractalNet’s performance on CIFAR-100 is\nnearly identical to that of the best ResNet variant. With neither data augmentation nor regularization, our performance on CIFAR-100 and CIFAR-10 is superior to that of both ResNet and ResNet with stochastic depth. This suggests that FractalNet may be less prone to overfitting than ResNet. All methods perform similarly well on SVHN, making that dataset a poor differentiator.\nExperiments without data augmentation highlight the power of drop-path regularization. On CIFAR100, adding drop-path reduces FractalNet’s error rate from 35.34% to 28.20%. Unregularized ResNet is far behind (44.76%) and ResNet regularized by stochastic depth (37.80%) does not even catch up to our unregularized starting point of 35.34%. CIFAR-10 mirrors this story.\nIn combination with data augmentation, drop-path either provides a boost (CIFAR-10), or does not significantly influence FractalNet’s performance (CIFAR-100). With drop-path, FractalNet has the best error rate on CIFAR-10 (4.60%) of any model limited to standard data augmentation.\nNote that for CIFAR-10, the performance of the deepest column of the fractal network is statistically indistinguishable from the full network. This suggests that, for this task, the fractal network may be more important as a learning framework than as a final model architecture.\nTable 2 demonstrates that FractalNet is resistant to performance degradation as we increase C to obtain extremely deep networks (160 layers for C “ 6). Scores in this table are not comparable to those in Table 1. For time and memory efficiency, we reduced block-wise feature channels to p16, 32, 64, 128, 128q and the batch size to 50 for the supporting experiments in Tables 2 and 3. Table 3 provides a baseline showing that training of plain deep networks begins to degrade by the time their depth reaches 40 layers. In our experience, a plain 160-layer completely fails to converge. Table 3 also highlights the ability to use FractalNet and drop-path as an engine for extracting trained networks (columns) with the same topology as plain networks, but much higher test performance."
        },
        {
            "heading": "4.3 Introspection",
            "text": "With Figure 3, we look into the evolution of a 40-layer FractalNet during training. Tracking individual columns (recording their losses when run as stand-alone networks), we observe that the 40-layer column initially improves slowly, but picks up once the loss of the rest of the network begins to stabilize. Contrast with a plain 40-layer network trained alone (dashed blue line), which never makes fast progress. The column has the same initial plateau, but subsequently improves after 25 epochs, producing a loss curve uncharacteristic of plain networks.\nWe hypothesize that the fractal structure triggers effects akin to deep supervision and lateral studentteacher information flow. Column #4 joins with column #3 every other layer, and in every fourth layer this join involves no other columns. Once the fractal network partially relies on the signal going through column #3, drop-path puts pressure on column #4 to produce a replacement signal\nwhen column #3 is dropped. This task has constrained scope. A particular drop only requires two consecutive layers in column #4 to substitute for one in column #3, a mini student-teacher problem."
        },
        {
            "heading": "5 Conclusion",
            "text": "FractalNet demonstrates that path length is fundamental for training ultra-deep neural networks; residuals are incidental. Key is the shared characteristic of FractalNet and ResNet: large nominal network depth, but effectively shorter paths for gradient propagation during training. Fractal architectures are arguably the simplest means of satisfying this requirement, and match or exceed ResNet’s experimental performance. They are resistant to being too deep; extra depth may slow training, but does not impair accuracy.\nWith drop-path, regularization of extremely deep fractal networks is intuitive and effective. Drop-path doubles as a method of enforcing latency/accuracy tradeoffs within fractal networks, for applications where fast answers have utility.\nOur analysis connects the emergent internal behavior of fractal networks with phenomena built into other designs. Their substructure is similar to hand-designed modules used as building blocks in some convolutional networks. Their training evolution may emulate deep supervision and student-teacher learning."
        },
        {
            "heading": "Acknowledgments",
            "text": "We gratefully acknowledge the support of NVIDIA Corporation with the donation of GPUs used for this research."
        }
    ],
    "title": "FractalNet: Ultra-Deep Neural Networks without Residuals",
    "year": 2024
}