{
    "abstractText": "The frequent use of Emojis on social media platforms has created a new form of multimodal social interaction. Developing methods for the study and representation of emoji semantics helps to improve future multimodal communication systems. In this paper we explore the usage and semantics of emojis over time. We compare emoji embeddings trained on a corpus of different seasons and show that some emojis are used differently depending on the time of the year. Moreover, we propose a method to take into account the time information for emoji prediction systems, outperforming state-of-the-art systems. We show that, using the time information, the accuracy of some emojis can be significantly improved.",
    "authors": [
        {
            "affiliations": [],
            "name": "Francesco Barbieri"
        },
        {
            "affiliations": [],
            "name": "Lúıs Marujo"
        },
        {
            "affiliations": [],
            "name": "Pradeep Karuturi"
        },
        {
            "affiliations": [],
            "name": "William Brendel"
        },
        {
            "affiliations": [],
            "name": "Horacio Saggion"
        }
    ],
    "id": "SP:ab3c624bbf76016a4c817c533d4f0ccc3e8151d3",
    "references": [
        {
            "authors": [
                "Francesco Barbieri",
                "Miguel Ballesteros",
                "Francesco Ronzano",
                "Horacio Saggion"
            ],
            "title": "Multimodal emoji prediction",
            "venue": "In Proceedings of NAACL: Short Papers,",
            "year": 2018
        },
        {
            "authors": [
                "F. Barbieri",
                "G. Kruszewski",
                "F. Ronzano",
                "H. Saggion"
            ],
            "title": "How cosmopolitan are emojis?: Exp",
            "venue": "e. u. and m. over diff. lang. with dist. sem. In ACM Multimedia,",
            "year": 2016
        },
        {
            "authors": [
                "F. Barbieri",
                "F. Ronzano",
                "H. Saggion"
            ],
            "title": "What does this emoji mean? a vector space skip-gram model for t.emojis",
            "year": 2016
        },
        {
            "authors": [
                "B. Eisner",
                "T. Rocktäschel",
                "M.B.I. Augenstein",
                "S. Riedel"
            ],
            "title": "emoji2vec: Learning emoji representations from their description",
            "year": 2016
        },
        {
            "authors": [
                "Tianran Hu",
                "Han Guo",
                "Hao Sun",
                "Thuyvy Thi Nguyen",
                "Jiebo Luo"
            ],
            "title": "Spice up your chat: The intentions and sentiment effects of using Emoji",
            "venue": "arXiv preprint arXiv:1703.02860,",
            "year": 2017
        },
        {
            "authors": [
                "Mayu Kimura",
                "Marie Katsurai"
            ],
            "title": "Automatic construction of an emoji sentiment lexicon",
            "venue": "In Proceedings of the 2017 IEEE/ACM International Conference on Advances in Social Networks",
            "year": 2017
        },
        {
            "authors": [
                "T. Mikolov",
                "I. Sutskever",
                "K. Chen",
                "G.S. Corrado",
                "J. Dean"
            ],
            "title": "Distributed representations of words and phrases and their compositionality",
            "venue": "In NIPS,",
            "year": 2013
        },
        {
            "authors": [
                "Petra Kralj Novak",
                "Jasmina Smailović",
                "Borut Sluban",
                "Igor Mozetič"
            ],
            "title": "Sentiment of emojis",
            "venue": "PloS one,",
            "year": 2015
        },
        {
            "authors": [
                "S. Wijeratne",
                "L. Balasuriya",
                "A. Sheth",
                "D. Doran"
            ],
            "title": "A semantics-based measure of emoji similarity",
            "venue": "Web Intelligence,",
            "year": 2017
        },
        {
            "authors": [
                "Z. Yang",
                "D. Yang",
                "C. Dyer",
                "X. He",
                "A.J. Smola",
                "E.H. Hovy"
            ],
            "title": "Hierarchical attention networks for document classification",
            "year": 2016
        }
    ],
    "sections": [
        {
            "heading": "1 Introduction",
            "text": "Emojis are frequently used on social media (Snapchat, Twitter, Facebook, Instagram) and on communication platforms (Whatsapp, Messenger). In turn, they create a new form of multimodal communication, wherein images are used to enrich standard text messages. Over the past few years, the interest in emoji research has increased with several studies which contributed to emoji semantics [BRS16, ERA+16, WBSD17a, WBSD17b, BCC18], sentiment\nCopyright c© 2018 held by the author(s). Copying permitted for private and academic purposes.\nIn: S. Wijeratne, E. Kiciman, H. Saggion, A. Sheth (eds.): Proceedings of the 1st International Workshop on Emoji Understanding and Applications in Social Media (Emoji2018), Stanford, CA, USA, 25-JUN-2018, published at http://ceur-ws.org\nSpring\nSummer\nAutumn\nWinter\nanalysis [NSSM15, HGS+17, KK17, RPG+18], automatic emoji prediction [BBS17, FMS+17] and multimodal systems [CMS15, CSG+18, BBRS18]. However, to the best of our knowledge, the temporal dimension of emojis has not been addressed in past research. In this paper we explore the temporal correlation between emoji usage and events during the year, and we show that temporal information helps disambiguate emoji meanings. For example, the four leaf clover emoji is usually associated with good luck wishes, while in March, the same emoji indicates parties and drinking, due to St. Patrick day. In addition, some emojis are naturally associated with specific seasons. (e.g., during Christmas and in Summer), or specific hours (e.g., by night, and in the morning). We show that considering temporal information helps predict emojis, including those that are not time-specific such as and ."
        },
        {
            "heading": "2 Datasets",
            "text": "We first collected a corpus Cus of more than 100 million English tweets, posted only in the U.S.1 from October 2015 to November 2017, and retrieved via the Twitter API2. We then extracted two datasets out of Cus ."
        },
        {
            "heading": "2.1 Seasonal Emoji Dataset",
            "text": "We divide our initial corpus into four subsets (tweets posted in Spring, Summer, Autumn and Winter) to\n1To remove spatial and cultural influence on data [BKRS16]. 2https://dev.twitter.com/streaming/overview\nar X\niv :1\n80 5.\n00 73\n1v 1\n[ cs\n.C L\n] 2\nM ay\n2 01\nstudy the variation of emojis usage across different seasons (Section 3). Table 1 shows the 15 most frequent emojis of each season. We can see that while emojis including , and are always the most common, other emojis are select season-specific: in Autumn,\nand in Winter, and in Spring and Summer."
        },
        {
            "heading": "2.2 Large Scale Emoji Prediction Dataset",
            "text": "We retain from Cus tweets containing only one emoji, and only if that emoji belongs to the set of top 300 most frequently occurring emojis. The final dataset for emoji prediction is composed of 900,000 tweets, with 3,000 tweets per class. In previous work, we experimentally observed that using more than 3,000 tweets per class does not significantly improve the prediction accuracy."
        },
        {
            "heading": "3 Does the Emoji Semantic and Usage Change Over Seasons?",
            "text": "Emoji semantics are difficult to analyze due to the subjective nature of emojis meanings, especially when it comes to describing emotions. Nevertheless, we study emoji semantic by association, i.e. we describe an emoji with either a set of semantically close emojis, or by emoji pair co-occurrence in the same tweet. To this extent, we train skip-gram word embeddings models [MSC+13] on the four different subsets (Spring, Summer, Autumn and Winter) of our seasonal dataset. Each model embeds emojis within a high dimensional space (300 dimensions, 6 tokens window) where distance metrics translate to semantic closeness and cooccurrence. Following [BKRS16] we first evaluate emoji semantics by describing each emoji with its kNearest-Neighbours (k-NN) for each season. Secondly, for each model, we produce a correlation matrix that encodes the semantic correlation of pairs of emojis ap-\npearing in the same tweet. We then compare the four matrices to see if their correlation statistics is preserved across different seasons."
        },
        {
            "heading": "3.1 Analysis From Emoji k-NN Description",
            "text": "For each season, emojis are associated to their k-NN, with k=10. We then look at the overlap of these NN for each emoji among different models. This way, we can investigate if a specific emoji shares the same set of NN across distinct seasons and thus if that emoji preserves its meaning across seasons. We also measure the number of NN that overlap in all the seasons to find emojis with smaller meaning variation during the year. Results are shown in Table 2. In the top half of the table, we notice that emojis related to music, animal, sweets, and emotions are not influenced by seasonality, i.e. they have the same set of Nearest-Neighbours in the four season-specific vector models (10-NN overlap ≥ 8).\nThe emojis for which their NN set varies the most across seasons are the ones listed in the bottom half of Table 2. Many are some sport-related emojis including and probably due to seasons of the year that are include more sports events that other periods. Also the emoji , used in a school/university graudation context, seems to change meaning across seasons. The Nearest-Neighbours of these emojis are party and heart-related emojis in Spring, while schoolrelated emojis in Autumn.\nAnother season-dependant example is the pine emoji (Table 3). The pine tree is associated with vegetation, camping and sunrise-related emoji in Spring and Summer, while in Autumn and Winter it co-occurs with Christmas-related emoji. The gift emoji present a similar behaviour: in Spring and Summer the three nearest neighbors are , and , while in Winter the three closest emojis are , , ."
        },
        {
            "heading": "3.2 Analysis From Emoji Correlation",
            "text": "We evaluate how the semantics of pairs of emojis is preserved across different seasons. To this extent, we compute for each season a 300×300 correlation matrix, where the correlation of emoji i and j is encoded as the cosine similarity between their 300-D feature vectors extracted from the season model. We then compare\npairs of seasons by evaluating the Pearson’s correlation between their respective matrices. The most correlated matrices are Spring and Summer (0.871) while the lowest correlation is between Spring and Winter (0.837). However, all the matrices are highly correlated, suggesting that only a small subset of emojis have their semantic varying across seasons.\nTable 4 shows for each pair of seasons the pairs of emojis with the highest difference in similarity across those seasons. The differences between Spring and Summer (first column) does not look as significant as the differences between other seasons. We can spot few interesting cases. For example the pair is more correlated during Autumn and Winter than during Spring and Summer. This is due to a famous case of doping in sport occurred during that Autumn/Winter of 2016. The pair characterizes track related competitions happening during Spring and Summer. Another interesting case is the gift emoji that in Autumn and Winter relates to a Christmas gift, as it is highly correlated to and , while in Spring and Summer it is mostly used as a birthday gift as it is associated to emojis like and . The case of the pair can relate to either mass-shooting events or could simply suggests that in Autumn students have a hard time with the beginning of the new school year. One of the emojis that seems to be used differently in Autumn and Winter is the Skull , likely due to the usage of this emoji during Halloween time."
        },
        {
            "heading": "4 How Does Temporal Information Help Emoji Prediction?",
            "text": "In this section we evaluate how temporal information can improve the accuracy of emoji prediction models. We use the same experimental settings as [BBS17], except we predict 300 emojis classes in instead of 20. We use temporal information as an input to the classifier in addition to the tweet. The date is encoded as a vector of three dimensions, where the first dimension is the month (1-12), the second dimension is the day of the week (1-7), and the last dimension is the local hour (1-24) when the tweet was posted. In the following we describe our classifier architecture with two variants to fuse temporal information with text."
        },
        {
            "heading": "4.1 Emoji Prediction Model",
            "text": "We start from the state-of-the-art emoji prediction classifier [BBS17], and built two different methods – early and late temproral signal fusion– to incorporate the date information. The two entry points for fusing temporal information are evaluated in Section 4.2."
        },
        {
            "heading": "4.1.1 Main Architecture",
            "text": "Inspired by [BBS17], the main architecture begins to extract two different embeddings. The Char B-LSTM takes a sequence of characters and outputs a word embedded vector as in [LLM+15]. The Char B-LSTM output is then concatenated with the word representation as in [BBS17] and passed to the Word LSTM and Word Attention units. We use the attention mechanism introduced in [YYD+16], which can be considered as a weighted average of the output of the Word LSTM, where the weights are learned during training. Finally the fully connected layers and the softmax play the role of the final classifier."
        },
        {
            "heading": "4.1.2 Date Module",
            "text": "As previously said the date information is encoded as a vector of three dimensions (month, week day, and hour). For each of these dimensions we create a look up table of vectors of size 10, and vocabulary of 12, 7, and 24 respectively. In this way, we can learn vectors of each month, day of the week and hour, using them for the final classification. These vectors are concatenated all together and incorporated in two different ways in the base system: at an early stage or at late stage. The early stage consists in concatenating this date embeddings to the word representation (char+word embeddings) and pass them to the Word LSTM. The late incorporation consists in concatenating the date embeddings with the output vector of the word attention and make the final predictions. We only use one of the methods to include date without combining them."
        },
        {
            "heading": "4.2 Emoji Prediction Experiments",
            "text": "We evaluate the automatic prediction of the 300 emojis with three different systems using the method: without date information, using the early method to incorporate date information and using the late date method.\nIn Table 5 we report results for the three models using Precision, Recall, Macro F1, Accuracy at 1,3,5,10, and Coverage error. Coverage error (CE) is defined as the average number of labels that have to be in-\ncluded in the final prediction such that all true labels are predicted.\nFrom the results we can see that the best system is the model with early incorporation of the date as it outperforms all the other models. The late date method is the worst system, even if it seems to create better prediction distributions than the without date system, since the CE is lower. In Table 6 we report the emojis with higher gain in F1, from without date and early date, to understand the emojis that depend most on the time information. Among all of the emojis we can see emojis that clearly depend on the month (St. Patrick day, Summer) or the hour (sunrise, moon)."
        },
        {
            "heading": "5 Conclusions",
            "text": "In the best of our knowledge, this is the first study to investigate if and how temporal information affects the interpretation and prediction of emojis. We studied whether the semantics of emojis change over different seasons, comparing emoji embeddings trained on a corpus of different seasons (Spring, Summer, Autumn, Winter) and show that some emojis are used differently depending on the time of the year, for example\n, , and . Moreover, we proposed a method to take in account the date information for emoji prediction systems, slightly improving the state-of-the-art. We show that, using the date information, the accuracy of some emojis can be improved. Some of them are clearly time dependent (e.g., , ). Others are not directly associated to time but time information helps to predict them ( , , and ).\nIn the future we plan to study the semantics of emojis over the day (morning/night) or over the week (weekdays/weekend) and improve the date information modules, trying the two methods we proposed together (early+late)."
        },
        {
            "heading": "Acknowledgments",
            "text": "Part of this work was done when Francesco B. interned at Snap Inc. Francesco B. and Horacio S. acknowledge support from the TUNER project (TIN2015-65308C5-5-R, MINECO/FEDER, UE) and the Maria de Maeztu Units of Excellence Programme (MDM-20150502)."
        }
    ],
    "title": "Exploring Emoji Usage and Prediction Through a Temporal Variation Lens",
    "year": 2018
}