{
    "abstractText": "Unsupervised image-to-image translation aims at learning a joint distribution of images in different domains by using images from the marginal distributions in individual domains. Since there exists an infinite set of joint distributions that can arrive the given marginal distributions, one could infer nothing about the joint distribution from the marginal distributions without additional assumptions. To address the problem, we make a shared-latent space assumption and propose an unsupervised image-to-image translation framework based on Coupled GANs. We compare the proposed framework with competing approaches and present high quality image translation results on various challenging unsupervised image translation tasks, including street scene image translation, animal image translation, and face image translation. We also apply the proposed framework to domain adaptation and achieve state-of-the-art performance on benchmark datasets. Code and additional results are available in https://github.com/mingyuliutw/unit.",
    "authors": [
        {
            "affiliations": [],
            "name": "Ming-Yu Liu"
        },
        {
            "affiliations": [],
            "name": "Thomas Breuel"
        },
        {
            "affiliations": [],
            "name": "Jan Kautz"
        }
    ],
    "id": "SP:7de59442e1979e424b0fa3f4c02344fb5932ef93",
    "references": [
        {
            "authors": [
                "M. Arjovsky",
                "S. Chintala",
                "L. Bottou"
            ],
            "title": "Wasserstein gan",
            "venue": "arXiv preprint arXiv:1701.07875,",
            "year": 2017
        },
        {
            "authors": [
                "M. Cordts",
                "M. Omran",
                "S. Ramos",
                "T. Scharwächter",
                "M. Enzweiler",
                "R. Benenson",
                "U. Franke",
                "S. Roth",
                "B. Schiele"
            ],
            "title": "The cityscapes dataset",
            "venue": "Conference on Computer Vision and Pattern Recognition Workshop,",
            "year": 2015
        },
        {
            "authors": [
                "E.L. Denton",
                "S. Chintala",
                "R. Fergus"
            ],
            "title": "Deep generative image models using a laplacian pyramid of adversarial networks",
            "venue": "Advances in Neural Information Processing Systems,",
            "year": 2015
        },
        {
            "authors": [
                "B. Fernando",
                "A. Habrard",
                "M. Sebban",
                "T. Tuytelaars"
            ],
            "title": "Unsupervised visual domain adaptation using subspace alignment",
            "venue": "International Conference on Computer Vision,",
            "year": 2013
        },
        {
            "authors": [
                "Y. Ganin",
                "E. Ustinova",
                "H. Ajakan",
                "P. Germain",
                "H. Larochelle",
                "F. Laviolette",
                "M. Marchand",
                "V. Lempitsky"
            ],
            "title": "Domain-adversarial training of neural networks",
            "venue": "Journal of Machine Learning Research,",
            "year": 2016
        },
        {
            "authors": [
                "I. Goodfellow",
                "J. Pouget-Abadie",
                "M. Mirza",
                "B. Xu",
                "D. Warde-Farley",
                "S. Ozair",
                "A. Courville",
                "Y. Bengio"
            ],
            "title": "Generative adversarial nets",
            "venue": "Advances in Neural Information Processing Systems,",
            "year": 2014
        },
        {
            "authors": [
                "K. He",
                "X. Zhang",
                "S. Ren",
                "J. Sun"
            ],
            "title": "Deep residual learning for image recognition",
            "venue": "Computer Vision and Pattern Recognition,",
            "year": 2016
        },
        {
            "authors": [
                "P. Isola",
                "J.-Y. Zhu",
                "T. Zhou",
                "A.A. Efros"
            ],
            "title": "Image-to-image translation with conditional adversarial networks",
            "venue": "Conference on Computer Vision and Pattern Recognition,",
            "year": 2017
        },
        {
            "authors": [
                "J. Johnson",
                "A. Alahi",
                "L. Fei-Fei"
            ],
            "title": "Perceptual losses for real-time style transfer and super-resolution",
            "venue": "European Conference in Computer Vision,",
            "year": 2016
        },
        {
            "authors": [
                "T. Kim",
                "M. Cha",
                "H. Kim",
                "J. Lee",
                "J. Kim"
            ],
            "title": "Learning to discover cross-domain relations with generative adversarial networks",
            "venue": "International Conference on Machine Learning,",
            "year": 2017
        },
        {
            "authors": [
                "D. Kingma",
                "J. Ba"
            ],
            "title": "Adam: A method for stochastic optimization",
            "venue": "International Conference on Learning Representations,",
            "year": 2015
        },
        {
            "authors": [
                "D.P. Kingma",
                "T. Salimans",
                "M. Welling"
            ],
            "title": "Improving variational inference with inverse autoregressive flow",
            "venue": "Advances in Neural Information Processing Systems,",
            "year": 2016
        },
        {
            "authors": [
                "D.P. Kingma",
                "M. Welling"
            ],
            "title": "Auto-encoding variational bayes",
            "venue": "International Conference on Learning Representations,",
            "year": 2014
        },
        {
            "authors": [
                "A.B.L. Larsen",
                "S.K. Sønderby",
                "H. Larochelle",
                "O. Winther"
            ],
            "title": "Autoencoding beyond pixels using a learned similarity metric",
            "venue": "International Conference on Machine Learning,",
            "year": 2016
        },
        {
            "authors": [
                "C. Ledig",
                "L. Theis",
                "F. Huszár",
                "J. Caballero",
                "A. Cunningham",
                "A. Acosta",
                "A. Aitken",
                "A. Tejani",
                "J. Totz",
                "Z. Wang"
            ],
            "title": "Photo-realistic single image super-resolution using a generative adversarial network",
            "venue": "Conference on Computer Vision and Pattern Recognition,",
            "year": 2017
        },
        {
            "authors": [
                "T. Lindvall"
            ],
            "title": "Lectures on the coupling method",
            "venue": "Courier Corporation,",
            "year": 2002
        },
        {
            "authors": [
                "M.-Y. Liu",
                "O. Tuzel"
            ],
            "title": "Coupled generative adversarial networks",
            "venue": "Advances in Neural Information Processing Systems,",
            "year": 2016
        },
        {
            "authors": [
                "Z. Liu",
                "P. Luo",
                "X. Wang",
                "X. Tang"
            ],
            "title": "Deep learning face attributes in the wild",
            "venue": "International Conference on Computer Vision,",
            "year": 2015
        },
        {
            "authors": [
                "L. Maaløe",
                "C.K. Sønderby",
                "S.K. Sønderby",
                "O. Winther"
            ],
            "title": "Auxiliary deep generative models",
            "venue": "International Conference on Machine Learning,",
            "year": 2016
        },
        {
            "authors": [
                "Y. Netzer",
                "T. Wang",
                "A. Coates",
                "A. Bissacco",
                "B. Wu",
                "A.Y. Ng"
            ],
            "title": "Reading digits in natural images with unsupervised feature learning",
            "venue": "Advances in Neural Information Processing Systems workshop,",
            "year": 2011
        },
        {
            "authors": [
                "A. Radford",
                "L. Metz",
                "S. Chintala"
            ],
            "title": "Unsupervised representation learning with deep convolutional generative adversarial networks",
            "venue": "International Conference on Learning Representations,",
            "year": 2016
        },
        {
            "authors": [
                "D.J. Rezende",
                "S. Mohamed",
                "D. Wierstra"
            ],
            "title": "Stochastic backpropagation and variational inference in deep latent gaussian models",
            "venue": "International Conference on Machine Learning,",
            "year": 2014
        },
        {
            "authors": [
                "G. Ros",
                "L. Sellart",
                "J. Materzynska",
                "D. Vazquez",
                "A. Lopez"
            ],
            "title": "The SYNTHIA Dataset: A large collection of synthetic images for semantic segmentation of urban scenes",
            "venue": "Conference on Computer Vision and Pattern Recognition,",
            "year": 2016
        },
        {
            "authors": [
                "T. Salimans",
                "I. Goodfellow",
                "W. Zaremba",
                "V. Cheung",
                "A. Radford",
                "X. Chen"
            ],
            "title": "Improved techniques for training gans",
            "venue": "Advances in Neural Information Processing Systems,",
            "year": 2016
        },
        {
            "authors": [
                "A. Shrivastava",
                "T. Pfister",
                "O. Tuzel",
                "J. Susskind",
                "W. Wang",
                "R. Webb"
            ],
            "title": "Learning from simulated and unsupervised images through adversarial training",
            "venue": "Conference on Computer Vision and Pattern Recognition,",
            "year": 2017
        },
        {
            "authors": [
                "Y. Taigman",
                "A. Polyak",
                "L. Wolf"
            ],
            "title": "Unsupervised cross-domain image generation",
            "venue": "International Conference on Learning Representations,",
            "year": 2017
        },
        {
            "authors": [
                "A. van den Oord",
                "N. Kalchbrenner",
                "L. Espeholt",
                "O. Vinyals",
                "A. Graves"
            ],
            "title": "Conditional image generation with pixelcnn decoders",
            "venue": "Advances in Neural Information Processing Systems,",
            "year": 2016
        },
        {
            "authors": [
                "X. Yan",
                "J. Yang",
                "K. Sohn",
                "H. Lee"
            ],
            "title": "Attribute2image: Conditional image generation from visual attributes",
            "venue": "European Conference in Computer Vision,",
            "year": 2016
        },
        {
            "authors": [
                "J.-Y. Zhu",
                "T. Park",
                "P. Isola",
                "A.A. Efros"
            ],
            "title": "Unpaired image-to-image translation using cycle-consistent adversarial networks",
            "venue": "International Conference on Computer Vision,",
            "year": 2017
        }
    ],
    "sections": [
        {
            "heading": "1 Introduction",
            "text": "Many computer visions problems can be posed as an image-to-image translation problem, mapping an image in one domain to a corresponding image in another domain. For example, super-resolution can be considered as a problem of mapping a low-resolution image to a corresponding high-resolution image; colorization can be considered as a problem of mapping a gray-scale image to a corresponding color image. The problem can be studied in supervised and unsupervised learning settings. In the supervised setting, paired of corresponding images in different domains are available [8, 15]. In the unsupervised setting, we only have two independent sets of images where one consists of images in one domain and the other consists of images in another domain—there exist no paired examples showing how an image could be translated to a corresponding image in another domain. Due to lack of corresponding images, the UNsupervised Image-to-image Translation (UNIT) problem is considered harder, but it is more applicable since training data collection is easier.\nWhen analyzing the image translation problem from a probabilistic modeling perspective, the key challenge is to learn a joint distribution of images in different domains. In the unsupervised setting, the two sets consist of images from two marginal distributions in two different domains, and the task is to infer the joint distribution using these images. The coupling theory [16] states there exist an infinite set of joint distributions that can arrive the given marginal distributions in general. Hence, inferring the joint distribution from the marginal distributions is a highly ill-posed problem. To address the ill-posed problem, we need additional assumptions on the structure of the joint distribution.\nTo this end we make a shared-latent space assumption, which assumes a pair of corresponding images in different domains can be mapped to a same latent representation in a shared-latent space. Based on the assumption, we propose a UNIT framework that are based on generative adversarial networks (GANs) and variational autoencoders (VAEs). We model each image domain using a VAE-GAN. The adversarial training objective interacts with a weight-sharing constraint, which enforces a sharedlatent space, to generate corresponding images in two domains, while the variational autoencoders relate translated images with input images in the respective domains. We applied the proposed\n31st Conference on Neural Information Processing Systems (NIPS 2017), Long Beach, CA, USA.\nar X\niv :1\n70 3.\n00 84\n8v 6\n[ cs\n.C V\n] 2\n3 Ju\nl 2 01\n8\nframework to various unsupervised image-to-image translation problems and achieved high quality image translation results. We also applied it to the domain adaptation problem and achieved state-ofthe-art accuracies on benchmark datasets. The shared-latent space assumption was used in Coupled GAN [17] for joint distribution learning. Here, we extend the Coupled GAN work for the UNIT problem. We also note that several contemporary works propose the cycle-consistency constraint assumption [29, 10], which hypothesizes the existence of a cycle-consistency mapping so that an image in the source domain can be mapped to an image in the target domain and this translated image in the target domain can be mapped back to the original image in the source domain. In the paper, we show that the shared-latent space constraint implies the cycle-consistency constraint."
        },
        {
            "heading": "2 Assumptions",
            "text": "Let X1 and X2 be two image domains. In supervised image-to-image translation, we are given samples (x1, x2) drawn from a joint distribution PX1,X2(x1, x2). In unsupervised image-to-image translation, we are given samples drawn from the marginal distributions PX1(x1) and PX2(x2). Since an infinite set of possible joint distributions can yield the given marginal distributions, we could infer nothing about the joint distribution from the marginal samples without additional assumptions.\nWe make the shared-latent space assumption. As shown Figure 1, we assume for any given pair of images x1 and x2, there exists a shared latent code z in a shared-latent space, such that we can recover both images from this code, and we can compute this code from each of the two images. That is, we postulate there exist functions E∗1 , E ∗ 2 , G ∗ 1, and G ∗ 2 such that, given a pair of corresponding images (x1, x2) from the joint distribution, we have z = E∗1 (x1) = E ∗ 2 (x2) and conversely x1 = G∗1(z) and x2 = G ∗ 2(z). Within this model, the function x2 = F ∗ 1→2(x1) that maps from X1 to X2 can be represented by the composition F ∗1→2(x1) = G∗2(E∗1 (x1)). Similarly, x1 = F ∗ 2→1(x2) = G ∗ 1(E ∗ 2 (x2)). The UNIT problem then becomes a problem of learning F ∗ 1→2 and F ∗2→1. We note that a necessary condition for F ∗ 1→2 and F ∗ 2→1 to exist is the cycle-consistency constraint [29, 10]: x1 = F ∗2→1(F ∗ 1→2(x1)) and x2 = F ∗ 1→2(F ∗ 2→1(x2)). We can reconstruct the input image from translating back the translated input image. In other words, the proposed shared-latent space assumption implies the cycle-consistency assumption (but not vice versa).\nTo implement the shared-latent space assumption, we further assume a shared intermediate representation h such that the process of generating a pair of corresponding images admits a form of\nz → h ↗ x1↘ x2 . (1)\nConsequently, we have G∗1 ≡ G∗L,1 ◦G∗H and G∗2 ≡ G∗L,2 ◦G∗H where G∗H is a common high-level generation function that maps z to h and G∗L,1 and G ∗ L,2 are low-level generation functions that map h to x1 and x2, respectively. In the case of multi-domain image translation (e.g., sunny and rainy image translation), z can be regarded as the compact, high-level representation of a scene (\"car in front, trees in back\"), and h can be considered a particular realization of z through G∗H (\"car/tree occupy the following pixels\"), and G∗L,1 and G ∗ L,2 would be the actual image formation functions in each modality (\"tree is lush green in the sunny domain, but dark green in the rainy domain\"). Assuming h also allow us to represent E∗1 and E ∗ 2 by E ∗ 1 ≡ E∗H ◦ E∗L,1 and E∗2 ≡ E∗H ◦ E∗L,2.\nIn the next section, we discuss how we realize the above ideas in the proposed UNIT framework."
        },
        {
            "heading": "3 Framework",
            "text": "Our framework, as illustrated in Figure 1, is based on variational autoencoders (VAEs) [13, 22, 14] and generative adversarial networks (GANs) [6, 17]. It consists of 6 subnetworks: including two domain image encoders E1 and E2, two domain image generators G1 and G2, and two domain adversarial discriminators D1 and D2. Several ways exist to interpret the roles of the subnetworks, which we summarize in Table 1. Our framework learns translation in both directions in one shot.\nVAE. The encoder–generator pair {E1, G1} constitutes a VAE for the X1 domain, termed VAE1. For an input image x1 ∈ X1, the VAE1 first maps x1 to a code in a latent space Z via the encoder E1 and then decodes a random-perturbed version of the code to reconstruct the input image via the generator G1. We assume the components in the latent spaceZ are conditionally independent and Gaussian with unit variance. In our formulation, the encoder outputs a mean vector Eµ,1(x1) and the distribution of the latent code z1 is given by q1(z1|x1) ≡ N (z1|Eµ,1(x1), I) where I is an identity matrix. The reconstructed image is x̃1→11 = G1(z1 ∼ q1(z1|x1)). Note that here we abused the notation since we treated the distribution of q1(z1|x1) as a random vector of N (Eµ,1(x1), I) and sampled from it. Similarly, {E2, G2} constitutes a VAE for X2: VAE2 where the encoder E2 outputs a mean vector Eµ,2(x2) and the distribution of the latent code z2 is given by q2(z2|x2) ≡ N (z2|Eµ,2(x2), I). The reconstructed image is x̃2→22 = G2(z2 ∼ q2(z2|x2)). Utilizing the reparameterization trick [13], the non-differentiable sampling operation can be reparameterized as a differentiable operation using auxiliary random variables. This reparameterization trick allows us to train VAEs using back-prop. Let η be a random vector with a multi-variate Gaussian distribution: η ∼ N (η|0, I). The sampling operations of z1 ∼ q1(z1|x1) and z2 ∼ q2(z2|x2) can be implemented via z1 = Eµ,1(x1) + η and z2 = Eµ,2(x2) + η, respectively.\nWeight-sharing. Based on the shared-latent space assumption discussed in Section 2, we enforce a weight-sharing constraint to relate the two VAEs. Specifically, we share the weights of the last few layers of E1 and E2 that are responsible for extracting high-level representations of the input images in the two domains. Similarly, we share the weights of the first few layers of G1 and G2 responsible for decoding high-level representations for reconstructing the input images.\nNote that the weight-sharing constraint alone does not guarantee that corresponding images in two domains will have the same latent code. In the unsupervised setting, no pair of corresponding images in the two domains exists to train the network to output a same latent code. The extracted latent codes for a pair of corresponding images are different in general. Even if they are the same, the same latent component may have different semantic meanings in different domains. Hence, the same latent code could still be decoded to output two unrelated images. However, we will show that through adversarial training, a pair of corresponding images in the two domains can be mapped to a common latent code by E1 and E2, respectively, and a latent code will be mapped to a pair of corresponding images in the two domains by G1 and G2, respectively.\nThe shared-latent space assumption allows us to perform image-to-image translation. We can translate an image x1 in X1 to an image in X2 through applying G2(z1 ∼ q1(z1|x1)). We term such an information processing stream as the image translation stream. Two image translation streams exist in the proposed framework: X1 → X2 and X2 → X1. The two streams are trained jointly with the two image reconstruction streams from the VAEs. Once we could ensure that a pair of corresponding\nimages are mapped to a same latent code and a same latent code is decoded to a pair of corresponding images, (x1, G2(z1 ∼ q1(z1|x1))) would form a pair of corresponding images. In other words, the composition ofE1 andG2 functions approximates F ∗1→2 for unsupervised image-to-image translation discussed in Section 2, and the composition of E2 and G1 function approximates F ∗2→1.\nGANs. Our framework has two generative adversarial networks: GAN1 = {D1, G1} and GAN2 = {D2, G2}. In GAN1, for real images sampled from the first domain, D1 should output true, while for images generated by G1, it should output false. G1 can generate two types of images: 1) images from the reconstruction stream x̃1→11 = G1(z1 ∼ q1(z1|x1)) and 2) images from the translation stream x̃2→12 = G1(z2 ∼ q2(z2|x2)). Since the reconstruction stream can be supervisedly trained, it is suffice that we only apply adversarial training to images from the translation stream, x̃2→12 . We apply a similar processing to GAN2 where D2 is trained to output true for real images sampled from the second domain dataset and false for images generated from G2.\nCycle-consistency (CC). Since the shared-latent space assumption implies the cycle-consistency constraint (See Section 2), we could also enforce the cycle-consistency constraint in the proposed framework to further regularize the ill-posed unsupervised image-to-image translation problem. The resulting information processing stream is called the cycle-reconstruction stream.\nLearning. We jointly solve the learning problems of the VAE1, VAE2, GAN1 and GAN2 for the image reconstruction streams, the image translation streams, and the cycle-reconstruction streams:\nmin E1,E2,G1,G2 max D1,D2\nLVAE1(E1, G1) + LGAN1(E2, G1, D1) + LCC1(E1, G1, E2, G2)\nLVAE2(E2, G2) + LGAN2(E1, G2, D2) + LCC2(E2, G2, E1, G1). (2) VAE training aims for minimizing a variational upper bound In (2), the VAE objects are\nLVAE1(E1, G1) =λ1KL(q1(z1|x1)||pη(z))− λ2Ez1∼q1(z1|x1)[log pG1(x1|z1)] (3) LVAE2(E2, G2) =λ1KL(q2(z2|x2)||pη(z))− λ2Ez2∼q2(z2|x2)[log pG2(x2|z2)]. (4)\nwhere the hyper-parameters λ1 and λ2 control the weights of the objective terms and the KL divergence terms penalize deviation of the distribution of the latent code from the prior distribution. The regularization allows an easy way to sample from the latent space [13]. We model pG1 and pG2 using Laplacian distributions, respectively. Hence, minimizing the negative log-likelihood term is equivalent to minimizing the absolute distance between the image and the reconstructed image. The prior distribution is a zero mean Gaussian pη(z) = N (z|0, I). In (2), the GAN objective functions are given by\nLGAN1(E2, G1, D1) = λ0Ex1∼PX1 [logD1(x1)] + λ0Ez2∼q2(z2|x2)[log(1−D1(G1(z2)))] (5) LGAN2(E1, G2, D2) = λ0Ex2∼PX2 [logD2(x2)] + λ0Ez1∼q1(z1|x1)[log(1−D2(G2(z1)))]. (6)\nThe objective functions in (5) and (6) are conditional GAN objective functions. They are used to ensure the translated images resembling images in the target domains, respectively. The hyperparameter λ0 controls the impact of the GAN objective functions.\nWe use a VAE-like objective function to model the cycle-consistency constraint, which is given by\nLCC1(E1, G1, E2, G2) =λ3KL(q1(z1|x1)||pη(z)) + λ3KL(q2(z2|x1→21 ))||pη(z))− λ4Ez2∼q2(z2|x1→21 )[log pG1(x1|z2)] (7) LCC2(E2, G2, E1, G1) =λ3KL(q2(z2|x2)||pη(z)) + λ3KL(q1(z1|x2→12 ))||pη(z))− λ4Ez1∼q1(z1|x2→12 )[log pG2(x2|z1)]. (8)\nwhere the negative log-likelihood objective term ensures a twice translated image resembles the input one and the KL terms penalize the latent codes deviating from the prior distribution in the cycle-reconstruction stream (Therefore, there are two KL terms). The hyper-parameters λ3 and λ4 control the weights of the two different objective terms.\nInheriting from GAN, training of the proposed framework results in solving a mini-max problem where the optimization aims to find a saddle point. It can be seen as a two player zero-sum game. The first player is a team consisting of the encoders and generators. The second player is a team consisting of the adversarial discriminators. In addition to defeating the second player, the first player has to minimize the VAE losses and the cycle-consistency losses. We apply an alternating gradient\nupdate scheme similar to the one described in [6] to solve (2). Specifically, we first apply a gradient ascent step to update D1 and D2 with E1, E2, G1, and G2 fixed. We then apply a gradient descent step to update E1, E2, G1, and G2 with D1 and D2 fixed.\nTranslation: After learning, we obtain two image translation functions by assembling a subset of the subnetworks. We have F1→2(x1) = G2(z1 ∼ q1(z1|x1)) for translating images from X1 to X2 and F2→1(x2) = G1(z2 ∼ q2(z2|x2)) for translating images from X2 to X1."
        },
        {
            "heading": "4 Experiments",
            "text": "We first analyze various components of the proposed framework. We then present visual results on challenging translation tasks. Finally, we apply our framework to the domain adaptation tasks.\nPerformance Analysis. We used ADAM [11] for training where the learning rate was set to 0.0001 and momentums were set to 0.5 and 0.999. Each mini-batch consisted of one image from the first domain and one image from the second domain. Our framework had several hyper-parameters. The default values were λ0 = 10, λ3 = λ1 = 0.1 and λ4 = λ2 = 100. For the network architecture, our encoders consisted of 3 convolutional layers as the front-end and 4 basic residual blocks [7] as the back-end. The generators consisted of 4 basic residual blocks as the front-end and 3 transposed convolutional layers as the back-end. The discriminators consisted of stacks of convolutional layers. We used LeakyReLU for nonlinearity. The details of the networks are given in Appendix A.\nWe used the map dataset [8] (visualized in Figure 2), which contained corresponding pairs of images in two domains (satellite image and map) useful for quantitative evaluation. Here, the goal was to learn to translate between satellite images and maps. We operated in an unsupervised setting where we used the 1096 satellite images from the training set as the first domain and 1098 maps from the validation set as the second domain. We trained for 100K iterations and used the final model to translate 1098 satellite images in the test set. We then compared the difference between a translated satellite image (supposed to be maps) and the corresponding ground truth maps pixel-wisely. A pixel translation was counted correct if the color difference was within 16 of the ground truth color value. We used the average pixel accuracy over the images in the test set as the performance metric. We could use color difference for measuring translation accuracy since the target translation function was unimodal. We did not evaluate the translation from maps to images since the translation was multi-modal, which was difficult to construct a proper evaluation metric.\nIn one experiment, we varied the number of weight-sharing layers in the VAEs and paired each configuration with discriminator architectures of different depths during training. We changed the number of weight-sharing layers from 1 to 4. (Sharing 1 layer in VAEs means sharing 1 layer for E1 and E2 and, at the same time, sharing 1 layer for G1 and G2.) The results were reported in Figure 2(b). Each curve corresponded to a discriminator architecture of a different depth. The x-axis denoted the number of weigh-sharing layers in the VAEs. We found that the shallowest discriminator architecture led to the worst performance. We also found that the number of weight-sharing layer had little impact. This was due to the use of the residual blocks. As tying the weight of one layer, it effectively constrained the other layers since the residual blocks only updated the residual information. In the rest of the experiments, we used VAEs with 1 sharing layer and discriminators of 5 layers.\nWe analyzed impact of the hyper-parameter values to the translation accuracy. For different weight values on the negative log likelihood terms (i.e., λ2, λ4), we computed the achieved translation accuracy over different weight values on the KL terms (i.e., λ1, λ3). The results were reported in Figure 2(c). We found that, in general, a larger weight value on the negative log likelihood terms yielded a better translation accuracy. We also found setting the weights of the KL terms to 0.1 resulted in consistently good performance. We hence set λ1 = λ3 = 0.1 and λ2 = λ4 = 100.\nWe performed an ablation study measuring impact of the weight-sharing and cycle-consistency constraints to the translation performance and showed the results in Figure 2(d). We reported average accuracy over 5 trials (trained with different initialized weights.). We note that when we removed the weight-sharing constraint (as a consequence, we also removed the reconstruction streams in the framework), the framework was reduced to the CycleGAN architecture [29, 10]. We found the model achieved an average pixel accuracy of 0.569. When we removed the cycle-consistency constraint and only used the weight-sharing constraint1, it achieved 0.568 average pixel accuracy. But when we used the full model, it achieved the best performance of 0.600 average pixel accuracy. This echoed our point that for the ill-posed joint distribution recovery problem, more constraints are beneficial.\nQualitative results. Figure 3 to 6 showed results of the proposed framework on various UNIT tasks.\nStreet images. We applied the proposed framework to several unsupervised street scene image translation tasks including sunny to rainy, day to night, summery to snowy, and vice versa. For each task, we used a set of images extracted from driving videos recorded at different days and cities. The numbers of the images in the sunny/day, rainy, night, summery, and snowy sets are 86165, 28915, 36280, 6838, and 6044. We trained the network to translate street scene image of size 640×480. In Figure 3, we showed several example translation results . We found that our method could generate realistic translated images. We also found that one translation was usually harder than the other. Specifically, the translation that required adding more details to the image was usually harder (e.g. night to day). Additional results are available in https://github.com/mingyuliutw/unit.\nSynthetic to real. In Figure 3, we showed several example results achieved by applying the proposed framework to translate images between the synthetic images in the SYNTHIA dataset [23] and the real images in the Cityscape dataset [2]. For the real to synthetic translation, we found our method made the cityscape images cartoon like. For the synthetic to real translation, our method achieved better results in the building, sky, road, and car regions than in the human regions.\nDog breed conversion. We used the images of Husky, German Shepherd, Corgi, Samoyed, and Old English Sheep dogs in the ImageNet dataset to learn to translate dog images between different breeds. We only used the head regions, which were extracted by a template matching algorithm. Several example results were shown in Figure 4. We found our method translated a dog to a different breed.\nCat species conversion. We also used the images of house cat, tiger, lion, cougar, leopard, jaguar, and cheetah in the ImageNet dataset to learn to translate cat images between different species. We only used the head regions, which again were extracted by a template matching algorithm. Several example results were shown in Figure 5. We found our method translated a cat to a different specie.\nFace attribute. We used the CelebA dataset [18] for attribute-based face images translation. Each face image in the dataset had several attributes, including blond hair, smiling, goatee, and eyeglasses. The face images with an attribute constituted the 1st domain, while those without the attribute constituted the 2nd domain. In Figure 6, we visualized the results where we translated several images that do not have blond hair, eye glasses, goatee, and smiling to corresponding images with each of the individual attributes. We found that the translated face images were realistic.\nDomain Adaptation. We applied the proposed framework to the problem for adapting a classifier trained using labeled samples in one domain (source domain) to classify samples in a new domain (target domain) where labeled samples in the new domain are unavailable during training. Early works have explored ideas from subspace learning [4] to deep feature learning [5, 17, 26].\nWe performed multi-task learning where we trained the framework to 1) translate images between the source and target domains and 2) classify samples in the source domain using the features extracted by the discriminator in the source domain. Here, we tied the weights of the high-level layers of D1 and D2. This allows us to adapt a classifier trained in the source domain to the target domain. Also, for a pair of generated images in different domains, we minimized the L1 distance\n1We used this architecture in an earlier version of the paper.\nbetween the features extracted by the highest layer of the discriminators, which further encouraged D1 and D2 to interpret a pair of corresponding images in the same way. We applied the approach to several tasks including adapting from the Street View House Number (SVHN) dataset [20] to the MNIST dataset and adapting between the MNIST and USPS datasets. Table 2 reported the achieved performance with comparison to the competing approaches. We found that our method achieved a 0.9053 accuracy for the SVHN→MNIST task, which was much better than 0.8488 achieved by the previous state-of-the-art method [26]. We also achieved better performance for the MNIST↔SVHN task than the Coupled GAN approach, which was the state-of-the-art. The digit images had a small resolution. Hence, we used a small network. We also found that the cycle-consistency constraint was not necessary for this task. More details about the experiments are available in Appendix B."
        },
        {
            "heading": "5 Related Work",
            "text": "Several deep generative models were recently proposed for image generation including GANs [6], VAEs [13, 22], and PixelCNN [27]. The proposed framework was based on GANs and VAEs but it was designed for the unsupervised image-to-image translation task, which could be considered as a conditional image generation model. In the following, we first review several recent GAN and VAE works and then discuss related image translation works.\nGAN learning is via staging a zero-sum game between the generator and discriminator. The quality of GAN-generated images had improved dramatically since the introduction. LapGAN [3] proposed a Laplacian pyramid implementation of GANs. DCGAN [21] used a deeper convolutional network. Several GAN training tricks were proposed in [24]. WGAN [1] used the Wasserstein distance.\nVAEs optimize a variational bound. By improving the variational approximation, better image generation results were achieved [19, 12]. In [14], a VAE-GAN architecture was proposed to improve image generation quality of VAEs. VAEs were applied to translate face image attribute in [28].\nConditional generative model is a popular approach for mapping an image from one domain to another. Most of the existing works were based on supervised learning [15, 8, 9]. Our work differed to the previous works in that we do not need corresponding images. Recently, [26] proposed the domain transformation network (DTN) and achieved promising results on translating small resolution face and digit images. In addition to faces and digits, we demonstrated that the proposed framework can translate large resolution natural images. It also achieved a better performance in the unsupervised domain adaptation task. In [25], a conditional generative adversarial network-based approach was proposed to translate a rendering images to a real image for gaze estimation. In order to ensure the generated real image was similar to the original rendering image, the L1 distance between the generated and original image was minimized. We note that two contemporary papers [29, 10] independently introduced the cycle-consistency constraint for the unsupervised image translation. We showed that that the cycle-consistency constraint is a natural consequence of the proposed shared-latent space assumption. From our experiment, we found that cycle-consistency and the weight-sharing (a realization of the shared-latent space assumption) constraints rendered comparable performance. When the two constraints were jointed used, the best performance was achieved."
        },
        {
            "heading": "6 Conclusion and Future Work",
            "text": "We presented a general framework for unsupervised image-to-image translation. We showed it learned to translate an image from one domain to another without any corresponding images in two domains in the training dataset. The current framework has two limitations. First, the translation model is unimodal due to the Gaussian latent space assumption. Second, training could be unstable due to the saddle point searching problem. We plan to address these issues in the future work."
        },
        {
            "heading": "A Network Architecture",
            "text": "The network architecture used for the unsupervised image-to-image translation experiments is given in Table 3. We use the following abbreviation for ease of presentation: N=Neurons, K=Kernel size, S=Stride size. The transposed convolutional layer is denoted by DCONV. The residual basic block is denoted as RESBLK."
        },
        {
            "heading": "B Domain Adaptation",
            "text": "MNIST↔USPS. For the MNIST and USPS adaptation experiments, we used the entire training sets in the two domains (60000 training images for MNIST and 7291 training images for USPS) for learning and reported the classification performance on the test sets (10000 test images for MNIST and 2007 test images for USPS). The MNIST and USPS images had different sizes, we resized them to 28×28 for facilitating the experiments. We trained the Coupled GAN algorithm [17] using the same setting for a fair comparison.\nThe encoder and generator architecture was given in Table 4. For the discriminators and classifiers, we used an architecture akin to the one used in the Coupled GAN paper, which is given in Table 5.\nSVHN→MNIST. For the SVHN and MNIST domain adaptation experiment, we used the extra training set (consisting of 531131 images) in the SVHN dataset for the source domain and the training set (consisting of 60000 images) in the MNIST dataset for the target domain as in the DTN work [26]. The test set consists of 10000 images in the MNIST test dataset. The MNIST images were in gray-scale. We converted them to RGB images and performed a data augmentation where we also used the inversions of the original MNIST images for training. All the images were resized to 32×32 for facilitating the experiment. We also found spatial context information was useful. For each input image, we created a 5-channel variant where the first three channels were the original RGB images and the last two channels were the normalized x and y coordinates.\nThe encoder and generator architecture was the same as the one used in the MNIST↔USPS domain adaptation. For the discriminators and the classifier, we used a network architecture akin to the one used in the DTN paper. The details are given in Table 6. We used dropout at every layer in the classifier for avoiding over-fitting."
        }
    ],
    "title": "Unsupervised Image-to-Image Translation Networks",
    "year": 2018
}