{
    "abstractText": "In the past, manually re-drawing an image in a certain artistic style required a professional artist and a long time. Doing this for a video sequence single-handed was beyond imagination. Nowadays computers provide new possibilities. We present an approach that transfers the style from one image (for example, a painting) to a whole video sequence. We make use of recent advances in style transfer in still images and propose new initializations and loss functions applicable to videos. This allows us to generate consistent and stable stylized video sequences, even in cases with large motion and strong occlusion. We show that the proposed method clearly outperforms simpler baselines both qualitatively and quantitatively.",
    "authors": [
        {
            "affiliations": [],
            "name": "Manuel Ruder"
        },
        {
            "affiliations": [],
            "name": "Alexey Dosovitskiy"
        },
        {
            "affiliations": [],
            "name": "Thomas Brox"
        }
    ],
    "id": "SP:3ee096aff93ab9a2374cdde06973db1996331d86",
    "references": [
        {
            "authors": [
                "D.J. Butler",
                "J. Wulff",
                "G.B. Stanley",
                "M.J. Black"
            ],
            "title": "A naturalistic open source movie for optical flow evaluation",
            "venue": "A. Fitzgibbon et al. (Eds.) (ed.) European Conf. on Computer Vision (ECCV). pp. 611–625. Part IV, LNCS 7577, Springer-Verlag",
            "year": 2012
        },
        {
            "authors": [
                "R. Collobert",
                "K. Kavukcuoglu",
                "C. Farabet"
            ],
            "title": "Torch7: A matlab-like environment for machine learning",
            "venue": "BigLearn, NIPS Workshop",
            "year": 2011
        },
        {
            "authors": [
                "L.A. Gatys",
                "A.S. Ecker",
                "M. Bethge"
            ],
            "title": "A neural algorithm of artistic style",
            "year": 2015
        },
        {
            "authors": [
                "J. Hays",
                "I. Essa"
            ],
            "title": "Image and video based painterly animation",
            "venue": "Proceedings of the 3rd International Symposium on Non-photorealistic Animation and Rendering. pp. 113–120",
            "year": 2004
        },
        {
            "authors": [
                "C. Li",
                "M. Wand"
            ],
            "title": "Combining markov random fields and convolutional neural networks for image synthesis",
            "year": 2016
        },
        {
            "authors": [
                "P. Litwinowicz"
            ],
            "title": "Processing images and video for an impressionist effect",
            "venue": "Proceedings of the 24th Annual Conference on Computer Graphics and Interactive Techniques. pp. 407–414",
            "year": 1997
        },
        {
            "authors": [
                "Y. Nikulin",
                "R. Novak"
            ],
            "title": "Exploring the neural algorithm of artistic style",
            "year": 2016
        },
        {
            "authors": [
                "P. O’Donovan",
                "A. Hertzmann"
            ],
            "title": "Anipaint: Interactive painterly animation from video",
            "venue": "IEEE Transactions on Visualization and Computer Graphics 18(3), 475– 487",
            "year": 2012
        },
        {
            "authors": [
                "J. Revaud",
                "P. Weinzaepfel",
                "Z. Harchaoui",
                "C. Schmid"
            ],
            "title": "EpicFlow: Edge-Preserving Interpolation of Correspondences for Optical Flow",
            "venue": "CVPR 2015 - IEEE Conference on Computer Vision & Pattern Recognition",
            "year": 2015
        },
        {
            "authors": [
                "K. Simonyan",
                "A. Zisserman"
            ],
            "title": "Very deep convolutional networks for large-scale image recognition",
            "venue": "CoRR abs/1409.1556 (2014),",
            "year": 2014
        },
        {
            "authors": [
                "N. Sundaram",
                "T. Brox",
                "K. Keutzer"
            ],
            "title": "Dense point trajectories by gpu-accelerated large displacement optical flow (Sept 2010), http://lmb.informatik",
            "year": 2010
        }
    ],
    "sections": [
        {
            "heading": "1 Introduction",
            "text": "There have recently been a lot of interesting contributions to the issue of style transfer using deep neural networks. Gatys et al. [3] proposed a novel approach using neural networks to capture the style of artistic images and transfer it to real world photographs. Their approach uses high-level feature representations of the images from hidden layers of the VGG convolutional network [10] to separate and reassemble content and style. This is done by formulating an optimization problem that, starting with white noise, searches for a new image showing similar neural activations as the content image and similar feature correlations (expressed by a Gram matrix) as the style image.\nThe present paper builds upon the approach from Gatys et al. [3] and extends style transfer to video sequences. Given an artistic image, we transfer its particular style of painting to the entire video. Processing each frame of the video independently leads to flickering and false discontinuities, since the solution of the style transfer task is not stable. To regularize the transfer and to preserve smooth transition between individual frames of the video, we introduce a temporal constraint that penalizes deviations between two frames. The temporal constraint takes the optical flow from the original video into account: instead of penalizing the deviations from the previous frame, we penalize deviation along the point trajectories. Disoccluded regions as well as motion boundaries are excluded from the penalizer. This allows the process to rebuild disoccluded regions\n? This work was supported by the ERC Starting Grant VideoLearn.\nar X\niv :1\n60 4.\n08 61\n0v 2\n[ cs\n.C V\n] 1\n9 O\nct 2\n01 6\nand distorted motion boundaries while preserving the appearance of the rest of the image, see Fig. 1.\nIn addition, we present two extensions of our approach. The first one aims on improving the consistency over larger periods of time. When a region that is occluded in some frame and disoccluded later gets rebuilt during the process, most likely this region will have a different appearance than before the occlusion. To solve this, we make use of long term motion estimates. This allows us to enforce consistency of the synthesized frames before and after the occlusion.\nSecondly, the style transfer tends to create artifacts at the image boundaries. For static images, these artifacts are hardly visible, yet for videos with strong camera motion they move towards the center of the image and get amplified. We developed a multi-pass algorithm, which processes the video in alternating directions using both forward and backward flow. This results in a more coherent video.\nWe quantitatively evaluated our approach in combination with different optical flow algorithms on the Sintel benchmark. Additionally we show qualitative results on several movie shots. We were able to successfully eliminate most of the temporal artifacts and can create smooth and coherent stylized videos."
        },
        {
            "heading": "2 Related work",
            "text": "Style transfer using deep networks: Gatys et al. [3] showed remarkable results by using the VGG-19 deep neural network for style transfer. Their approach was taken up by various follow-up papers that, among other things, proposed different ways to represent the style within the neural network. Li et al. [5] suggested an approach to preserve local patterns of the style image. Instead of using a global representation of the style, computed as Gram matrix, they used\npatches of the neural activation from the style image. Nikulin et al. [7] tried the style transfer algorithm by Gatys et al. on other nets than VGG and proposed several variations in the way the style of the image is represented to archive different goals like illumination or season transfer. However, we are not aware of any work that applies this kind of style transfer to videos.\nPainted animations: One common approach to create video sequences with an artistic style is to generate artificial brush strokes to repaint the scene. Different artistic styles are gained by modifying various parameters of these brush strokes, like thickness, or by using different brush placement methods. To achieve temporal consistency Litwinowicz [6] was one of the first who used optical flow. In his approach, brush strokes were generated for the first frame and then moved along the flow field. Later, this approach was refined. Hays et al. [4] proposed new stylistic parameters for the brush strokes to mimic different artistic styles. O’Donovan et al. [8] formulated an energy optimization problem for an optimal placement and shape of the brush strokes and also integrated a temporal constraint into the optimization problem by penalizing changes in shape and width of the brush strokes compared to the previous frame. These approaches are similar in spirit to what we are doing, but they are only capable of applying a restricted class of artistic styles."
        },
        {
            "heading": "3 Style transfer in still images",
            "text": "In this section, we briefly review the style transfer approach introduced by Gatys et al. [3]. The aim is to generate a stylized image x showing the content of an image p in the style of an image a. Gatys et al. formulated an energy minimization problem consisting of a content loss and a style loss. The key idea is that features extracted by a convolutional network carry information about the content of the image, while the correlations of these features encode the style.\nWe denote by Φl(·) the function implemented by the part of the convolutional network from input up to the layer l. The feature maps extracted by the network from the original image p, the style image a and the stylized image x we denote by P l = Φl(p), Sl = Φl(a) and F l = Φl(x) respectively. The dimensionality of these feature maps we denote by Nl ×Ml, where Nl is the number of filters (channels) in the layer, and Ml is the spatial dimensionality of the feature map, that is, the product of its width and height.\nThe content loss, denoted as Lcontent, is simply the mean squared error between P l ∈ RNl×Ml and F l ∈ RNl×Ml . This loss need not be restricted to only one layer. Let Lcontent be the set of layers to be used for content representation, then we have:\nLcontent ( p,x ) = ∑ l∈Lcontent 1 NlMl ∑ i,j ( F lij − P lij )2 . (1)\nThe style loss is also a mean squared error, but between the correlations of the filter responses expressed by their Gram matrices Al ∈ RNl×Nl for the style image a and Gl ∈ RNl×Nl for the stylized image x. These are computed as\nAlij = Ml∑ k=1 SlikS l jk and G l ij = Ml∑ k=1 F likF l jk . As above, let Lstyle be the set of layers we use to represent the style, then the style loss is given by:\nLstyle ( a,x ) = ∑ l∈Lstyle\n1\nN2l M 2 l ∑ i,j ( Glij −Alij )2 (2)\nOverall, the loss function is given by Lsingleimage ( p,a,x ) = αLcontent ( p,x ) + βLstyle ( a,x ) , (3)\nwith weighting factors α and β governing the importance of the two components. The stylized image is computed by minimizing this energy with respect to x using gradient-based optimization. Typically it is initialized with random Gaussian noise. However, the loss function is non-convex, therefore the optimization is prone to falling into local minima. This makes the initialization of the stylized image important, especially when applying the method to frames of a video."
        },
        {
            "heading": "4 Style transfer in videos",
            "text": "We use the following notation: p(i) is the ith frame of the original video, a is the style image and x(i) are the stylized frames to be generated. Furthermore, we denote by x′(i) the initialization of the style optimization algorithm at frame i. By xj we denote the j th component of a vector x."
        },
        {
            "heading": "4.1 Short-term consistency by initialization",
            "text": "When the style transfer for consecutive frames is initialized by independent Gaussian noise, two frames of a video converge to very different local minima, resulting in a strong flickering. The most basic way to yield temporal consistency is to initialize the optimization for the frame i+ 1 with the stylized frame i. Areas that have not changed between the two frames are then initialized with the desired appearance, while the rest of the image has to be rebuilt through the optimization process.\nIf there is motion in the scene, this simple approach does not perform well, since moving objects are initialized incorrectly. Thus, we take the optical flow into account and initialize the optimization for the frame i+1 with the previous stylized frame warped: x′(i+1) = ωi+1i ( x(i) ) . Here ωi+1i denotes the function that warps a given image using the optical flow field that was estimated between image p(i) and p(i+1). Clearly, the first frame of the stylized video still has to be initialized randomly.\nWe experimented with two state-of-the-art optical flow estimation algorithms: DeepFlow [12] and EpicFlow [9]. Both are based on Deep Matching [12]: DeepFlow combines it with a variational approach, while EpicFlow relies on edgepreserving sparse-to-dense interpolation."
        },
        {
            "heading": "4.2 Temporal consistency loss",
            "text": "To enforce stronger consistency between adjacent frames we additionally introduce an explicit consistency penalty to the loss function. This requires detection of disoccluded regions and motion boundaries. To detect disocclusions, we perform a forward-backward consistency check of the optical flow [11]. Let w = (u, v) be the optical flow in forward direction and ŵ = (û, v̂) the flow in backward direction. Denote by w̃ the forward flow warped to the second image:\nw̃(x, y) = w((x, y) + ŵ(x, y)). (4)\nIn areas without disocclusion, this warped flow should be approximately the opposite of the backward flow. Therefore we mark as disocclusions those areas where the following inequality holds:\n|w̃ + ŵ|2 > 0.01(|w̃|2 + |ŵ|2) + 0.5 (5)\nMotion boundaries are detected using the following inequality:\n|∇û|2 + |∇v̂|2 > 0.01|ŵ|2 + 0.002 (6)\nCoefficients in inequalities (5) and (6) are taken from Sundaram et al. [11]. The temporal consistency loss function penalizes deviations from the warped image in regions where the optical flow is consistent and estimated with high confidence:\nLtemporal(x,ω, c) = 1\nD D∑ k=1 ck · (xk − ωk)2 . (7)\nHere c ∈ [0, 1]D is per-pixel weighting of the loss and D = W × H × C is the dimensionality of the image. We define the weights c(i−1,i) between frames i−1 and i as follows: 0 in disoccluded regions (as detected by forward-backward consistency) and at the motion boundaries, and 1 everywhere else. Potentially weights between 0 and 1 could be used to incorporate the certainty of the optical flow prediction. The overall loss takes the form:\nLshortterm ( p(i),a,x(i) ) = αLcontent ( p(i),x(i) ) + βLstyle ( a,x(i) ) + γLtemporal ( x(i), ωii−1(x (i−1)), c(i−1,i) ) . (8)\nWe optimize one frame after another, thus x(i−1) refers to the already stylized frame i−1.\nFurthermore we experimented with the more robust absolute error instead of squared error for the temporal consistency loss; results are shown in section 8."
        },
        {
            "heading": "4.3 Long-term consistency",
            "text": "The short-term model has the following limitation: when some areas are occluded in some frame and disoccluded later, these areas will likely change their\nappearance in the stylized video. This can be counteracted by also making use of long-term motion, i.e. not only penalizing deviations from the previous frame, but also from temporally more distant frames. Let J denote the set of indices each frame should take into account, relative to the frame number. E.g. J = {1, 2, 4} means frame i takes frames i−1, i−2 and i−4 into account. Then, the loss function with long-term consistency is given by:\nLlongterm ( p(i),a,x(i) ) = αLcontent ( p(i),x(i) ) + βLstyle ( a,x(i) ) + γ\n∑ j∈J:i−j≥1 Ltemporal ( x(i), ωii−j(x (i−j)), c (i−j,i) long ) (9)\nIt is essential how the weights c (i−j,i) long are computed. Let c (i−j,i) be the weights for the flow between image i−j and i, as defined for the short-term model. The long-term weights c\n(i−j,i) long are computed as follows:\nc (i−j,i) long = max\n( c(i−j,i) − ∑ k∈J:i−k>i−j c(i−k,i), 0 ) , (10)\nwhere max is taken element-wise. This means, we first apply the usual shortterm constraint. For pixels in disoccluded regions we look into the past until we find a frame in which these have consistent correspondences. An advantage over simply using c(i−j,i) is that each pixel is connected only to the closest possible frame from the past. Since the optical flow computed over more frames is more erroneous than over fewer frames, this results in nicer videos. An empirical comparison of c(i−j,i) and c (i−j,i) long is shown in the supplementary video (see section 8.1)."
        },
        {
            "heading": "4.4 Multi-pass algorithm",
            "text": "We found that the output image tends to have less contrast and is less diverse near image boundaries than in other areas of the image. For mostly static videos this effect is hardly visible. However, in cases of strong camera motion the areas from image boundaries move towards the center of the image, which leads to a lower image quality over time when combined with our temporal constraint. Therefore, we developed a multi-pass algorithm which processes the whole sequence in multiple passes and alternating directions. The basic idea is that we progressively propagate intermediate results in both forward and backward direction, avoiding an one-way information flow from the image boundaries to the center only.\nEvery pass consists of a relatively low number of iterations without full convergence. At the beginning, we process every frame independently based on a random initialization. After that, we blend frames with non-disoccluded parts of previous frames warped according to the optical flow, then run the optimization algorithm for some iterations initialized with this blend. The direction in which\nthe sequence is processed is alternated in every pass. We repeat this blending and optimization to convergence.\nFormally, let x′(i)(j) be the initialization of frame i in pass j and x(i)(j) the corresponding output after some iterations of the optimization algorithm. When processed in forward direction, the initialization of frame i is created as follows:\nx′(i)(j) =\n{ x(i)(j−1) if i = 1,\nδc(i−1,i) ◦ ωii−1 ( x(i−1)(j) ) + (δ1 + δc(i−1,i)) ◦ x(i)(j−1) else.\n(11) Here ◦ denotes element-wise vector multiplication, δ and δ = 1−δ are the blend factors, 1 is a vector of all ones, and c = 1− c.\nAnalogously, the initialization for a backward direction pass is:\nx′(i)(j) =\n{ x(i)(j−1) if i = Nframes\nδc(i+1,i) ◦ ωii+1 ( x(i+1)(j) ) + (δ1 + δc(i+1,i)) ◦ x(i)(j−1) else\n(12)\nThe multi-pass algorithm can be combined with the temporal consistency loss described above. We achieved good results when we disabled the temporal consistency loss in several initial passes and enabled it in later passes only after the images had stabilized."
        },
        {
            "heading": "5 Experiments",
            "text": "In this section, we briefly describe implementation details and present experimental results produced with different versions of our algorithm. While we did our best to make the paper self-contained, it is not possible to demonstrate effects like video flickering in still images. We therefore advise the readers to watch the supplementary video, which is available at https://youtu.be/vQk_Sfl7kSc."
        },
        {
            "heading": "5.1 Implementation details",
            "text": "Our implementation1 is based on the Torch [2] implementation called neuralstyle2. We used the following layers of the VGG-19 network [10] for computing the losses: relu4 2 for the content and relu1 1,relu2 1,relu3 1,relu4 1,relu5 1 for the style. The energy function was minimized using L-BFGS. For precise evaluation we incorporated the following strict stopping criterion: the optimization was considered converged if the loss did not change by more than 0.01% during 50 iterations. This typically resulted in roughly 2000 to 3000 iterations for the first frame and roughly 400 to 800 iterations for subsequent frames when optimizing with our temporal constraint, depending on the amount of motion and the complexity of the style image. Using a convergence threshold of 0.1% cuts the number of iterations and the running time in half, and we found it still produces reasonable results in most cases. However, we used the stronger criterion in our experiments for the sake of accuracy.\nFor videos of resolution 350 × 450 we used weights α = 1 and β = 20 for the content and style losses, respectively (default values from neural-style), and weight γ = 200 for the temporal losses. However, the weights should be adjusted if the video resolution is different. We provide the details in section 7.2.\nFor our multi-pass algorithm, we used 100 iterations per pass and set δ = 0.5, but we needed at least 10 passes for good results, so this algorithm needs more computation time than our previous approaches.\nWe used DeepMatching, DeepFlow and EpicFlow implementations provided by the authors of these methods. We used the ”improved-settings” flag in DeepMatching 1.0.1 and the default settings for DeepFlow 1.0.1 and EpicFlow 1.00.\nRuntime For the relaxed convergence threshold of 0.1% with random initialization the optimization process needed on average roughly eight to ten minutes per frame at a resolution of 1024× 436 on an Nvidia Titan X GPU. When initialized with the warped previous frame and combined with our temporal loss, the optimization converges 2 to 3 times faster, three minutes on average. Optical flow computation runs on a CPU and takes roughly 3 minutes per frame pair (forward and backward flow together), therefore it can be performed in parallel with the style transfer. Hence, our modified algorithm is roughly 3 times faster than naive per-frame processing, while providing temporally consistent output videos. 1 GitHub: https://github.com/manuelruder/artistic-videos 2 GitHub: https://github.com/jcjohnson/neural-style"
        },
        {
            "heading": "5.2 Short-term consistency",
            "text": "We evaluated our short-term temporal loss on 5 diverse scenes from the MPI Sintel Dataset [1], with 20 to 50 frames of resolution 1024 × 436 pixels per scene, and 6 famous paintings (shown in section 7.1) as style images. The Sintel dataset provides ground truth optical flow and ground truth occlusion areas, which allows a quantitative study. We warped each stylized frame i back with the ground truth flow and computed the difference with the stylized frame i− 1 in non-disoccluded regions. We use the mean square of this difference (that is, the mean squared error) as a quantitative performance measure.\nOn this benchmark we compared several approaches: our short-term consistency loss with DeepFlow and EpicFlow, as well as three different initializations without the temporal loss: random noise, the previous stylized frame and the previous stylized frame warped with DeepFlow. We set α = 1, β = 100, γ = 400.\nA qualitative comparison is shown in Fig. 2. Quantitative results are in Table 2. The most straightforward approach, processing every frame independently, performed roughly an order of magnitude worse than our more sophisticated methods. In most cases, the temporal penalty significantly improved the results. The ambush scenes are exceptions, since they contain very large motion and the erroneous optical flow impairs the temporal constraint. Interestingly, on average DeepFlow performed slightly better than EpicFlow in our experiments, even through EpicFlow outperforms DeepFlow on the Sintel optical flow benchmark."
        },
        {
            "heading": "5.3 Long-term consistency and multi-pass algorithm",
            "text": "The short-term consistency benchmark presented above cannot evaluate the long-term consistency of videos (since we do not have long-term ground truth flow available) and their visual quality (this can only be judged by humans). We therefore excluded the long-term penalty and the multi-pass approach from the quantitative comparison and present only qualitative results. Please see the supplementary video for more results.\nFig. 3 shows a scene from Miss Marple where a person walks through the scene. Without our long-term consistency model, the background looks very different after the person passes by. The long-term consistency model keeps the background unchanged. Fig. 4 shows another scene from Miss Marple with fast camera motion. The multi-pass algorithm avoids the artifacts introduced by the basic algorithm."
        },
        {
            "heading": "6 Conclusion",
            "text": "We presented a set of techniques for style transfer in videos: suitable initialization, a loss function that enforces short-term temporal consistency of the stylized video, a loss function for long-term consistency, and a multi-pass approach. As a consequence, we can produce stable and visually appealing stylized videos even in the presence of fast motion and strong occlusion."
        },
        {
            "heading": "7 Additional details of experimental setup",
            "text": ""
        },
        {
            "heading": "7.1 Style images",
            "text": "Style images we used for benchmark experiments on Sintel are shown in Figure 5."
        },
        {
            "heading": "7.2 Weighting of the loss components",
            "text": "As mentioned in the main paper, for best results the weights α, β and γ of different components of the loss function have to be adjusted depending on the resolution of the video. The settings we used for different resolutions are shown in Table 2."
        },
        {
            "heading": "8 Additional experiments",
            "text": ""
        },
        {
            "heading": "8.1 Supplementary video",
            "text": "A supplementary video, available at https://youtu.be/vQk_Sfl7kSc, shows moving sequences corresponding to figures from this paper, plus a number of additional results:\n– Results of the basic algorithm on different sequences from Sintel with different styles – Additional comparison of the basic and the multi-pass algorithm – Additional comparison of the basic and the long-term algorithm – Comparison of ”naive” (c) and ”advanced” (clong) weighting schemes for\nlong-term consistency Another video, showing results of the algorithm on a number of diverse videos with different style images is avalable at https://youtu.be/Khuj4ASldmU."
        },
        {
            "heading": "8.2 Robust loss function for temporal consistency",
            "text": "We tried using the more robust absolute error instead of squared error for the temporal consistency loss. The weight for the temporal consistency was doubled in this case. Results are shown in Figure 6. While in some cases (left example in the figure) absolute error leads to slightly improved results, in other cases (right example in the figure) it causes large fluctuations. We therefore stick with mean squared error in all our experiments."
        },
        {
            "heading": "8.3 Effect of errors in optical flow estimation",
            "text": "The quality of results produced by our algorithm strongly depends on the quality of optical flow estimation. This is illustrated Figure 7. When the optical flow is correct (top right region of the image), the method manages to repair the artifacts introduced by warping in the disoccluded region. However, erroneous optical flow (tip of the sword in the bottom right) leads to degraded performance. Optimization process partially compensates the errors (sword edges get sharp), but cannot fully recover."
        }
    ],
    "title": "Artistic style transfer for videos",
    "year": 2016
}