{
    "abstractText": "Dropout is typically interpreted as bagging a large number of models sharing parameters. We show that using dropout in a network can also be interpreted as a kind of data augmentation in the input space without domain knowledge. We present an approach to projecting the dropout noise within a network back into the input space, thereby generating augmented versions of the training data, and we show that training a deterministic network on the augmented samples yields similar results. Finally, we propose a new dropout noise scheme based on our observations and show that it improves dropout results without adding significant computational cost.",
    "authors": [
        {
            "affiliations": [],
            "name": "Xavier Bouthillier"
        },
        {
            "affiliations": [],
            "name": "Kishore Konda"
        },
        {
            "affiliations": [],
            "name": "Roland Memisevic"
        }
    ],
    "id": "SP:0996aaed0e91099c4431d098a8291ddc1c744525",
    "references": [
        {
            "authors": [
                "Bachman",
                "Phil",
                "Alsharif",
                "Ouais",
                "Precup",
                "Doina"
            ],
            "title": "Learning with pseudo-ensembles",
            "venue": "In Advances in Neural Information Processing Systems,",
            "year": 2014
        },
        {
            "authors": [
                "Baldi",
                "Pierre",
                "Sadowski",
                "Peter J"
            ],
            "title": "Understanding dropout",
            "venue": "In Advances in Neural Information Processing Systems,",
            "year": 2013
        },
        {
            "authors": [
                "Bastien",
                "Frédéric",
                "Lamblin",
                "Pascal",
                "Pascanu",
                "Razvan",
                "Bergstra",
                "James",
                "Goodfellow",
                "Ian",
                "Bergeron",
                "Arnaud",
                "Bouchard",
                "Nicolas",
                "Warde-Farley",
                "David",
                "Bengio",
                "Yoshua"
            ],
            "title": "Theano: new features and speed improvements",
            "venue": "arXiv preprint arXiv:1211.5590,",
            "year": 2012
        },
        {
            "authors": [
                "Bergstra",
                "James",
                "Breuleux",
                "Olivier",
                "Bastien",
                "Frédéric",
                "Lamblin",
                "Pascal",
                "Pascanu",
                "Razvan",
                "Desjardins",
                "Guillaume",
                "Turian",
                "Joseph",
                "Warde-Farley",
                "David",
                "Bengio",
                "Yoshua"
            ],
            "title": "Theano: a cpu and gpu math expression compiler",
            "venue": "In Proceedings of the Python for scientific computing conference (SciPy),",
            "year": 2010
        },
        {
            "authors": [
                "Bishop",
                "Chris M"
            ],
            "title": "Training with noise is equivalent to tikhonov regularization",
            "venue": "Neural computation,",
            "year": 1995
        },
        {
            "authors": [
                "B Chandra",
                "Sharma",
                "Rajesh Kumar"
            ],
            "title": "Adaptive noise schedule for denoising autoencoder",
            "venue": "In Neural Information Processing,",
            "year": 2014
        },
        {
            "authors": [
                "Ciresan",
                "Dan",
                "Meier",
                "Ueli",
                "Schmidhuber",
                "Jürgen"
            ],
            "title": "Multi-column deep neural networks for image classification",
            "venue": "In Computer Vision and Pattern Recognition (CVPR),",
            "year": 2012
        },
        {
            "authors": [
                "Gal",
                "Yarin",
                "Ghahramani",
                "Zoubin"
            ],
            "title": "Dropout as a bayesian approximation: Representing model uncertainty in deep learning",
            "venue": "arXiv preprint arXiv:1506.02142,",
            "year": 2015
        },
        {
            "authors": [
                "Geras",
                "Krzysztof J",
                "Sutton",
                "Charles"
            ],
            "title": "Scheduled denoising autoencoders",
            "venue": "arXiv preprint arXiv:1406.3269,",
            "year": 2014
        },
        {
            "authors": [
                "Goodfellow",
                "Ian",
                "Pouget-Abadie",
                "Jean",
                "Mirza",
                "Mehdi",
                "Xu",
                "Bing",
                "Warde-Farley",
                "David",
                "Ozair",
                "Sherjil",
                "Courville",
                "Aaron",
                "Bengio",
                "Yoshua"
            ],
            "title": "Generative adversarial nets",
            "venue": "In Advances in Neural Information Processing Systems,",
            "year": 2014
        },
        {
            "authors": [
                "Goodfellow",
                "Ian J",
                "Shlens",
                "Jonathon",
                "Szegedy",
                "Christian"
            ],
            "title": "Explaining and harnessing adversarial examples",
            "venue": "arXiv preprint arXiv:1412.6572,",
            "year": 2014
        },
        {
            "authors": [
                "Graham",
                "Ben",
                "Reizenstein",
                "Jeremy",
                "Robinson",
                "Leigh"
            ],
            "title": "Efficient batchwise dropout training using submatrices",
            "venue": "arXiv preprint arXiv:1502.02478,",
            "year": 2015
        },
        {
            "authors": [
                "Hinton",
                "Geoffrey E",
                "Srivastava",
                "Nitish",
                "Krizhevsky",
                "Alex",
                "Sutskever",
                "Ilya",
                "Salakhutdinov",
                "Ruslan"
            ],
            "title": "Improving neural networks by preventing co-adaptation of feature detectors",
            "venue": "CoRR, abs/1207.0580,",
            "year": 2012
        },
        {
            "authors": [
                "Krizhevsky",
                "Alex",
                "Sutskever",
                "Ilya",
                "Hinton",
                "Geoffrey E"
            ],
            "title": "Imagenet classification with deep convolutional neural networks. In Advances in neural information processing",
            "year": 2012
        },
        {
            "authors": [
                "LeCun",
                "Yann",
                "Bottou",
                "Léon",
                "Bengio",
                "Yoshua",
                "Haffner",
                "Patrick"
            ],
            "title": "Gradient-based learning applied to document recognition",
            "venue": "Proceedings of the IEEE,",
            "year": 1998
        },
        {
            "authors": [
                "Poole",
                "Ben",
                "Sohl-Dickstein",
                "Jascha",
                "Ganguli",
                "Surya"
            ],
            "title": "Analyzing noise in autoencoders and deep networks",
            "venue": "arXiv preprint arXiv:1406.1831,",
            "year": 2014
        },
        {
            "authors": [
                "Rennie",
                "Steven",
                "Goel",
                "Vaibhava",
                "Thomas",
                "Samuel"
            ],
            "title": "Annealed dropout training of deep networks",
            "venue": "In Spoken Language Technology (SLT), IEEE Workshop on. IEEE,",
            "year": 2014
        },
        {
            "authors": [
                "Simard",
                "Patrice Y",
                "Steinkraus",
                "Dave",
                "Platt",
                "John C"
            ],
            "title": "Best practices for convolutional neural networks applied to visual document analysis",
            "venue": "In 2013 12th International Conference on Document Analysis and Recognition,",
            "year": 2003
        },
        {
            "authors": [
                "Srivastava",
                "Nitish",
                "Hinton",
                "Geoffrey",
                "Krizhevsky",
                "Alex",
                "Sutskever",
                "Ilya",
                "Salakhutdinov",
                "Ruslan"
            ],
            "title": "Dropout: A simple way to prevent neural networks from overfitting",
            "venue": "The Journal of Machine Learning Research,",
            "year": 1929
        },
        {
            "authors": [
                "van Merriënboer",
                "Bart",
                "Bahdanau",
                "Dzmitry",
                "Dumoulin",
                "Vincent",
                "Serdyuk",
                "Dmitriy",
                "Warde-Farley",
                "David",
                "Chorowski",
                "Jan",
                "Bengio",
                "Yoshua"
            ],
            "title": "Blocks and fuel: Frameworks for deep learning",
            "venue": "arXiv preprint arXiv:1506.00619,",
            "year": 2015
        },
        {
            "authors": [
                "Vincent",
                "Pascal",
                "Larochelle",
                "Hugo",
                "Bengio",
                "Yoshua",
                "Manzagol",
                "Pierre-Antoine"
            ],
            "title": "Extracting and composing robust features with denoising autoencoders",
            "venue": "In Proceedings of the 25th international conference on Machine learning,",
            "year": 2008
        },
        {
            "authors": [
                "Wan",
                "Li",
                "Zeiler",
                "Matthew",
                "Zhang",
                "Sixin",
                "Cun",
                "Yann L",
                "Fergus",
                "Rob"
            ],
            "title": "Regularization of neural networks using dropconnect",
            "venue": "In Proceedings of the 30th International Conference on Machine Learning",
            "year": 2013
        },
        {
            "authors": [
                "Wiesenfeld",
                "Kurt",
                "Moss",
                "Frank"
            ],
            "title": "Stochastic resonance and the benefits of noise: from ice ages to crayfish and squids",
            "year": 1995
        },
        {
            "authors": [
                "Yarom",
                "Yosef",
                "Hounsgaard",
                "Jorn"
            ],
            "title": "Voltage fluctuations in neurons: signal or noise",
            "venue": "Physiological reviews,",
            "year": 2011
        }
    ],
    "sections": [
        {
            "text": "Dropout is typically interpreted as bagging a large number of models sharing parameters. We show that using dropout in a network can also be interpreted as a kind of data augmentation in the input space without domain knowledge. We present an approach to projecting the dropout noise within a network back into the input space, thereby generating augmented versions of the training data, and we show that training a deterministic network on the augmented samples yields similar results. Finally, we propose a new dropout noise scheme based on our observations and show that it improves dropout results without adding significant computational cost."
        },
        {
            "heading": "1 INTRODUCTION",
            "text": "Noise is normally seen as intrinsically undesirable. The word itself bears a very negative connotation. It is not surprising then that many early mathematical models in neuroscience aimed to factor out noise by any means. A few decades ago, the use of stochastic resonance (Wiesenfeld et al., 1995) in neuro-scientific models initiated a new interest in neurosience regarding random fluctuations and the role they play in the brain. Theories about neuronal noise are now flourishing and previous deterministic models are improved by the incorporation of noise (Yarom & Hounsgaard, 2011).\nBiological brains have always been a strong inspiration when it comes to developing learning algorithms. Considering the amount of noise which takes place in the brain during learning, one can wonder if this has any beneficial effect. Many techniques in machine learning have made use of noise to improve performance recently, namely, Denoising Autoencoders (Vincent et al., 2008), dropout (Hinton et al., 2012) and its relative, DropConnect (Wan et al., 2013). Those successful approaches suggest that neuronal noise plays a fundamental role in the process of learning and should be studied more thoroughly.\nUsing dropout can be viewed as training a huge number of neural networks with shared parameters and applying bagging at test time for better generalization (Baldi & Sadowski, 2013). Binary noise can also be viewed as preventing neurons from co-adapting, which improves the generalization of the model even more. In this paper, we propose an alternative view and suggest noise schemes like dropout are implicitly incorporating a form of sophisticated data augmentation. In Section 3, we formulate a method to generate data which replicates dropout noise within a deterministic network, and demonstrate in Section 5 that there is no significant loss of accuracy.\nFinally, capitalizing on the idea of data augmentation, we present in section 4 an extension of dropout which uses random noise levels to improve the variety of samples. This simple extension improves classification performance across different network architectures, yielding competitive results on the MNIST permutation invariant classification task.\n∗Both authors contributed equally\nar X\niv :1\n50 6.\n08 70\n0v 4\n[ st\nat .M\nL ]\n8 J\nan 2\n01 6"
        },
        {
            "heading": "2 DROPOUT",
            "text": "The main goal when using dropout is to regularize the neural network we are training. The technique consists of dropping neurons randomly with some probability p. Those random modifications of the network’s stucture are believed to avoid co-adaptation of neurons by making it impossible for two subsequent neurons to rely solely on each other (Srivastava et al., 2014). The most accepted interpretation of dropout is that is implicitely bagging at test time a large number of neural networks which share parameters.\nAssume h(x) is a linear projection of a di-dimensional input x into a dh-dimensional space:\nh(x) = xW + b (1)\nGiven a(h) and ã(h), an activation function and its noisy version where M ∼ B(ph) and rect(h) is a rectifier\na(h) = rect(h) (2) ã(h) =M rect (h) (3)\nEq. 3 denotes the activation with dropout during training and eq. 2 the equation of the activation at test time. Srivastava et al. (2014) suggest to scale the activations a(h) with p at test time to get an approximate average of the unit activation."
        },
        {
            "heading": "3 FROM A DATA AUGMENTATION PERSPECTIVE",
            "text": "In many previous works it has been shown that augmenting data by using domain specific transformations helps in learning better models (LeCun et al., 1998; Simard et al., 2003; Krizhevsky et al., 2012; Ciresan et al., 2012). In this work, we analyze dropout in the context of data augmentation. Considering the task of classification, given a set of training samples, the objective would be to learn a mapping function which maps every input to its corresponding output label. To generalize, the mapping function needs to be able to correctly map not just the training samples but also any other samples drawn from the data distribution. This means that it must not only map input space sub-regions represented by training samples, but all high-probability sub-regions of the natural distribution.\nOne way to learn such a mapping function is by augmenting the training data such that it covers a larger portion of the natural distribution. Domain-based data augmentation helps to artificially boost training data coverage which makes it possible to train a better mapping function. We hypothesize that noise based regularization techniques result in a similar effect of increasing training data coverage at every hidden layer and this work presents multiple experimental observations to support our hypothesis."
        },
        {
            "heading": "3.1 PROJECTING NOISE BACK INTO THE INPUT SPACE",
            "text": "We assume that for a given ã(h), there exist an x∗, such that\n(a ◦ h)(x∗) = rect(h(x∗)) ≈ ~m rect (h(x)) = (ã ◦ h)(x) (4)\nSimilarly to adversarial examples from Goodfellow et al. (2014b), an x∗ can be found by minimizing the squared error L using stochastic gradient descent\nL (x, x∗)) = |(a ◦ h)(x∗)− (ã ◦ h)(x)|2 (5)\nEquation 5 can be generalized to a network with n hidden layers. To lighten notation we first define\nf̃ (i)(x) = ( ã(i) ◦ h(i) ◦ · · · ◦ ã(1) ◦ h(1) ) (x) (6)\nf (i)(x∗) = ( a(i) ◦ h(i) ◦ · · · ◦ a(1) ◦ h(1) ) (x∗) (7)\nWe can now compute the back projection corresponding to all hidden layer activations at once, which results in minizing the loss L\nL ( x, x(1) ∗ , . . . , x(n) ∗ ) = n∑ i=1 λi ∣∣∣f (i) (x(i)∗)− f̃ (i)(x)∣∣∣2 (8) We can show by contradiction that one is unlikely to find a single x∗ = x(1) ∗ = x(2) ∗ = · · · = x(n)∗ that significantly reduces L. The proof is detailed in appendix subsection 8.1. Fortunately, it is easy to find a different x∗ for each hidden layer, by providing multiple inputs (x, x(1) ∗ , x(2) ∗ , . . . , x(n) ∗ ), where n is the number of hidden layers. As each x(i) ∗\nis the back projection of a transformation in the representation space defined by the i-th hidden layer, it suggests viewing dropout as a sophisticated data augmentation procedure that samples data around training examples with respect to different level of representations. This raises the question whether we can train the network deterministically on the x(i) ∗ rather than using dropout. The answer is not trivial, because\n1. When using (x, x(1) ∗ , x(2) ∗ , . . . , x(n) ∗ ) as inputs, dropout is not effectively applied to every\nlayer at the same time. The local stochasticity preventing co-adaptation is then present at a specific layer only once for every x(i) ∗ . This could be not aggressive enough to avoid co-adaptation.\n2. The gradients of the linear projections will differ greatly. In the case of dropout, ∂h ∂W (i) is always equal to its input transformation, i.e. f̃ (i−1)(x), whereas the deterministic version of the training will update W (i) according to ( f (i−1)(x(1) ∗ ), . . . , f (i−1)(x(n) ∗ ) ) 1.\nAlthough we proved a single x∗ minimising 8 is difficult to find for a large network, we show experimentally in section 5 that it is possible to do so within reasonable approximation for a relatively small two hidden layer network. We further show that dropout can be replicated by projecting the noise back on the input space without a significant loss of accuracy."
        },
        {
            "heading": "4 IMPROVING THE SET OF AUGMENTATIONS",
            "text": "When dealing with domain-based transformations, we intuitively look for the richest set of transformations. In computer vision for instance, translations, rotations, scalings, shearings and elastic transformations are often combined. Looking at dropout from a data augmentation perspective, this intuition raises the following question: given that noise scheme used is implicitely applying some transformations in the input space, which one would produce the richest set of transformations?\nWith noise schemes like dropout, there are two important components which influence the transformations; The probability distribution of ~m and the features of the neural network used to encode h(x). Modifying the probability distribution is the most straighforward way to improve the set of transformations and will be the main focus of this paper. However, features of the neural network play a key role in the transformations and we will outline some possible avenues in the conclusion section."
        },
        {
            "heading": "4.1 RANDOM NOISE LEVELS",
            "text": "While using dropout, the proportion of neurons dropped is very close to probability p. It follows naturally from Binomial distribution’s expectation. The transformations induced are as different as the values M can take. Despite this, their magnitude is as constant as the proportion of neurons\n1Because we train on n samples from x, one for each hidden layer\nProbability density function on proportion of neurons dropped\ndropped. That means, every transformations displaces the sample to a relatively constant distance but in random directions in a high dimensional space.\nA simple way to vary the transformation magnitude randomly is to replace p by a random variable. Let ρh ∼ U(0, ph) and Mhij ∼ B(ρh) where h defines the layer, i the sample, and j the layer’s neuron. It is important to use the same ρ for all neurons of a layer, otherwise we would have Mhij ∼ B(ph2 ). To compensate for the change of level of activations during test, a scaling is normally applied. One could also simply apply the inverse scaling during training, turning equation 3 into\nã(h) = 1\n1− p M rect (h) (9)\nTo adapt the equation to random dropout level, we simply need to replace p with ρ\nã(h) = 1\n1− ρ M rect (h) (10)\nNo scaling needs to be done during test anymore.\nFigure 1 shows the differences between density function on proportion of neurons dropped for dropout and random dropout. Transformations induced by random dropout are clearly more diverse than those induced by dropout."
        },
        {
            "heading": "5 EXPERIMENTS",
            "text": ""
        },
        {
            "heading": "5.1 VISUALIZATIONS OF NOISE PROJECTED BACK INTO THE INPUT SPACE",
            "text": "Visualizing the noise projected back into the input space helps to understand what kind of transformations are induced by dropout. Unsupervised models learn more general features than supervised fully connected neural networks and produce thus more visually appealing transformations. For this reason, we trained autoencoders with dropout on the hidden layer to generate samples of transformations.\nThe autoencoder is very similar to denoising autoencoders, the only difference is that a Bernoulli mask is applied to the hidden activations rather than to the input. There is thus no noise applied to the input explicitly. Models are trained for 300 epochs, with mini-batch size of 100, p = 0.4, a learning rate of 0.001 on MNIST, 0.0001 on CIFAR-10 and a momentum of 0.7 on MNIST, 0.5 on\nCIFAR-10. For CIFAR-10, we do preprocessing with PCA dimensionality reduction and retain 781 features.\nOnce the model is trained, we use gradient descent to compute x∗ as described in 3.1. We iterate for 10 epochs with a learning rate of 100 for both MNIST and CIFAR-10. Figure 5 shows well how close x∗ are from the natural input space and we clearly see that the classes are still distinguishable.\nTo help understand how each feature influences the transformation, we isolate five most active features for a given input and shut them off, each separately. For each feature shut off, we compute x∗ using gradient descent. Figure 3 shows the results found for MNIST. One could think the features dropped by the noise are simply removed from the input. It turns out removing the feature would affect the activation of other neurons. Because of this, features are rather destroyed in the input in such a way that other features highly dependant on the same subregion still have the same activation level."
        },
        {
            "heading": "5.2 EQUIVALENCE OF DROPOUT AND NOISY SAMPLES",
            "text": "We ran a series of experiments with fully connected feed forward neural networks on the MNIST and CIFAR-10 datasets to study the effect of replacing dropout by corresponding noisy inputs. Each network consists of two hidden layers with rectified linear units followed by a softmax layer. We experimented with four different architectures each one with a different number of units in the hidden layers: 2500-2500, 2500-1250, 1500-1500 and 1500-750.\nThe MNIST dataset consists of 60000 training samples and 10000 test samples. We split the training set into a set of 50000 samples for training and 10000 for validation. Each network is trained for 501 epochs and the best model based on validation error is selected. Later the best model is further trained on the complete training set of 60000 samples (training + validation split) for another 150 epochs. The mean error percentage for the last 75 epochs is used for comparison.\nWe also ran experiments on the CIFAR-10 permutation invariant task using the same network architectures described above. The dataset consists of 50000 training samples and 10000 test samples. We use PCA based dimensionality reduction without whitening as preprocessing scheme, retaining 781 features. We used the same approach as in the MNIST experiments to train the networks and for reporting the performances.\nAt each epoch, an x∗ is generated for each training sample. It proved to be possible to find good x∗ approximations for the entire network at once for a 2-hidden layer network. Thus, we trained on x and x∗ solely rather than x, x(1) ∗ and x(2) ∗ as it gave a significant speed up. For simplicity, the network is trained on x for an epoch than on x∗ for an epoch. All x∗ are generated with parameter values of the model at the beginning of the epoch.\nNoisy inputs x∗ are found using stochastic gradient descent. 20 learning steps are done with a learning rate of 300.0 for first hidden layer and 30 for second hidden layer. The results for these experiments are shown in figure 4.\nResults suggest that Dropout can be replicated by projecting the noise back into the input and training a neural network deterministically on this generated data. There is not significant drop in ac-\ncuracy, it is even slightly better than Dropout in the case of CIFAR-10. This supports the idea that dropout can be seen as data augmentation."
        },
        {
            "heading": "5.3 RICHER NOISE SCHEMES",
            "text": "We ran a series of experiments with fully connected feed forward neural networks on the MNIST and CIFAR-10 datasets to compare dropout. Each networks consist of two hidden layers with rectified linear units followed by a softmax layer. We experimented with three different network architectures each one with a different number of units in the hidden layers: 2500-625, 2500-1250 and 2500-2500. Each network is trained and validated the same way as mentioned in previous section.\nFirst, we evaluated the dropout noise scheme by training the networks with a fixed hidden noise level of 0.5 and the input noise level varying from 0.0 to 0.7 with increments of 0.1 for each experiment. In the second experiment, we fixed the input noise level at 0.2 and the hidden noise level is varied from 0.0 to 0.7, again with an increment of 0.1. In the final set of experiments we use the random dropout noise scheme using the same noise level at input and hidden layers. The noise level in this case is a range [0, x] where x is varied from 0.0 to 0.8 with increment 0.1. The classification performances corresponding to the all the experiments on both the datasets are reported in Figure 6.\nRandom dropout improves the performance of the models over dropout with no additional computational cost."
        },
        {
            "heading": "6 RELATED WORK",
            "text": "To the best of our knowledge there is no work analyzing dropout from a data augmentation perspective. Nonetheless, there is a plethora of excellent works about dropout, some describing his regularisation properties and others developing new kind of noise schemes based on different intuitions.\nRegularization properties of noise have been known for more than a decade, Bishop (1995) showed for instance that the regularization term induced by noise belongs to the class of generalized Tikhonov regularizers for sum-of-squares error functions. More recently, Baldi & Sadowski (2013) proved that dropout noise scheme specifically applies a regularisation term very similar to usual weight decay.\nNot exactly about regularization, but uncertainty, Gal & Ghahramani (2015) gave a very inspiring interpretation of dropout as a Bayesian approximation.\nDifferent noise schemes are used by Poole et al. (2014) and applied at different positions in autoencoders; input, pre-activation and post-activations. They report better results than denoising autoencoders and also support that Gaussian noise yields better results than dropout on MNIST classification task.\nBachman et al. (2014) emphasise bagging interpretation of dropout and propose a generalization called pseudo-ensembles and a related regularizer which makes it possible to train semi-supervised networks.\nSome recent work reports that noise level schedules, inspired by simulated annealing, help in supervised and unsupervised tasks (Geras & Sutton, 2014; Chandra & Sharma, 2014; Rennie et al., 2014). We propose an alternative that avoids a schedule and rather uses random noise levels such that the model cannot adapt to slowly changing noise distribution.\nA similar approach of sampling the noise level was used in Geras & Sutton (2014) in the context of unsupervised learning using an autoencoder (on input not features). However, they show that the approach is not very useful in their case.\nFinally, work by Graham et al. (2015) is related to random noise as both their submatrix multiplications and random noise level ρ are inducing an independence between neurons of a single layer. They found that the independence is not to damageable if they use enough different submatrix patterns."
        },
        {
            "heading": "7 CONCLUSION",
            "text": "We have presented and justified a novel interpretation of dropout as prior-knowledge free data augmentation. We described a new procedure to generate samples by back projecting the dropout noise into the input space. Our results suggest neural networks can be trained without dropout on such noisy samples and still yield good results. Nonetheless, experiments should be performed on larger\nnetworks in order to determine whether this observation is just a particular property of relatively small networks. Furthermore, trained networks should be analyzed to determine if co-adaptation is still avoided when using per-layer noise back-projection on deep neural networks.\nPresenting only random dropout, the list of possible substitute to dropout in this work is far from exhaustive. As described in section 4, important knobs to modify induced data augmentation by noise are model’s features and the noise scheme applied on them. Using semi-supervised cost can influence the implicit transformations by forcing the network to learn more general features. A network could also be trained on x∗ samples generated from another network, similarly to generative adverserial networks (Goodfellow et al., 2014a)."
        },
        {
            "heading": "ACKNOWLEDGEMENTS",
            "text": "This work was supported by the German Federal Ministry of Education and Research (BMBF) in the project 01GQ0841 (BFNT Frankfurt), an NSERC Discovery grant, a Google faculty research award and Ubisoft. We are grateful towards the developers of Theano (Bergstra et al., 2010; Bastien et al., 2012), Fuel and Blocks (van Merriënboer et al., 2015)."
        },
        {
            "heading": "8 APPENDIX",
            "text": "8.1 PROOF OF x∗ UNLIKELINESS\nWe can show, with a proof by contradiction, that it’s unlikely to find a single x∗ = x(1) ∗ = x(2) ∗ = · · · = x(n)∗ that minimizes well L. By the associative property of function composition, we can rewrite equation 7\nf (i)(x∗) = ( a(i) ◦ h(i) )( f (i−1) (x∗) ) (11)\nSuppose there exist an x∗ such that\n( a(i) ◦ h(i) )( f (i−1) (x∗) ) = ( ã(i) ◦ h(i) )( f̃ (i−1)(x) ) (12)(\na(i−1) ◦ h(i−1) )( f (i−2) (x∗) ) = ( ã(i−1) ◦ h(i−1) )( f̃ (i−2)(x) ) (13)\nBased on 11 and 13, we have that f (i−1)(x∗) = f̃ (i−1)(x). The proof is concluded by replacing the latter in 12 and then expanding the composed functions.\n( a(i) ◦ h(i) )( f (i−1) (x∗) ) = ( ã(i) ◦ h(i) )( f (i−1)(x∗) ) rect ( h(i) ( f (i−1) (x∗) )) = ~m(i) rect ( h(i) ( f (i−1) (x∗) )) (14)\nEquation 14 can only be true if ~m(i) does not apply any modification to rect ( h(i) ( f (i−1) (x∗) )) , that\nmeans ~m(i)j = 1 when rectj ( h(i) ( f (i−1) (x∗) )) > 0. It happens with a probability p d(i)s(i) (i) where p(i) is the Bernoulli success probability, d(i) is the number of hidden units and s(i) is the mean sparsity level, i.e. mean percentage of active hidden units, of the i-th hidden layer. This probability is very low for standard hyper-parameters values. For instance, with p(i) = 0.5, d(i) = 1000 and s(i) = 0.15, the probability is as low as 10−47."
        }
    ],
    "year": 2016
}