{
    "abstractText": "Generative Adversarial Nets [8] were recently introduced as a novel way to train generative models. In this work we introduce the conditional version of generative adversarial nets, which can be constructed by simply feeding the data, y, we wish to condition on to both the generator and discriminator. We show that this model can generate MNIST digits conditioned on class labels. We also illustrate how this model could be used to learn a multi-modal model, and provide preliminary examples of an application to image tagging in which we demonstrate how this approach can generate descriptive tags which are not part of training labels.",
    "authors": [
        {
            "affiliations": [],
            "name": "Mehdi Mirza"
        }
    ],
    "id": "SP:33b54b25366cf2ec4be24c15cab377028c600d94",
    "references": [
        {
            "authors": [
                "Y. Bengio",
                "G. Mesnil",
                "Y. Dauphin",
                "S. Rifai"
            ],
            "title": "Better mixing via deep representations",
            "year": 2013
        },
        {
            "authors": [
                "Y. Bengio",
                "E. Thibodeau-Laufer",
                "G. Alain",
                "J. Yosinski"
            ],
            "title": "Deep generative stochastic networks trainable by backprop",
            "venue": "In Proceedings of the 30th International Conference on Machine Learning (ICML’14)",
            "year": 2014
        },
        {
            "authors": [
                "A. Frome",
                "G.S. Corrado",
                "J. Shlens",
                "S. Bengio",
                "J. Dean",
                "T Mikolov"
            ],
            "title": "Devise: A deep visual-semantic embedding model",
            "venue": "In Advances in Neural Information Processing Systems,",
            "year": 2013
        },
        {
            "authors": [
                "X. Glorot",
                "A. Bordes",
                "Y. Bengio"
            ],
            "title": "Deep sparse rectifier neural networks",
            "venue": "In International Conference on Artificial Intelligence and Statistics,",
            "year": 2011
        },
        {
            "authors": [
                "I. Goodfellow",
                "M. Mirza",
                "A. Courville",
                "Y. Bengio"
            ],
            "title": "Multi-prediction deep boltzmann machines",
            "venue": "In Advances in Neural Information Processing Systems,",
            "year": 2013
        },
        {
            "authors": [
                "I.J. Goodfellow",
                "D. Warde-Farley",
                "P. Lamblin",
                "V. Dumoulin",
                "M. Mirza",
                "R. Pascanu",
                "J. Bergstra",
                "F. Bastien",
                "Y. Bengio"
            ],
            "title": "Pylearn2: a machine learning research",
            "year": 2013
        },
        {
            "authors": [
                "I.J. Goodfellow",
                "J. Pouget-Abadie",
                "M. Mirza",
                "B. Xu",
                "D. Warde-Farley",
                "S. Ozair",
                "A. Courville",
                "Y. Bengio"
            ],
            "title": "Generative adversarial nets. In NIPS’2014",
            "year": 2014
        },
        {
            "authors": [
                "G.E. Hinton",
                "N. Srivastava",
                "A. Krizhevsky",
                "I. Sutskever",
                "R. Salakhutdinov"
            ],
            "title": "Improving neural networks by preventing co-adaptation of feature detectors",
            "venue": "Technical report,",
            "year": 2012
        },
        {
            "authors": [
                "M.J. Huiskes",
                "M.S. Lew"
            ],
            "title": "The mir flickr retrieval evaluation",
            "venue": "In MIR ’08: Proceedings of the 2008 ACM International Conference on Multimedia Information Retrieval,",
            "year": 2008
        },
        {
            "authors": [
                "K. Jarrett",
                "K. Kavukcuoglu",
                "M. Ranzato",
                "Y. LeCun"
            ],
            "title": "What is the best multi-stage architecture for object recognition? In ICCV’09",
            "year": 2009
        },
        {
            "authors": [
                "R. Kiros",
                "R. Zemel",
                "R. Salakhutdinov"
            ],
            "title": "Multimodal neural language models",
            "venue": "In Proc. NIPS Deep Learning Workshop",
            "year": 2013
        },
        {
            "authors": [
                "A. Krizhevsky",
                "I. Sutskever",
                "G. Hinton"
            ],
            "title": "ImageNet classification with deep convolutional neural networks",
            "venue": "In Advances in Neural Information Processing Systems",
            "year": 2012
        },
        {
            "authors": [
                "T. Mikolov",
                "K. Chen",
                "G. Corrado",
                "J. Dean"
            ],
            "title": "Efficient estimation of word representations in vector space",
            "venue": "In International Conference on Learning Representations: Workshops Track",
            "year": 2013
        },
        {
            "authors": [
                "O. Russakovsky",
                "L. Fei-Fei"
            ],
            "title": "Attribute learning in large-scale datasets",
            "venue": "In European Conference of Computer Vision (ECCV), International Workshop on Parts and Attributes,",
            "year": 2010
        },
        {
            "authors": [
                "N. Srivastava",
                "R. Salakhutdinov"
            ],
            "title": "Multimodal learning with deep boltzmann machines",
            "venue": "In NIPS’2012",
            "year": 2012
        }
    ],
    "sections": [
        {
            "text": "Generative Adversarial Nets [8] were recently introduced as a novel way to train generative models. In this work we introduce the conditional version of generative adversarial nets, which can be constructed by simply feeding the data, y, we wish to condition on to both the generator and discriminator. We show that this model can generate MNIST digits conditioned on class labels. We also illustrate how this model could be used to learn a multi-modal model, and provide preliminary examples of an application to image tagging in which we demonstrate how this approach can generate descriptive tags which are not part of training labels."
        },
        {
            "heading": "1 Introduction",
            "text": "Generative adversarial nets were recently introduced as an alternative framework for training generative models in order to sidestep the difficulty of approximating many intractable probabilistic computations.\nAdversarial nets have the advantages that Markov chains are never needed, only backpropagation is used to obtain gradients, no inference is required during learning, and a wide variety of factors and interactions can easily be incorporated into the model.\nFurthermore, as demonstrated in [8], it can produce state of the art log-likelihood estimates and realistic samples.\nIn an unconditioned generative model, there is no control on modes of the data being generated. However, by conditioning the model on additional information it is possible to direct the data generation process. Such conditioning could be based on class labels, on some part of data for inpainting like [5], or even on data from different modality.\nIn this work we show how can we construct the conditional adversarial net. And for empirical results we demonstrate two set of experiment. One on MNIST digit data set conditioned on class labels and one on MIR Flickr 25,000 dataset [10] for multi-modal learning.\nar X\niv :1\n41 1.\n17 84\nv1 [\ncs .L\nG ]"
        },
        {
            "heading": "2 Related Work",
            "text": ""
        },
        {
            "heading": "2.1 Multi-modal Learning For Image Labelling",
            "text": "Despite the many recent successes of supervised neural networks (and convolutional networks in particular) [13, 17], it remains challenging to scale such models to accommodate an extremely large number of predicted output categories. A second issue is that much of the work to date has focused on learning one-to-one mappings from input to output. However, many interesting problems are more naturally thought of as a probabilistic one-to-many mapping. For instance in the case of image labeling there may be many different tags that could appropriately applied to a given image, and different (human) annotators may use different (but typically synonymous or related) terms to describe the same image.\nOne way to help address the first issue is to leverage additional information from other modalities: for instance, by using natural language corpora to learn a vector representation for labels in which geometric relations are semantically meaningful. When making predictions in such spaces, we benefit from the fact that when prediction errors we are still often ‘close’ to the truth (e.g. predicting ’table’ instead of ’chair’), and also from the fact that we can naturally make predictive generalizations to labels that were not seen during training time. Works such as [3] have shown that even a simple linear mapping from image feature-space to word-representation-space can yield improved classification performance.\nOne way to address the second problem is to use a conditional probabilistic generative model, the input is taken to be the conditioning variable and the one-to-many mapping is instantiated as a conditional predictive distribution.\n[16] take a similar approach to this problem, and train a multi-modal Deep Boltzmann Machine on the MIR Flickr 25,000 dataset as we do in this work.\nAdditionally, in [12] the authors show how to train a supervised multi-modal neural language model, and they are able to generate descriptive sentence for images."
        },
        {
            "heading": "3 Conditional Adversarial Nets",
            "text": ""
        },
        {
            "heading": "3.1 Generative Adversarial Nets",
            "text": "Generative adversarial nets were recently introduced as a novel way to train a generative model. They consists of two ‘adversarial’ models: a generative model G that captures the data distribution, and a discriminative model D that estimates the probability that a sample came from the training data rather than G. Both G and D could be a non-linear mapping function, such as a multi-layer perceptron.\nTo learn a generator distribution pg over data data x, the generator builds a mapping function from a prior noise distribution pz(z) to data space as G(z; θg). And the discriminator, D(x; θd), outputs a single scalar representing the probability that x came form training data rather than pg .\nG andD are both trained simultaneously: we adjust parameters forG to minimize log(1−D(G(z)) and adjust parameters for D to minimize logD(X), as if they are following the two-player min-max game with value function V (G,D):\nmin G max D V (D,G) = Ex∼pdata(x)[logD(x)] + Ez∼pz(z)[log(1−D(G(z)))]. (1)"
        },
        {
            "heading": "3.2 Conditional Adversarial Nets",
            "text": "Generative adversarial nets can be extended to a conditional model if both the generator and discriminator are conditioned on some extra information y. y could be any kind of auxiliary information, such as class labels or data from other modalities. We can perform the conditioning by feeding y into the both the discriminator and generator as additional input layer.\nIn the generator the prior input noise pz(z), and y are combined in joint hidden representation, and the adversarial training framework allows for considerable flexibility in how this hidden representation is composed. 1\nIn the discriminator x and y are presented as inputs and to a discriminative function (embodied again by a MLP in this case).\nThe objective function of a two-player minimax game would be as Eq 2\nmin G max D V (D,G) = Ex∼pdata(x)[logD(x|y)] + Ez∼pz(z)[log(1−D(G(z|y)))]. (2)\nFig 1 illustrates the structure of a simple conditional adversarial net."
        },
        {
            "heading": "4 Experimental Results",
            "text": ""
        },
        {
            "heading": "4.1 Unimodal",
            "text": "We trained a conditional adversarial net on MNIST images conditioned on their class labels, encoded as one-hot vectors.\nIn the generator net, a noise prior z with dimensionality 100 was drawn from a uniform distribution within the unit hypercube. Both z and y are mapped to hidden layers with Rectified Linear Unit (ReLu) activation [4, 11], with layer sizes 200 and 1000 respectively, before both being mapped to second, combined hidden ReLu layer of dimensionality 1200. We then have a final sigmoid unit layer as our output for generating the 784-dimensional MNIST samples.\n1For now we simply have the conditioning input and prior noise as inputs to a single hidden layer of a MLP, but one could imagine using higher order interactions allowing for complex generation mechanisms that would be extremely difficult to work with in a traditional generative framework.\nThe discriminator maps x to a maxout [6] layer with 240 units and 5 pieces, and y to a maxout layer with 50 units and 5 pieces. Both of the hidden layers mapped to a joint maxout layer with 240 units and 4 pieces before being fed to the sigmoid layer. (The precise architecture of the discriminator is not critical as long as it has sufficient power; we have found that maxout units are typically well suited to the task.)\nThe model was trained using stochastic gradient decent with mini-batches of size 100 and initial learning rate of 0.1 which was exponentially decreased down to .000001 with decay factor of 1.00004. Also momentum was used with initial value of .5 which was increased up to 0.7. Dropout [9] with probability of 0.5 was applied to both the generator and discriminator. And best estimate of log-likelihood on the validation set was used as stopping point.\nTable 1 shows Gaussian Parzen window log-likelihood estimate for the MNIST dataset test data. 1000 samples were drawn from each 10 class and a Gaussian Parzen window was fitted to these samples. We then estimate the log-likelihood of the test set using the Parzen window distribution. (See [8] for more details of how this estimate is constructed.)\nThe conditional adversarial net results that we present are comparable with some other network based, but are outperformed by several other approaches – including non-conditional adversarial nets. We present these results more as a proof-of-concept than as demonstration of efficacy, and believe that with further exploration of hyper-parameter space and architecture that the conditional model should match or exceed the non-conditional results.\nFig 2 shows some of the generated samples. Each row is conditioned on one label and each column is a different generated sample."
        },
        {
            "heading": "4.2 Multimodal",
            "text": "Photo sites such as Flickr are a rich source of labeled data in the form of images and their associated user-generated metadata (UGM) — in particular user-tags.\nUser-generated metadata differ from more ‘canonical’ image labelling schems in that they are typically more descriptive, and are semantically much closer to how humans describe images with natural language rather than just identifying the objects present in an image. Another aspect of UGM is that synoymy is prevalent and different users may use different vocabulary to describe the same concepts — consequently, having an efficient way to normalize these labels becomes important. Conceptual word embeddings [14] can be very useful here since related concepts end up being represented by similar vectors.\nIn this section we demonstrate automated tagging of images, with multi-label predictions, using conditional adversarial nets to generate a (possibly multi-modal) distribution of tag-vectors conditional on image features.\nFor image features we pre-train a convolutional model similar to the one from [13] on the full ImageNet dataset with 21,000 labels [15]. We use the output of the last fully connected layer with 4096 units as image representations.\nFor the world representation we first gather a corpus of text from concatenation of user-tags, titles and descriptions from YFCC100M 2 dataset metadata. After pre-processing and cleaning of the text we trained a skip-gram model [14] with word vector size of 200. And we omitted any word appearing less than 200 times from the vocabulary, thereby ending up with a dictionary of size 247465.\nWe keep the convolutional model and the language model fixed during training of the adversarial net. And leave the experiments when we even backpropagate through these models as future work.\nFor our experiments we use MIR Flickr 25,000 dataset [10], and extract the image and tags features using the convolutional model and language model we described above. Images without any tag were omitted from our experiments and annotations were treated as extra tags. The first 150,000 examples were used as training set. Images with multiple tags were repeated inside the training set once for each associated tag.\nFor evaluation, we generate 100 samples for each image and find top 20 closest words using cosine similarity of vector representation of the words in the vocabulary to each sample. Then we select the top 10 most common words among all 100 samples. Table 4.2 shows some samples of the user assigned tags and annotations along with the generated tags.\nThe best working model’s generator receives Gaussian noise of size 100 as noise prior and maps it to 500 dimension ReLu layer. And maps 4096 dimension image feature vector to 2000 dimension ReLu hidden layer. Both of these layers are mapped to a joint representation of 200 dimension linear layer which would output the generated word vectors.\nThe discriminator is consisted of 500 and 1200 dimension ReLu hidden layers for word vectors and image features respectively and maxout layer with 1000 units and 3 pieces as the join layer which is finally fed to the one single sigmoid unit.\nThe model was trained using stochastic gradient decent with mini-batches of size 100 and initial learning rate of 0.1 which was exponentially decreased down to .000001 with decay factor of 1.00004. Also momentum was used with initial value of .5 which was increased up to 0.7. Dropout with probability of 0.5 was applied to both the generator and discriminator.\nThe hyper-parameters and architectural choices were obtained by cross-validation and a mix of random grid search and manual selection (albeit over a somewhat limited search space.)"
        },
        {
            "heading": "5 Future Work",
            "text": "The results shown in this paper are extremely preliminary, but they demonstrate the potential of conditional adversarial nets and show promise for interesting and useful applications.\nIn future explorations between now and the workshop we expect to present more sophisticated models, as well as a more detailed and thorough analysis of their performance and characteristics.\n2Yahoo Flickr Creative Common 100M http://webscope.sandbox.yahoo.com/catalog. php?datatype=i&did=67.\nAlso, in the current experiments we only use each tag individually. But by using multiple tags at the same time (effectively posing generative problem as one of ‘set generation’) we hope to achieve better results.\nAnother obvious direction left for future work is to construct a joint training scheme to learn the language model. Works such as [12] has shown that we can learn a language model for suited for the specific task."
        },
        {
            "heading": "Acknowledgments",
            "text": "This project was developed in Pylearn2 [7] framework, and we would like to thank Pylearn2 developers. We also like to thank Ian Goodfellow for helpful discussion during his affiliation at University of Montreal. The authors gratefully acknowledge the support from the Vision & Machine Learning, and Production Engineering teams at Flickr (in alphabetical order: Andrew Stadlen, Arel Cordero, Clayton Mellina, Cyprien Noel, Frank Liu, Gerry Pesavento, Huy Nguyen, Jack Culpepper, John Ko, Pierre Garrigues, Rob Hess, Stacey Svetlichnaya, Tobi Baumgartner, and Ye Lu)."
        }
    ],
    "title": "Conditional Generative Adversarial Nets",
    "year": 2014
}