{
    "abstractText": "Batch Normalization is quite effective at accelerating and improving the training of deep models. However, its effectiveness diminishes when the training minibatches are small, or do not consist of independent samples. We hypothesize that this is due to the dependence of model layer inputs on all the examples in the minibatch, and different activations being produced between training and inference. We propose Batch Renormalization, a simple and effective extension to ensure that the training and inference models generate the same outputs that depend on individual examples rather than the entire minibatch. Models trained with Batch Renormalization perform substantially better than batchnorm when training with small or non-i.i.d. minibatches. At the same time, Batch Renormalization retains the benefits of batchnorm such as insensitivity to initialization and training efficiency.",
    "authors": [
        {
            "affiliations": [],
            "name": "Sergey Ioffe"
        }
    ],
    "id": "SP:1be81623e9cd9434a7bc088fdaa9d858fcfb3da5",
    "references": [
        {
            "authors": [
                "D. Arpit",
                "Y. Zhou",
                "B.U. Kota",
                "V. Govindaraju"
            ],
            "title": "Normalization propagation: A parametric technique for removing internal covariate shift in deep networks",
            "venue": "arXiv preprint arXiv:1603.01431",
            "year": 2016
        },
        {
            "authors": [
                "J.L. Ba",
                "J.R. Kiros",
                "G.E. Hinton"
            ],
            "title": "Layer normalization",
            "venue": "arXiv preprint arXiv:1607.06450",
            "year": 2016
        },
        {
            "authors": [
                "J. Chen",
                "R. Monga",
                "S. Bengio",
                "R. Jozefowicz"
            ],
            "title": "Revisiting distributed synchronous sgd",
            "venue": "arXiv preprint arXiv:1604.00981",
            "year": 2016
        },
        {
            "authors": [
                "J. Goldberger",
                "S. Roweis",
                "G. Hinton",
                "R. Salakhutdinov"
            ],
            "title": "Neighbourhood components analysis",
            "venue": "Advances in Neural Information Processing Systems 17",
            "year": 2004
        },
        {
            "authors": [
                "K. He",
                "X. Zhang",
                "S. Ren",
                "J. Sun"
            ],
            "title": "Deep residual learning for image recognition",
            "venue": "Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition, pages 770–778",
            "year": 2016
        },
        {
            "authors": [
                "S. Ioffe",
                "C. Szegedy"
            ],
            "title": "Batch normalization: Accelerating deep network training by reducing internal covariate shift",
            "venue": "Proceedings of the 32nd International Conference on Machine Learning (ICML-15), pages 448–456",
            "year": 2015
        },
        {
            "authors": [
                "V. Nair",
                "G.E. Hinton"
            ],
            "title": "Rectified linear units improve restricted boltzmann machines",
            "venue": "ICML, pages 807–814. Omnipress",
            "year": 2010
        },
        {
            "authors": [
                "O. Russakovsky",
                "J. Deng",
                "H. Su",
                "J. Krause",
                "S. Satheesh",
                "S. Ma",
                "Z. Huang",
                "A. Karpathy",
                "A. Khosla",
                "M. Bernstein",
                "A.C. Berg"
            ],
            "title": "and L",
            "venue": "Fei-Fei. ImageNet Large Scale Visual Recognition Challenge",
            "year": 2014
        },
        {
            "authors": [
                "T. Salimans",
                "I. Goodfellow",
                "W. Zaremba",
                "V. Cheung",
                "A. Radford",
                "X. Chen"
            ],
            "title": "Improved techniques for training gans",
            "venue": "Advances in Neural Information Processing Systems, pages 2226–2234",
            "year": 2016
        },
        {
            "authors": [
                "T. Salimans",
                "D.P. Kingma"
            ],
            "title": "Weight normalization: A simple reparameterization to accelerate training of deep neural networks",
            "venue": "Advances in Neural Information Processing Systems, pages 901–901",
            "year": 2016
        },
        {
            "authors": [
                "F. Schroff",
                "D. Kalenichenko",
                "J. Philbin"
            ],
            "title": "Facenet: A unified embedding for face recognition and clustering",
            "venue": "CoRR, abs/1503.03832",
            "year": 2015
        },
        {
            "authors": [
                "C. Szegedy",
                "V. Vanhoucke",
                "S. Ioffe",
                "J. Shlens",
                "Z. Wojna"
            ],
            "title": "Rethinking the inception architecture for computer vision",
            "venue": "Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition, pages 2818–2826",
            "year": 2016
        }
    ],
    "sections": [
        {
            "text": "ar X\niv :1\n70 2.\n03 27\n5v 2\n[ cs\n.L G\n] 3\n0 M\nar 2\n01 7\nBatch Normalization is quite effective at accelerating and improving the training of deep models. However, its effectiveness diminishes when the training minibatches are small, or do not consist of independent samples. We hypothesize that this is due to the dependence of model layer inputs on all the examples in the minibatch, and different activations being produced between training and inference. We propose Batch Renormalization, a simple and effective extension to ensure that the training and inference models generate the same outputs that depend on individual examples rather than the entire minibatch. Models trained with Batch Renormalization perform substantially better than batchnorm when training with small or non-i.i.d. minibatches. At the same time, Batch Renormalization retains the benefits of batchnorm such as insensitivity to initialization and training efficiency."
        },
        {
            "heading": "1 Introduction",
            "text": "Batch Normalization (“batchnorm” [6]) has recently become a part of the standard toolkit for training deep networks. By normalizing activations, batch normalization helps stabilize the distributions of internal activations as the model trains. Batch normalization also makes it possible to use significantly higher learning rates, and reduces the sensitivity to initialization. These effects help accelerate the training, sometimes dramatically so. Batchnorm has been successfully used to enable state-of-the-art architectures such as residual networks [5].\nBatchnorm works on minibatches in stochastic gradient training, and uses the mean and variance of the minibatch to normalize the activations. Specifically, consider a particular node in the deep network, producing a scalar value for each input example. Given a minibatch B of m examples, consider the values of this node, x1 . . . xm. Then batchnorm takes the form:\nx̂i ← xi − µB\nσB\nwhere µB is the sample mean of x1 . . . xm, and σ 2 B is the sample variance (in practice, a small ǫ is added to it for numerical stability). It is clear that the normalized activations corresponding to an input example will depend\non the other examples in the minibatch. This is undesirable during inference, and therefore the mean and variance computed over all training data can be used instead. In practice, the model usually maintains moving averages of minibatch means and variances, and during inference uses those in place of the minibatch statistics.\nWhile it appears to make sense to replace the minibatch statistics with whole-data ones during inference, this changes the activations in the network. In particular, this means that the upper layers (whose inputs are normalized using the minibatch) are trained on representations different from those computed in inference (when the inputs are normalized using the population statistics). When the minibatch size is large and its elements are i.i.d. samples from the training distribution, this difference is small, and can in fact aid generalization. However, minibatchwise normalization may have significant drawbacks:\nFor small minibatches, the estimates of the mean and variance become less accurate. These inaccuracies are compounded with depth, and reduce the quality of resulting models. Moreover, as each example is used to compute the variance used in its own normalization, the normalization operation is less well approximated by an affine transform, which is what is used in inference.\nNon-i.i.d. minibatches can have a detrimental effect on models with batchnorm. For example, in a metric learning scenario (e.g. [4]), it is common to bias the minibatch sampling to include sets of examples that are known to be related. For instance, for a minibatch of size 32, we may randomly select 16 labels, then choose 2 examples for each of those labels. Without batchnorm, the loss computed for the minibatch decouples over the examples, and the intra-batch dependence introduced by our sampling mechanism may, at worst, increase the variance of the minibatch gradient. With batchnorm, however, the examples interact at every layer, which may cause the model to overfit to the specific distribution of minibatches and suffer when used on individual examples.\nThe dependence of the batch-normalized activations on the entire minibatch makes batchnorm powerful, but it is also the source of its drawbacks. Several approaches have been proposed to alleviate this. However, unlike batchnorm which can be easily applied to an existing model, these methods may require careful analysis of nonlinearities [1] and may change the class of functions representable by the model [2]. Weight normalization [10]\npresents an alternative, but does not offer guarantees about the activations and gradients when the model contains arbitrary nonlinearities, or contains layers without such normalization. Furthermore, weight normalization has been shown to benefit from mean-only batch normalization, which, like batchnorm, results in different outputs during training and inference. Another alternative [9] is to use a separate and fixed minibatch to compute the normalization parameters, but this makes the training more expensive, and does not guarantee that the activations outside the fixed minibatch are normalized.\nIn this paper we propose Batch Renormalization, a new extension to batchnorm. Our method ensures that the activations computed in the forward pass of the training step depend only on a single example and are identical to the activations computed in inference. This significantly improves the training on non-i.i.d. or small minibatches, compared to batchnorm, without incurring extra cost."
        },
        {
            "heading": "2 Prior Work: Batch Normalization",
            "text": "We are interested in stochastic gradient optimization of deep networks. The task is to minimize the loss, which decomposes over training examples:\nΘ = argmin Θ\n1\nN\nN∑\ni=1\nℓi(Θ)\nwhere ℓi is the loss incurred on the ith training example, and Θ is the vector of model weights. At each training step, a minibatch of m examples is used to compute the gradient\n1\nm\n∂ℓi(Θ)\n∂Θ which the optimizer uses to adjust Θ.\nConsider a particular node x in a deep network. We observe that x depends on all the model parameters that are used for its computation, and when those change, the distribution of x also changes. Since x itself affects the loss through all the layers above it, this change in distribution complicates the training of the layers above. This has been referred to as internal covariate shift. Batch Normalization [6] addresses it by considering the values of x in a minibatch B = {x1...m}. It then normalizes them as follows:\nµB ← 1\nm\nm∑\ni=1\nxi\nσB ← √√√√ 1 m m∑\ni=1\n(xi − µB)2 + ǫ\nx̂i ← xi − µB\nσB\nyi ← γx̂i + β ≡ BN(xi)\nHere γ and β are trainable parameters (learned using the same procedure, such as stochastic gradient descent, as all\nthe other model weights), and ǫ is a small constant. Crucially, the computation of the sample mean µB and sample standard deviation σB are part of the model architecture, are themselves functions of the model parameters, and as such participate in backpropagation. The backpropagation formulas for batchnorm are easy to derive by chain rule and are given in [6].\nWhen applying batchnorm to a layer of activations x, the normalization takes place independently for each dimension (or, in the convolutional case, for each channel or feature map). When x is itself a result of applying a linear transform W to the previous layer, batchnorm makes the model invariant to the scale of W (ignoring the small ǫ). This invariance makes it possible to not be picky about weight initialization, and to use larger learning rates.\nBesides the reduction of internal covariate shift, an intuition for another effect of batchnorm can be obtained by considering the gradients with respect to different layers. Consider the normalized layer x̂, whose elements all have zero mean and unit variance. For a thought experiment, let us assume that the dimensions of x̂ are independent. Further, let us approximate the loss ℓ(x̂) as its first-order Taylor expansion: ℓ ≈ ℓ0 + g\nT x̂, where g = ∂ℓ∂x̂ . It then follows that Var[ℓ] ≈ ‖g‖2 in which the left-hand side does not depend on the layer we picked. This means that the norm of the gradient w.r.t. a normalized layer ‖ ∂ℓ∂x̂‖ is approximately the same for different normalized layers. Therefore the gradients, as they flow through the network, do not explode nor vanish, thus facilitating the training. While the assumptions of independence and linearity do not hold in practice, the gradient flow is in fact significantly improved in batch-normalized models.\nDuring inference, the standard practice is to normalize the activations using the moving averages µ, σ2 instead of minibatch mean µB and variance σ 2 B :\nyinference = x− µ\nσ · γ + β\nwhich depends only on a single input example rather than requiring a whole minibatch.\nIt is natural to ask whether we could simply use the moving averagesµ, σ to perform the normalization during training, since this would remove the dependence of the normalized activations on the other example in the minibatch. This, however, has been observed to lead to the model blowing up. As argued in [6], such use of moving averages would cause the gradient optimization and the normalization to counteract each other. For example, the gradient step may increase a bias or scale the convolutional weights, in spite of the fact that the normalization would cancel the effect of these changes on the loss. This would result in unbounded growth of model parameters without actually improving the loss. It is thus crucial to use the minibatch moments, and to backpropagate through them."
        },
        {
            "heading": "3 Batch Renormalization",
            "text": "With batchnorm, the activities in the network differ between training and inference, since the normalization is done differently between the two models. Here, we aim to rectify this, while retaining the benefits of batchnorm.\nLet us observe that if we have a minibatch and normalize a particular node x using either the minibatch statistics or their moving averages, then the results of these two normalizations are related by an affine transform. Specifically, let µ be an estimate of the mean of x, and σ be an estimate of its standard deviation, computed perhaps as a moving average over the last several minibatches. Then, we have:\nxi − µ\nσ = xi − µB σB ·r+d, where r = σB σ , d = µB − µ σ\nIf σ = E[σB] and µ = E[µB], then E[r] = 1 and E[d] = 0 (the expectations are w.r.t. a minibatch B). Batch Normalization, in fact, simply sets r = 1, d = 0.\nWe propose to retain r and d, but treat them as constants for the purposes of gradient computation. In other words, we augment a network, which contains batch normalization layers, with a per-dimension affine transformation applied to the normalized activations. We treat the parameters r and d of this affine transform as fixed, even though they were computed from the minibatch itself. It is important to note that this transform is identity in expectation, as long as σ = E[σB] and µ = E[µB]. We refer to batch normalization augmented with this affine transform as Batch Renormalization: the fixed (for the given minibatch) r and d correct for the fact that the minibatch statistics differ from the population ones. This allows the above layers to observe the “correct” activations – namely, the ones that would be generated by the inference model.\nIn practice, it is beneficial to train the model for a certain number of iterations with batchnorm alone, without the correction, then ramp up the amount of allowed correction. We do this by imposing bounds on r and d, which initially constrain them to 1 and 0, respectively, and then are gradually relaxed.\nAlgorithm 1 presents Batch Renormalization. Unlike batchnorm, where the moving averages are computed during training but used only for inference, Batch Renorm does use µ and σ during training to perform the correction. We use a fairly high rate of update α for these averages, to ensure that they benefit from averaging multiple batches but do not become stale relative to the model parameters. We explicitly update the exponentially-decayed moving averages µ and σ, and optimize the rest of the model using gradient optimization, with the gradients cal-\nInput: Values of x over a training mini-batch B = {x1...m}; parameters γ, β; current moving mean µ and standard deviation σ; moving average update rate α; maximum allowed correction rmax, dmax. Output: {yi = BatchRenorm(xi)}; updated µ, σ.\nµB ← 1\nm\nm∑\ni=1\nxi\nσB ← √√√√ǫ+ 1 m m∑\ni=1\n(xi − µB)2\nr← stop gradient (\nclip[1/rmax,rmax] (σB σ ))\nd← stop gradient ( clip[−dmax,dmax] ( µB − µ\nσ\n))\nx̂i ← xi − µB\nσB · r + d\nyi ← γ x̂i + β\nµ := µ+ α(µB − µ) // Update moving averages\nσ := σ + α(σB − σ)\nInference: y ← γ · x− µ\nσ + β\nAlgorithm 1: Training (top) and inference (bottom) with Batch Renormalization, applied to activation x over a mini-batch. During backpropagation, standard chain rule is used. The values marked with stop gradient are treated as constant for a given training step, and the gradient is not propagated through them.\nculated via backpropagation:\n∂ℓ\n∂x̂i =\n∂ℓ\n∂yi · γ\n∂ℓ\n∂σB =\nm∑\ni=1\n∂ℓ\n∂x̂i · (xi − µB) ·\n−r σ2 B\n∂ℓ\n∂µB =\nm∑\ni=1\n∂ℓ ∂x̂i · −r σB\n∂ℓ\n∂xi =\n∂ℓ ∂x̂i · r σB + ∂ℓ ∂σB · xi − µB mσB + ∂ℓ ∂µB · 1 m\n∂ℓ ∂γ =\nm∑\ni=1\n∂ℓ\n∂yi · x̂i\n∂ℓ ∂β =\nm∑\ni=1\n∂ℓ\n∂yi\nThese gradient equations reveal another interpretation of Batch Renormalization. Because the loss ℓ is unaffected when all xi are shifted or scaled by the same amount,\nthe functions ℓ({xi + t}) and ℓ({xi · (1 + t)}) are constant in t, and computing their derivatives at t = 0 gives∑m\ni=1 ∂ℓ ∂xi\n= 0 and ∑m\ni=1 xi ∂ℓ ∂xi = 0. Therefore, if we\nconsider the m-dimensional vector {\n∂ℓ ∂xi\n} (with one ele-\nment per example in the minibatch), and further consider two vectors p0 = (1, . . . , 1) and p1 = (x1, . . . , xm), then{ ∂ℓ ∂xi } lies in the null-space of p0 and p1. In fact, it is easy to see from the Batch Renorm backprop formulas that to compute the gradient {\n∂ℓ ∂xi\n} from { ∂ℓ ∂x̂i } , we need to first\nscale the latter by r/σB , then project it onto the null-space of p0 and p1. For r = σB σ , this is equivalent to the backprop for the transformation x−µσ , but combined with the null-space projection. In other words, Batch Renormalization allows us to normalize using moving averages µ, σ in training, and makes it work using the extra projection step in backprop.\nBatch Renormalization shares many of the beneficial properties of batchnorm, such as insensitivity to initialization and ability to train efficiently with large learning rates. Unlike batchnorm, our method ensures that that all layers are trained on internal representations that will be actually used during inference."
        },
        {
            "heading": "4 Results",
            "text": "To evaluate Batch Renormalization, we applied it to the problem of image classification. Our baseline model is Inception v3 [12], trained on 1000 classes from ImageNet training set [8], and evaluated on the ImageNet validation data. In the baseline model, batchnorm was used after convolution and before the ReLU [7]. To apply Batch Renorm, we simply swapped it into the model in place of batchnorm. Both methods normalize each feature map over examples as well as over spatial locations. We fix the scale γ = 1, since it could be propagated through the ReLU and absorbed into the next layer.\nThe training used 50 synchronized workers [3]. Each worker processed a minibatch of 32 examples per training step. The gradients computed for all 50 minibatches were aggregated and then used by the RMSProp optimizer [13]. As is common practice, the inference model used exponentially-decayed moving averages of all model parameters, including the µ and σ computed by both batchnorm and Batch Renorm.\nFor Batch Renorm, we used rmax = 1, dmax = 0 (i.e. simply batchnorm) for the first 5000 training steps, after which these were gradually relaxed to reach rmax = 3 at 40k steps, and dmax = 5 at 25k steps. These final values resulted in clipping a small fraction of rs, and none of ds. However, at the beginning of training, when the learning rate was larger, it proved important to increase rmax slowly: otherwise, occasional large gradients were observed to suddenly and severely increase the loss. To account for the fact that the means and variances change as the model trains, we used relatively fast updates to the moving statistics µ and σ, with α = 0.01. Because of\nthis and keeping rmax = 1 for a relatively large number of steps, we did not need to apply initialization bias correction [? ].\nAll the hyperparameters other than those related to normalization were fixed between the models and across experiments."
        },
        {
            "heading": "4.1 Baseline",
            "text": "As a baseline, we trained the batchnorm model using the minibatch size of 32. More specifically, batchnorm was applied to each of the 50 minibatches; each example was normalized using 32 examples, but the resulting gradients were aggregated over 50 minibatches. This model achieved the top-1 validation accuracy of 78.3% after 130k training steps.\nTo verify that Batch Renorm does not diminish performance on such minibatches, we also trained the model with Batch Renorm, see Figure 1. The test accuracy of this model closely tracked the baseline, achieving a slightly higher test accuracy (78.5%) after the same number of steps."
        },
        {
            "heading": "4.2 Small minibatches",
            "text": "To investigate the effectiveness of Batch Renorm when training on small minibatches, we reduced the number of examples used for normalization to 4. Each minibatch of size 32 was thus broken into “microbatches” each having 4 examples; each microbatch was normalized independently, but the loss for each minibatch was computed as before. In other words, the gradient was still aggregated over 1600 examples per step, but the normalization\ninvolved groups of 4 examples rather than 32 as in the baseline. Figure 2 shows the results.\nThe validation accuracy of the batchnorm model is significantly lower than the baseline that normalized over minibatches of size 32, and training is slow, achieving 74.2% at 210k steps. We obtain a substantial improvement much faster (76.5% at 130k steps) by replacing batchnorm with Batch Renorm, However, the resulting test accuracy is still below what we get when applying either batchnorm or Batch Renorm to size 32 minibatches. Although Batch Renorm improves the training with small minibatches, it does not eliminate the benefit of having larger ones."
        },
        {
            "heading": "4.3 Non-i.i.d. minibatches",
            "text": "When examples in a minibatch are not sampled independently, batchnorm can perform rather poorly. However, sampling with dependencies may be necessary for tasks such as for metric learning [4, 11]. We may want to ensure that images with the same label have more similar representations than otherwise, and to learn this we require that a reasonable number of same-label image pairs can be found within the same minibatch.\nIn this experiment (Figure 3), we selected each minibatch of size 32 by randomly sampling 16 labels (out of the total 1000) with replacement, then randomly selecting 2 images for each of those labels. When training with batchnorm, the test accuracy is much lower than for i.i.d. minibatches, achieving only 67%. Surprisingly, even the training accuracy is much lower (72.8%) than the test accuracy in the i.i.d. case, and in fact exhibits a drop that is\nconsistent with overfitting. We suspect that this is in fact what happens: the model learns to predict labels for images that come in a set, where each image has a counterpart with the same label. This does not directly translate to classifying images individually, thus producing a drop in the accuracy computed on the training data. To verify this, we also evaluated the model in the “training mode”, i.e. using minibatch statistics µB , σB instead of moving averages µ, σ, where each test minibatch had size 50 and was obtained using the same procedure as the training minibatches – 25 labels, with 2 images per label. As expected, this does much better, achieving 76.5%, though still below the baseline accuracy. Of course, this evaluation scenario is usually infeasible, as we want the image representation to be a deterministic function of that image alone.\nWe can improve the accuracy for this problem by splitting each minibatch into two halves of size 16 each, so that for every pair of images belonging to the same class, one image is assigned to the first half-minibatch, and the other to the second. Each half is then more i.i.d., and this achieves a much better test accuracy (77.4% at 140k steps), but still below the baseline. This method is only applicable when the number of examples per label is small (since this determines the number of microbatches that a\nminibatch needs to be split into).\nWith Batch Renorm, we simply trained the model with minibatch size of 32. The model achieved the same test accuracy (78.5% at 120k steps) as the equivalent model on i.i.d. minibatches, vs. 67% obtained with batchnorm. By replacing batchnorm with Batch Renorm, we ensured that the inference model can effectively classify individual images. This has completely eliminated the effect of overfitting the model to image sets with a biased label distribution."
        },
        {
            "heading": "5 Conclusions",
            "text": "We have demonstrated that Batch Normalization, while effective, is not well suited to small or non-i.i.d. training minibatches. We hypothesized that these drawbacks are due to the fact that the activations in the model, which are in turn used by other layers as inputs, are computed differently during training than during inference. We address this with Batch Renormalization, which replaces batchnorm and ensures that the outputs computed by the model are dependent only on the individual examples and not the entire minibatch, during both training and inference.\nBatch Renormalization extends batchnorm with a perdimension correction to ensure that the activations match between the training and inference networks. This correction is identity in expectation; its parameters are computed from the minibatch but are treated as constant by the optimizer. Unlike batchnorm, where the means and variances used during inference do not need to be computed until the training has completed, Batch Renormalization benefits from having these statistics directly participate in the training. Batch Renormalization is as easy to implement as batchnorm itself, runs at the same speed during both training and inference, and significantly improves training on small or non-i.i.d. minibatches. Our method does have extra hyperparameters: the update rate α for the moving averages, and the schedules for correction limits dmax, rmax. A more extensive investigation of the effect of these is a part of future work.\nBatch Renormalization offers a promise of improving the performance of any model that would normally use batchnorm. This includes Residual Networks [5]. Another application is Generative Adversarial Networks [9], where the non-determinism introduced by batchnorm has been found to be an issue, and Batch Renorm may provide a solution.\nFinally, Batch Renormalization may benefit applications where applying batch normalization has been difficult – such as recurrent networks. There, batchnorm would require each timestep to be normalized independently, but Batch Renormalization may make it possible to use the same running averages to normalize all timesteps, and then update those averages using all timesteps. This remains one of the areas that warrants further exploration."
        }
    ],
    "title": "Batch Renormalization: Towards Reducing Minibatch Dependence in Batch-Normalized Models",
    "year": 2017
}